{"paragraph_text":{"0":"\"Ghetto\" Pat Calhoun and Perfidia Beverly Hills are members of a far-left revolutionary group, the French 75. While breaking out detained immigrants from Otay Mesa Detention Center, Perfidia sexually humiliates the commanding officer, Steven J. Lockjaw, who begins lusting after her. Pat and Perfidia become lovers as the French 75 attacks politicians' offices, banks, and the power grid. When Lockjaw catches Perfidia planting a bomb, he releases her after she agrees to his demands to have sex with him at a motel.","1":"12-year-old Dre Parker and his widowed mother Sherry Parker move from Detroit to Beijing, after she gets a job transfer at a car factory. Dre meets young violinist Meiying, and immediately becomes infatuated with her. However, Cheng, a rebellious 14-year-old kung fu prodigy whose family is close to Meiying's, keeps them apart by constantly attacking, teasing, and antagonizing Dre. After a field trip to the Forbidden City, Dre throws a bucket of dirty water over Cheng and his gang, causing them to chase and brutally beat Dre. Maintenance man Mr. Han intervenes and fends off the bullies, revealing himself to be a kung fu master.","2":"A gang of masked criminals rob a mafia-owned bank in Gotham City, betraying and killing each other until the sole survivor, the Joker, reveals himself as the mastermind and escapes with the money. The vigilante Batman, district attorney Harvey Dent, and police lieutenant Jim Gordon ally to eliminate Gotham's organized crime. Batman's true identity, the billionaire Bruce Wayne, publicly supports Dent as Gotham's legitimate protector, believing Dent's success will allow him to retire as Batman and romantically pursue his childhood friend Rachel Dawes—despite her being with Dent.","3":"A severely scarred Lockjaw is seemingly welcomed into the Christmas Adventurers after claiming that he was \"reverse raped\" by Perfidia, but he is fatally gassed and cremated shortly afterwards. Returning home with Willa, Bob gives her a letter from Perfidia, where she apologizes for her actions and vows to reunite with the duo soon. A short time later, Bob gives his daughter his blessing as she departs for a protest in Oakland.","4":"A textual epilogue reveals that the remaining hostages were released after 444 days in captivity; Chambers, who received the Intelligence Medal of Merit, remained friends with Mendez until his death; and Mendez, whose Intelligence Star was returned to him after Bill Clinton declassified the Canadian Caper in 1997, lives with his family in rural Maryland.","5":"Aboard the space station, Peiqiang discovers that MOSS, the station's computer commander, has decided to abandon Earth and repurpose the station as an interstellar ark to seed a new planet with Earth's biosphere. Breaking out of forced hibernation, he is joined by fellow Russian cosmonaut Maxim Makarov, whom MOSS awakens to stop Liu. While spacewalking, Makarov is killed by the spacecraft's automated security measures. Liu enters the control room, but his attempts to override the evacuation procedures are revoked. Qi's group arrives at the Sulawesi Supply Depot to find that, while most engines around the planet have been restored, the combined thrust is insufficient to divert Earth's trajectory as it approaches Jupiter's Roche limit. MOSS broadcasts a final message to the world, but Peiqiang refuses to follow the computer's instructions.","6":"After China's reforms, Ye encounters Mike Evans, heir to the world's largest oil company but also a radical environmentalist who shares Ye's ideals and disappointment in humanity. Ye discloses Trisolaris' existence to Evans, who founds and finances the secret Earth-Trisolaris Organization (ETO) as a militant fifth column for Trisolaris, with Ye as the ETO's leader.","7":"After Perfidia delivers a baby girl named Charlene, Pat unsuccessfully tries to persuade her to settle down with them. She abandons them to continue her revolutionary activities, but is captured after murdering a security guard during an armed bank robbery. Lockjaw arranges for her to avoid prison in exchange for the whereabouts of the key French 75 members.","8":"After asking the apartment's concierge and several old tenants about the boy's identity, Amélie meets her reclusive neighbour, Raymond Dufayel, an artist with brittle bone disease who replicates Pierre-Auguste Renoir's 1881 painting Luncheon of the Boating Party every year. He recalls the boy's name as \"Bretodeau\". Amélie finds the man, Dominique Bretodeau, and surreptitiously gives him the box. Moved to tears by the discovery and the memories it holds, Bretodeau resolves to reconcile with his estranged daughter and the grandson he has never met. Amélie happily embarks on her new mission.","9":"After fighting organized crime as Deadpool for two years, Wade Wilson fails to kill one of his targets on his anniversary with his girlfriend, Vanessa. That night, after the pair decides to start a family together, the target tracks Wade down and inadvertently kills Vanessa; Wade then kills him in revenge. Six weeks later, Wade is still wallowing in self-hatred. He visits Blind Al, where she unsuccessfully attempts to convince him to move on with his life. After a series of suicide attempts, Wade has a vision of Vanessa in the afterlife but remains alive due to his healing abilities. Wade is left with only a Skee-Ball token and an anniversary gift, as final mementos of Vanessa.","10":"After finding out Deebo escaped prison with his brother Tyrone to get revenge on Craig, Willie decides it would be safer for Craig to move to Rancho Cucamonga to live with his uncle Elroy and cousin Day-Day, who just won the lottery, until Deebo is sent back to prison. After some stalling, Craig explains that he really didn’t want to leave his neighborhood nor Smokey (who has since gone to rehab) behind. He accepts the fact that he needs to move after a run in with Deebo. Day-Day explains to Craig that while winning the lottery, all of the taxes and fees that were taken out only left them enough to buy their house and a car that is owned by Day-Day. A mailman delivers a notice informing them that their house could face repossession.","11":"After getting the job, Andy calls Emily and offers her the clothes she obtained in Paris. While walking past the Runway office building, Andy sees Miranda and waves at her. Miranda does not acknowledge Andy, but smiles to herself once she is seated in her car.","12":"After leaving the current, Marlin and Dory become lost and are consumed by a blue whale. Marlin fears the worst, but Dory urges him to trust the whale, which safely expels them through its blowhole into the Sydney Harbour. Nigel rescues Marlin and Dory from a flock of seagulls and delivers them to Sherman's office, where Nemo is playing dead to fake out Darla. Sherman forces Nigel out and Gill helps Nemo escape down the sink drain and into the harbour.","13":"After more failed auditions, Mia decides, with Seb's encouragement, to write a one-woman play. Seb begins to perform regularly at a jazz club, and the two of them eventually move in together (\"City of Stars\"). A former bandmate of Seb invites him to be the keyboardist in a new jazz fusion band, which will give him a steady income. Although dismayed by the band's pop style, Seb signs on after hearing Mia trying to convince her mother that he is working on his career. The band finds success, but Mia knows their music is not the type of music Seb wants to perform (\"Start a Fire\").","14":"After questioning family members, May and Kari are told that Lita was in fact a twin who was separated from her sister at birth out of fear that the Nazis, who were occupying Norway during World War II, might steal them to be used in medical experiments. Olaug learns through a DNA test that she is apparently the sisters' half-sibling, and travels to meet her half-brother Jan and his family at their ancestral farm. Olaug, an intellectual who once held high rank in the Swedish Armed Forces, soon finds herself at odds with her newfound family members who are deeply religious, and outspokenly regards them as unsophisticated.","15":"After recovering from Kagaya Ubuyashiki's trap and subduing Tamayo, Muzan Kibutsuji retreats into his dimensional stronghold, the Infinity Castle, and traps the Demon Slayer Corps inside.[c] The Demon Slayers are separated and face hordes of Lower Rank-level demons as they search for Muzan and Tamayo. Kagaya's son, Kiriya, and daughters, Kuina and Kanata, lead the operation by mapping the Infinity Castle with the Kasugai crows and locating its inhabitants, with former Hashiras Tengen Uzui and Shinjuro Rengoku standing guard.","16":"After the rest of the family leaves for winter, the Creature befriends the blind man, who teaches him to read and speak fluently. Wanting to know who he is, the Creature journeys back to the ruins of the laboratory and finds notes confirming the nature of his creation with the address to Victor's estate. He returns to the farm and finds the blind man being attacked by wolves. The Creature kills many of them and comforts his dying friend before being driven away by the returning hunters.","17":"Afterward, no longer ashamed of her patterns, Rumi celebrates with Mira and Zoey, and they later meet their fans in public.","18":"Aldous and Peter run into each other while surfing one day. During their conversation, Aldous reveals that he and Sarah began having sex a full year before she broke up with Peter. When Peter later confronts Sarah about this, she tells him she had started feeling emotionally disconnected from him and that she could no longer save their relationship.","19":"Amélie Poulain is born in 1974 and brought up by eccentric parents who – incorrectly believing that she has a heart defect – decide to homeschool her. To cope with her loneliness, Amélie develops an active imagination and a mischievous personality. When Amélie is six, her mother, Amandine, is killed when a suicidal Canadian tourist jumps from the roof of Notre-Dame de Paris and lands on her. As a result, her father, Raphaël, withdraws more and more from society. Amélie leaves home at the age of 18 and becomes a waitress at the Café des 2 Moulins in Montmartre, which is staffed and frequented by a collection of eccentrics. She is single and lets her imagination roam freely, finding contentment in simple pleasures like dipping her hand into grain sacks, cracking crème brûlée with a spoon, and skipping stones along the Canal Saint-Martin.[5]","20":"Amélie plays a cat-and-mouse game with Nino around Paris before returning his treasured album anonymously. After arranging a meeting at the 2 Moulins, Amélie panics and tries to deny her identity. Her co-worker, Gina, concerned for Amélie's well-being, screens Nino for her; Joseph's comment about this misleads Amélie to believe she has lost Nino to Gina. It takes Dufayel's insight to give her the courage to pursue Nino, resulting in a romantic night together and the beginning of a relationship. The film ends as Amélie experiences a moment of happiness she has found for herself.","21":"Amélie secretly executes complex schemes that positively affect the lives of those around her. She escorts a blind man to the Métro station while giving him a rich description of the street scenes he passes. She persuades her father to follow his dream of touring the world by stealing his garden gnome and having a flight attendant friend mail pictures of it posing with landmarks from all over the world. She starts a romance between her hypochondriacal co-worker Georgette and Joseph, a patron of the café. She convinces Madeleine Wallace, the concierge of her block of flats, that the husband who abandoned her had sent her a final conciliatory love letter just before his accidental death years before. She plays practical jokes on Collignon, the nasty greengrocer. Mentally exhausted, Collignon no longer abuses his meek, good-natured assistant Lucien. A delighted Lucien subsequently takes charge at the grocery stand.","22":"Analysis of the Death Star schematics reveals a weakness in a small exhaust port leading directly to the station's reactor. Luke joins the Rebellion's X-wing squadron in a desperate attack against the Death Star, while Han and Chewbacca leave to pay off a debt to the crime lord Jabba the Hutt. In the ensuing battle, Vader leads a squadron of TIE fighters and destroys several rebel ships, while Tarkin orders the Death Star to maneuver into position to destroy Yavin 4. Han and Chewbacca unexpectedly return in the Falcon, knocking Vader's ship off course before he can shoot Luke down. Guided by the voice of Obi-Wan's spirit, Luke uses the Force to aim his torpedoes into the exhaust port, causing the Death Star to explode moments before it can fire on the rebel base. Vader regains control of his ship, sees the destruction of the Death Star, and flees into deep space. Leia awards Luke and Han medals for their heroism in a triumphant ceremony.","23":"Andy fits in poorly with her superficial, fashion-forward co-workers, particularly Miranda's senior assistant, Emily Charlton, and struggles to adjust to the pressures and irrational demands of being Miranda's assistant. After Andy fails to arrange for Miranda to be flown back from Miami during a hurricane, Miranda berates her. Andy approaches Runway's art director, Nigel, for advice, and he helps her select stylish clothes to wear to work.","24":"Arms merchant Henrich Harlander approaches Victor after the demonstration & offers him unlimited funding and an isolated tower to continue his experiments. Victor enlists William's assistance in building his laboratory, & also grows smitten with William’s fiancé (& Harlander’s niece), Elizabeth. Victor is charmed by Elizabeth's intelligence, innate observation and passion for insects. However, after Elizabeth engages in light flirtation with Victor, she declines his advances.","25":"Arriving at Jacoby's office, he notices photos of Dom, Lily, and Jaleel and realizes Jacoby is AJ. Malcolm relays Dom's instructions to Jacoby, who denies any knowledge and implies that the contents of the bag are now Malcolm's responsibility. Jacoby reschedules the interview, warning Malcolm that if he has not sold the drugs by then, he will not receive Jacoby's recommendation to Harvard.","26":"Arriving at halftime via airboat, Bobby finds the Mud Dogs losing by a score of 27–0. As Bobby dominates the field and enables a fumble-turned-touchdown, Red has his offense take a knee, knowing Bobby cannot cause a turnover and the fact that the SCLSU offense is useless. Using the same technique of \"visualizing and attacking\" that Klein taught him, Bobby then turns the lesson back on him. Klein overcomes his fear of Beaulieu and comes up with amazing new plays. The Mud Dogs begin catching up. Bobby is then given a cheap shot by Meaney, Red's toughest defender and is knocked out cold. Vicki is able to revive Bobby by giving him the Alaskan water that Bobby had. Bobby and the Mud Dogs carry out one final play before time runs out and win the Bourbon Bowl 30–27, and Bobby is named the game's most valuable player.","27":"Arriving in 1955, Marty discovers he has no plutonium, so he cannot return to 1985. While exploring a burgeoning Hill Valley, Marty encounters his teenage father, discovering Biff was bullying George even then. George falls into the path of an oncoming car while spying on the teenage Lorraine changing clothes, and Marty is knocked unconscious while saving him. He wakes to find himself tended to by Lorraine, who becomes infatuated with him. Marty tracks down and convinces a younger Doc that he is from the future. Doc explains the only source available in 1955 capable of generating the 1.21 gigawatts of power required for time travel is a lightning bolt. Marty shows Doc a flyer from the future that documents an upcoming lightning strike at the town's courthouse. As Marty's siblings begin to fade from a photo he carries with him, Doc realizes Marty's actions are altering the future and jeopardizing his existence: Lorraine was supposed to tend to George instead of Marty after the car accident. Early attempts to get his parents acquainted fail, and Lorraine's infatuation with Marty deepens.","28":"As Jupiter begins to siphon Earth's atmosphere, Qi proposes to ignite the oxygenated mixture of the two planets’ gases, which will cause a shockwave to knock Earth back into its regular path away from Jupiter. Yiyi configures the Sulawesi engine to fire a plasma beam tall enough to ignite Jupiter, but the group is unable to push the firing pin and ignite the engine. Contacted by Duoduo, Peiqiang is able to persuade the UEG to use its communication channels to call assistance for the party at Sulawesi despite MOSS' doubts. While other rescue parties manage to ignite multiple engines, they are unable to ignite the hydrogen. After starting a fire to disable MOSS, Peiqiang pilots the space station into the plasma jet, tearfully apologizing to his son for breaking his promise to return before sacrificing himself to ignite the mix of atmospheres. The subsequent explosion narrowly saves Earth from destruction.","29":"As Victor tells Captain Anderson his story, the Creature boards the ship and enters the captain's cabin. Unable to stop the Creature, the captain taunts him. The Creature stops and decides to tell his side of the story.","30":"As the Saja Boys grow more popular, the Honmoon is weakened, allowing more demon attacks to occur. With the Idol Awards approaching, Huntr\/x rush to produce a new song, \"Takedown\", to expose the Saja Boys. Rumi's discomfort with the song's harsh, demon-hating lyrics strains her relationship with Mira and Zoey. Rumi proposes a plan to Jinu: if he helps Huntr\/x win the Idol Awards and strengthen the Honmoon, he could freely stay in the human world. Later, Rumi tells Jinu that her shame about her demon heritage weakened her voice, but talking with him healed it. Jinu says that he no longer hears voices, thanks to Rumi, and agrees to sabotage the Saja Boys. Gwi-Ma summons Jinu, reminds him of the truth that he abandoned his family for a life of wealth and comfort, then threatens to amplify the tormenting voices if he reneges on their deal.","31":"As the wedding festivities begin, Raj becomes the darling of the household. In a twist of irony, Kuljeet’s sister, Preeti, falls for him. Her parents, also enchanted by Raj, propose a match between him and Preeti — and Raj’s father, oblivious to his son’s secret, enthusiastically agrees. On the eve of Simran’s wedding, she and Raj again consider eloping, but Raj still holds out hope that they could be united without having to run away. The next morning, Baldev finds a photo of Raj and Simran in Europe, and the truth finally dawns.","32":"Aspiring journalist Andrea \"Andy\" Sachs has recently graduated from Northwestern University. Despite her lack of knowledge of the fashion industry, she is hired as a junior personal assistant to Miranda Priestly, the editor-in-chief of Runway magazine in New York City. Andy decides to tolerate Miranda's abusive treatment until she can use her connections from Runway to find a job more focused on journalism.","33":"At ICE, Rancho was an unconventional student passionate about learning. He often clashed with the strict director, Dr. Viru “Virus” Sahastrabuddhe, who valued rote discipline over curiosity. When a classmate, Joy Lobo, is denied graduation for missing a project deadline and takes his own life, Rancho blames Virus’s pressure-filled system. Virus dismisses him and later threatens to expel Farhan and Raju for associating with Rancho. That night, the trio visit Farhan and Raju’s homes and witness the hardships driving each friend’s choices.","34":"At Woo-jin's penthouse, Dae-su reveals Woo-jin's motive. An amused Woo-jin gifts Dae-su a family photo album, the contents revealing that Dae-su's daughter grew up into Mi-do. Woo-Jin's bodyguard fights Dae-Su, who stabs him in the ear and deafens him. Realising that his bodyguard will kill Dae-Su, he shoots him dead before continuing to monologue. Woo-jin reveals that he used hypnosis to orchestrate their meeting and incestuous relationship, and that he paid Park to imprison Mi-do. Woo-jin threatens to tell Mi-do the truth, and Dae-su desperately grovels; when Woo-jin is unmoved, Dae-su cuts out his tongue as penance. Woo-jin accepts his apology, instructing Park to not tell Mi-do and dropping his pacemaker remote. Dae-su uses it, but it only plays a recording of Dae-su and Mi-do having sex, making him collapse in despair. Woo-jin leaves the penthouse apparently satisfied with his work. However, he hallucinates his sister's suicide as he is in the elevator and breaks into a flood of tears. Realising that despite his vengeance he will always be tormented by his past, he pulls out his derringer, presses it to his head, and kills himself with the final bullet, symbolising how his revenge only truly hurt himself further.","35":"At a New Year's Eve party, Charlie trips on LSD. He cannot control his flashbacks of Aunt Helen, who died in a car crash on her way to buy him his 7th birthday gift. He ends up in the hospital after passing out in the snow. At a regular The Rocky Horror Picture Show performance, Sam asks Charlie to fill in for her boyfriend, Craig. Their friend Mary Elizabeth is impressed and asks him to the Sadie Hawkins dance, and they enter an unsatisfactory relationship. At a party, when Charlie is dared to kiss the prettiest girl in the room, he chooses Sam, upsetting both Sam and Mary Elizabeth. Patrick tells Charlie to stay away from the group for a while and Charlie sinks into depression. Brad shows up to school with bruises on his face after his father catches him and Patrick together. Brad says he was jumped and beaten up. When his friends start bullying Patrick during lunch, he does not stand up for him and calls him a \"faggot.\" In anger, Patrick punches him, causing him to retaliate. Brad's friends beat Patrick and prevent Sam from intervening when Charlie does, before blacking out. Upon recovering, he finds that he has incapacitated Brad's friends. Sam and Patrick thank Charlie, and the three become friends again.","36":"At a debriefing, Fury informs Stark that because of his difficult personality, S.H.I.E.L.D. intends to use him only as a consultant moving forward. Stark and Rhodes receive medals for their heroism. In a post-credits scene, S.H.I.E.L.D. agent Phil Coulson discovers a large hammer in New Mexico.[c]","37":"At the Vandergelds' annual charity auction, Latrell wins a dinner date at a restaurant with Marcus\/Tiffany. While Latrell takes Marcus\/Tiffany to a restaurant, Kevin, believing Denise likes rich men, pretends to be Latrell and takes Latrell's car to drive Denise to Latrell's house. There, he hears about criminal Ted Burton turning the tables on Heather and Megan's father, Warren. With Kevin becoming romantically involved with Denise and Marcus\/Tiffany unsuccessfully trying to reject Latrell, their combined antics put them under Gomez and Harper's suspicion.","38":"At the party, Kat becomes upset upon seeing Bianca with Joey, and responds by getting intoxicated. Patrick attends to her, and she starts to open up to him, expressing her interest in forming a band. When Kat attempts to kiss him, Patrick pulls away, causing her to depart, infuriated. Meanwhile, Bianca upsets Cameron by ignoring him for Joey, but she soon realizes that Joey is shallow and self-absorbed. When she asks Cameron to drive her home, he admits his feelings for her are genuine and her treatment of him has frustrated him, and she reconciliatorily kisses him.","39":"Aya catches up with Hirayama to return his cassette. She asks to play it in his van one last time, and then gives him a thank-you kiss on the cheek, leaving him visibly startled.","40":"Bane conspires to help Wayne Enterprises board member John Daggett take over the company, and they begin by trying to buy Bruce's fingerprints. Burglar Selina \"Catwoman\" Kyle steals Bruce's prints from Wayne Manor for Daggett, but he double-crosses her, and she alerts the police, who pursue Bane and Daggett's henchmen into the sewers while Catwoman flees. The henchmen capture Gordon and take him to Bane, but he escapes and is found by Gotham City police officer John Blake, an orphan who has deduced Bruce's secret identity, and persuades Bruce to resume his vigilantism. Bane attacks the Gotham Stock Exchange and uses Bruce's fingerprints to verify a series of fraudulent transactions, leaving Bruce ousted from his company and bankrupt. Batman resurfaces to pursue Bane's henchmen. Fearing Bruce will get himself killed fighting Bane, his butler, Alfred Pennyworth, resigns in the hope of saving him after admitting to burning a letter that Rachel left for him saying she was going to marry Dent. Bane expands his operations and kills Daggett while Bruce and Wayne Enterprises' new CEO, Miranda Tate, become lovers.","41":"Bane, a former member of the League of Shadows, leads an attack on a CIA plane over Uzbekistan to abduct nuclear physicist Dr. Leonid Pavel and fake Pavel's death in the crash. Meanwhile, eight years after the death of Gotham City District Attorney Harvey Dent and the arrest of the Joker,[b] organized crime has been eradicated in Gotham by the Dent Act, legislation that gives expanded powers to the police. Police commissioner James Gordon has kept Dent's killing spree a secret and allowed the blame for his crimes to fall on Batman. Bruce Wayne, still mourning the death of Rachel Dawes, has become a recluse, and Wayne Enterprises has stagnated.","42":"Banks returns to the camp as it is being evacuated and tells Donnelly that the aliens' language is the \"tool\" that was meant by the word \"weapon\". She experiences a premonition of a United Nations event celebrating global unity achieved by finally deciphering the heptapods' language. At the event, General Shang thanks Banks for persuading him to stop the attack when she called his private number and recited his wife's dying words.[a] He then shows her his private number and whispers his wife's words into her ear.","43":"Before Craig visits Day-Day at work at a record shop, an angry customer threatens Day-Day. Craig pushes the customer, causing him to run out of the store, and Day-Day introduces Craig to his white skateboarder friend and co-worker Roach. Craig then shows Day-Day the notice. Day Day hides from his ex-girlfriend D'Wana and her younger yet physically intimidating sister Baby D who constantly harass him saying that he is her baby's father, even though he met her when she was 3 months pregnant. D'Wana throws a brick at his car windshield. Day-Day and Roach's boss Pinky arrives at the store, finding it locked. While Day-Day and Roach are in the back smoking, a scuffle between Craig and Pinky ensues in which Pinky mistakes him for a robber, while Craig tries to explain who he is. Pinky then fires Day-Day and Roach in anger.","44":"Before the semester exams, Raju’s father suffers a stroke. Rancho and Pia rush him to the hospital, saving his life. In the subsequent semester exams, Farhan and Raju are at the bottom of the class while Rancho shockingly tops the class. This continues for the next four years. During a speech Virus, mockingly bets that Farhan and Raju will never get jobs. That night Rancho helps his friends face their fears—encouraging Farhan to pursue photography and Raju to gain confidence. They promise to act on their dreams if Rancho confesses his love to Pia.","45":"Bennington Austin \"Bink\" Cotwell IV, the nine-month-old son of socialites Laraine and Bennington Austin \"Bing\" Cotwell III, lives in a mansion in a suburb of Chicago and is just about to appear in the social pages of the newspaper.","46":"Betty is eager to marry her fiancé Spencer and expects the traditional married-student exemptions; however, Katherine insists she will grade her based on merit and expects her to complete all assignments and tests. When Betty's married life does not go smoothly, she begins taking out her frustrations on the other girls, particularly Connie and Giselle.","47":"Betty often ridicules Connie Baker and insists her cousin, Charlie, is taking Connie to her wedding reception only as a favor. Connie is surprised when he expresses genuine interest in her, and they begin dating. Connie breaks things off after Betty claims Charlie is actually dating Deb, the daughter of the couple Charlie had avoided while they were on holiday. Betty claims Connie is just a casual fling Charlie was trying to hide.","48":"Betty regrets maligning Katherine in her editorials. Eventually, Betty files for divorce, and she and Giselle plan to find an apartment in Greenwich Village. When Betty's mother confronts her at graduation, Betty chastises her and credits Katherine as being the only one who supported her, vowing to live her own life.","49":"Betty's marriage falls apart after Spencer has an affair. Betty leaves him but her mother demands she forgive him. She confronts Giselle in her dorm, at first attacking her for being promiscuous, then breaking down. Giselle is the only student who knows about Spencer's infidelity and comforts Betty.","50":"Bobby Boucher is a socially inept, stuttering, 31-year-old man serving as the water boy for the University of Louisiana football program. He lives with his protective and extremely religious mother, Helen, and believes his father, Robert Sr., died of dehydration in the Sahara, while serving in the Peace Corps back in the 1960s. As the players constantly bully Bobby, the Cougars' head coach, Red Beaulieu, fires him for being \"disruptive\" during the 18 years of his employment. Bobby approaches Coach Klein of the South-Central Louisiana State University Mud Dogs, and is retained as the water boy on a voluntary basis.","51":"Bobby passes the exam with flying colors, but Helen feigns a coma. Feeling he drove Helen to illness, Bobby stays in the hospital with her. Meanwhile, Vicki leads a gathering of fans to the hospital to convince him to play. Seeing Bobby struggling to ignore this, Helen ends her fake illness. She tells Bobby the truth about Robert Sr., who abandoned her while she was four months pregnant with Bobby to have an affair with a voodoo priestess named Phyllis in New Orleans while living up life in the city. This led to Helen constantly fearing that Bobby also would leave her. Deciding to put Bobby's happiness ahead of her own selfishness, she encourages him to play in the Bourbon Bowl.","52":"Bruce struggles to understand the Joker's motives, to which his butler Alfred Pennyworth says that \"some men just want to watch the world burn.\" Dent claims he is Batman to lure the Joker out, who attacks the police convoy transporting him. Batman and Gordon apprehend the Joker, and Gordon is promoted to commissioner. At the police station, Batman interrogates the Joker, who says he finds Batman entertaining and has no intention of killing him. Having deduced Batman's feelings for Rachel, the Joker reveals she and Dent are being held separately in buildings rigged to explode. Batman races to rescue Rachel while Gordon and the other officers go after Dent, but they discover the Joker has given their positions in reverse. The explosives detonate, killing Rachel and severely burning Dent's face on one side. The Joker escapes custody, extracts the fortune's location from Lau, and burns it, killing Lau in the process.","53":"By the late-2000s\/early-2010s, the sophon-induced apparent breakdown of science on Earth has prompted the suicides of prominent scientists. This alarms Earth's governments, who form an international task force to investigate, recruiting nanotechnologist Wang Miao and detective Shi Qiang. As part of his investigation, Wang plays the virtual reality video game Three Body, which is a simulation of Trisolaris created by the ETO to identify potential recruits and to garner sympathy for the Trisolaran plight.","54":"By the time they reunite with their group, they both have fallen in love, but neither has the courage to confess it. Simran returns to London, and confides in her mother about Raj. When Baldev finds out, his reaction is swift and unforgiving: he relocates the family to Punjab so Simran can marry Kuljeet. Raj, undeterred, travels to India. Discovering Simran’s whereabouts, he devises a plan — not to elope with her, but to win over her family. He wants their blessing, not rebellion. During a hunting trip, he stages a dramatic rescue to gain Kuljeet’s gratitude, and is invited into Kuljeet’s household, where he sets about winning the families over.","55":"Cameron James, a new student at Padua High School in the Seattle area, immediately becomes smitten with beautiful and popular sophomore Bianca Stratford. Geeky Michael Eckman warns him that she is vapid and conceited, and that her overprotective single father Walter, an obstetrician worried about teenage pregnancy, does not allow her or her shrewish older sister Kat, a senior, to date until they graduate. Kat is accepted to Sarah Lawrence College in New York, but Walter wants her to stay close to home and attend his alma mater, the University of Washington. Frustrated by Bianca's insistence and Kat's rebelliousness, Walter relents and declares that Bianca may date only when Kat does, knowing that Kat's unsocial attitude will greatly complicate it.","56":"Carrying out orders, inexperienced hitman Ray shoots a priest during confession, but accidentally kills an altar boy standing in the line of fire. He and his mentor Ken are sent to hide in Bruges by their boss Harry, where they are to sightsee and await further instruction. Ken finds the city beautiful and relaxing, while Ray is bored and hates it.","57":"Charlie meets two seniors, Patrick and his stepsister Sam. After the homecoming dance, Sam and Patrick invite him to a party with their group of friends. He unknowingly eats a pot brownie, gets high, and makes speeches to the amusement of the party-goers. He also walks in on Patrick and Brad, the high school quarterback, kissing. Patrick tells Charlie that Brad is gay, so he agrees to keep it a secret. Charlie discloses to Sam that his best friend committed suicide the year before, making her realize that Charlie has no other friends, so she and Patrick bring Charlie into their group. On their way home, the three hear an unknown song on the radio. Sam instructs Patrick to drive through a tunnel so she can stand up in the back of the pickup while the music blasts. Sam needs to improve her SAT scores to have a better chance of being accepted into Penn State University, so Charlie offers to tutor her. This improves her scores, and at Christmas, she gives him a vintage typewriter. They discuss relationships, and Charlie reveals he has never been kissed. Sam reveals that her first kiss was at age 11 by her father's boss. Charlie reveals that his Aunt Helen was sexually assaulted as a child, but she learned to deal with it and move on. Samantha tells Charlie she wants his first kiss to be with someone who loves him, and they kiss.","58":"Charlie's mental state worsens. Patrick tries to cope with what happened with Brad and kisses Charlie before immediately apologizing. Sam is accepted into Penn State, and she breaks up with Craig on prom night after learning he is cheating on her. The night before she departs, she takes Charlie to her room. They confide in each other and kiss, but when Sam touches Charlie's thigh, he experiences a flashback of his Aunt Helen, which he brushes off. After Sam leaves for college, Charlie's emotional state and flashbacks worsen. He calls his sister, blaming himself for Helen's death, and admits he may have wanted it to happen. Candace realizes he is in distress and calls the police. Charlie eyes a kitchen knife as they burst through the door and awakens in a hospital, where psychiatrist Dr. Burton brings out his repressed memories, revealing that his aunt sexually abused him as a child.","59":"Chatur Ramalingam, a successful vice president, reminds his old college rivals Farhan Qureshi and Raju Rastogi of a bet he made ten years earlier with their classmate, friend, and Chatur's nemesis, Ranchoddas “Rancho” Shamaldas Chanchad. Chatur has returned to India to close a deal with famous inventor Phunsukh Wangdu. The trio head to Shimla to find Rancho, recalling their days at the Imperial College of Engineering (ICE) in Delhi.","60":"Chris Washington, a black photographer, travels to upstate New York for a weekend getaway to meet the family of his white girlfriend, Rose Armitage. On the way, they hit a deer, and Rose defends Chris when the officer asks for his ID as he was not driving. He has uncomfortable conversations with Rose's parents, Dean, a neurosurgeon, and Missy, a psychiatrist. Later, Rose's brother Jeremy arrives, and Chris observes eerie behavior from the family's black servants, Georgina and Walter.","61":"Chris awakens strapped to an armchair in the basement. In a video, an old man, who introduces himself as Roman Armitage, explains that his family transplants the brains of their wealthy friends into black people's bodies to acquire their desirable physical characteristics, leaving the host's consciousness trapped in the sunken place. Jim Hudson appears on the TV, explaining that he wants Chris's eyesight. Meanwhile, Rod, who has been trying to contact Chris and suspects foul play, goes to the police, but they do not believe his theory about the Armitages.","62":"Christian also decides to write his thesis on the Hårga commune, irritating Josh, who has also decided to write solely about the Hårga commune. Dani is disturbed by the ceremonies, but Pelle convinces her to stay. He explains that he, too, was orphaned after his parents perished in a fire, and the commune became his new family. He questions Dani over whether she feels supported by Christian. During his thesis research, Christian is told that outsiders are sometimes brought into the commune for \"mating\" purposes to avoid incest. He is encouraged to participate but refuses. After unwittingly urinating on a sacred tree, Mark is lured away by one of the female commune members. That night, Josh sneaks out of bed to take illicit photographs of sacred texts. He is caught by a half-naked man wearing Mark's skinned face and is bludgeoned to death.","63":"Cobb explains to Ariadne that he and Mal entered Limbo while experimenting with dream-sharing, experiencing fifty years in one night due to the time dilation with reality. After waking up, Mal still believed she was dreaming. Attempting to \"wake up,\" she committed suicide and framed Cobb for her murder to force him to do the same. Cobb fled the U.S., leaving his children behind.","64":"Coleman Reese, a consultant for Wayne Enterprises, deduces and tries to expose Batman's identity, but the Joker threatens to blow up a hospital unless Reese is killed. While the police evacuate hospitals and Gordon struggles to keep Reese alive, the Joker meets with a disillusioned Dent, persuading him to take the law into his own hands and avenge Rachel. Dent defers his decision-making to his now half-scarred, two-headed coin, killing the corrupt officers and the mafia involved in Rachel's death. As panic grips the city, the Joker reveals that two evacuation ferries, one carrying civilians and the other prisoners, are rigged to explode at midnight unless one group sacrifices the other. To the Joker's disbelief, the passengers refuse to kill one another. Batman subdues the Joker but refuses to kill him. Before the police arrest the Joker, he says that although Batman proved incorruptible, his plan to corrupt Dent has succeeded.","65":"Colossus recovers Wade's body and takes him to the X-Mansion to recruit him. Wade reluctantly agrees to join the X-Men because he believes Vanessa would have wanted him to. He, Colossus, and Negasonic Teenage Warhead respond to a standoff between authorities and the unstable young mutant Russell Collins at an orphanage owned by the Essex Corporation, labeled a \"Mutant Re-education Center\". Realizing that Russell has been abused by the orphanage staff, Wade kills one of the staff members before being restrained by Colossus, and both Wade and Russell are arrested. Fitted with power-suppressing collars, they are taken to the Ice Box, an isolated prison for mutant criminals. Meanwhile, Cable, a cybernetically enhanced soldier from the future, travels back in time to kill Russell.","66":"Composer Peter Bretter is devastated when his girlfriend of five and a half years, TV actress Sarah Marshall, dumps him out of the blue. To get over Sarah, he decides to take a trip to Oahu, a place that Sarah used to talk about a lot.","67":"Conquistador Tomás Creo in New Spain fights a band of Maya to gain entry into a pyramid, where he is attacked by a Mayan priest. The story intercuts to Tom, a traveler in the twenty-sixth century who was tending a tall tree in a glass dome biosphere travelling through space, annoyed by a woman called Izzi. Finally, a third iteration, present-day surgeon Tommy Creo, is losing his wife Izzi to a brain tumor. Tommy is working on a cure using samples from a tree found through exploration in Guatemala, which are being tested for medicinal use for degenerative brain diseases in his lab. Izzi has come to terms with her mortality, but Tommy refuses to accept it, focused on his quest to find a cure for her. She writes a story called \"The Fountain\" about Queen Isabella losing her kingdom to the Inquisition and a commission given by her to Tomás Creo to search for the Tree of Life in the Central American forest in Mayan territory. As she does not expect to finish her book, Izzi asks Tommy to finish it for her. As they look up at the golden nebula of Xibalba, she imagines, as the Maya did, that their souls will meet there after death when the star goes supernova. She dies shortly thereafter and Tommy dedicates himself to curing not only her disease but death itself after seeing experimental success in reversing aging. His colleagues fear that this drive has made him reckless, but they support him in his scientific work and emotionally at Izzi's funeral. Tommy plants a sweetgum seed at Izzi's grave in the manner of a story she told him relating how a Mayan guide's dead father lived on in a tree nourished by the organic nutrients of the buried body.","68":"Craig, Day-Day and Roach try to figure out how to keep the house. Craig remembers seeing their neighbors, a trio of gang member brothers known as \"the Jokers\", who live with their sister Karla carrying a hydraulic pump. Suspecting that it may be hiding cash, Craig convinces Day-Day and Roach to help him get inside the Jokers' house and steal their pump.","69":"Dae-su reconnects with Joo-hwan, who now works at an internet café. Dae-su becomes suspicious of Mi-do and binds her, but his captor calls and sends him to a neighboring apartment. Using the pseudonym \"Evergreen\", he gives Dae-su an ultimatum: if he can uncover his motive within five days, Evergreen will remotely deactivate his pacemaker; otherwise, Evergreen will kill Mi-do. Dae-su returns to Mi-do to find Park and his thugs molesting her. Park prepares to torture Dae-su, but stops when Evergreen sends a briefcase of cash; Dae-su threatens to remove Park's hand, but Park leaves. Mi-do is upset by the ultimatum, but she and Dae-su grow closer and have sex in a love hotel.","70":"Dae-su searches for his daughter, but gives up after learning she was adopted and emigrated. Focusing on his captors, he eats at Chinese restaurants until he identifies which one prepared his prison meals. Chasing a deliveryman, Dae-su finds a private prison where people pay to have others incarcerated. He tortures and interrogates the warden, Mr. Park, who divulges that Dae-su was imprisoned for \"talking too much\". Park's guards attack Dae-su, but he fights his way through.","71":"Dae-su wakes to find Park's hand wrapped in a box; he investigates his possessions, and has his shoe debugged. Dae-su and Mi-do follow Evergreen's pseudonym to Dae-su's high-school motto: \"Evergreen Old Boys\". Identifying Evergreen as Lee Woo-jin in a yearbook, Dae-su calls Joo-hwan. Joo-hwan recalls a girl in his class, Lee Soo-ah — who is revealed to be Woo-jin's sister — and crassly describes her sex life and suicide; an eavesdropping Woo-jin angrily stabs Joo-hwan to death. Dae-su seeks out Park, who wants revenge for his hand removal; Park agrees to temporarily imprison Mi-do to keep her safe. Talking to Soo-ah's friends, Dae-su recalls witnessing her having sex with Woo-jin. Unaware it was incest, Dae-su had told Joo-hwan of her promiscuity, who then spread gossip. Woo-jin, in denial of the truth that he got his sister pregnant, claims Soo-ah developed a false pregnancy, which drove her to suicide.","72":"Deadpool organizes a team he calls X-Force to free Russell from a prison transfer convoy and protect him from Cable. The team launches its assault on the convoy by parachute, but all members die during the landing except for Wade and Domino, whose main superpower she claims to be pure luck. While a fight with Cable distracts them, Russell frees fellow inmate Juggernaut, who agrees to help him kill the abusive orphanage headmaster. Juggernaut destroys the convoy, rips Wade in half, and escapes alongside Russell.","73":"Dom Cobb and Arthur are \"extractors\" who perform corporate espionage using experimental dream-sharing technology to infiltrate their targets' subconscious and extract information. Their latest target, Saito, is impressed with Cobb's ability to layer multiple dreams within each other. He offers to hire Cobb for the ostensibly impossible job of implanting an idea into a person's subconscious; performing \"inception\" on Robert Fischer, the son of Saito's competitor Maurice Fischer, with the idea to dissolve his father's company. In return, Saito promises to clear Cobb's criminal status, allowing him to return home to his children.","74":"Dory accidentally drops the mask into an abyss and encourages Marlin to help her search for it. They find the mask but are attacked by an anglerfish. Dory exploits the anglerfish's light to read the address while Marlin traps the anglerfish with the mask. Their victory boosts Marlin's confidence and helps Dory remember the address. Marlin tries to continue his search without Dory until she convinces a school of moonfish to give them directions to the East Australian Current. On their way, Marlin and Dory become trapped in a forest of jellyfish. While trying to escape, they are both stung by jellyfish and fall unconscious.","75":"Dozens of wealthy white guests arrive for the Armitages' annual get-together, and their remarks about Chris cause him to feel uncomfortable. Chris meets a blind art dealer, Jim Hudson, who takes an interest in his photography, and Logan King, another black man. Like Walter and Georgina, Logan behaves unnaturally, and he is married to a white woman thirty years older than him. When Chris photographs Logan, the camera flash causes Logan to become hysterical, rushing at Chris and frantically lashing out at him, telling him to \"get out\". Logan is taken away by Dean, who later claims Logan had a seizure.","76":"Dragons frequently attack the Viking village of Berk, stealing livestock and endangering villagers. Hiccup Horrendous Haddock III, the 16-year-old son of chieftain Stoick the Vast, attempts to create mechanical devices to overcome his physical weaknesses. During a dragon raid, Hiccup shoots down a rare dragon called a Night Fury with a bolas huge bow, but is disbelieved. Vowing to prove himself, Hiccup searches for the dragon to kill it. Upon seeing the dragon helpless and wounded, he compassionately releases him. To Hiccup's surprise, the angered dragon spares his life.","77":"Dre finds Han drunk and depressed, smashing a Volkswagen Scirocco he was working on. He explains that he crashed it years ago, killing his wife and his 10-year-old son. To punish himself, he spends a year fixing the car, then destroys it again on every anniversary of the accident. Dre resolves to train harder and help his teacher overcome his trauma. Han helps Dre write and recite an apology in Mandarin to Meiying's father. Meiying's father accepts Dre's apology and in return lets Meiying attend Dre's tournament as promised earlier on.","78":"During a business flight, the narrator meets a soap salesman, Tyler Durden, who criticizes his consumerist lifestyle. When an explosion destroys the Narrator's apartment, he moves into Tyler's decrepit house, and the two start an underground fight club in a bar basement. Tyler saves Marla from an overdose, initiating a sexual relationship between them, while the narrator remains cold to her.","79":"During a gig at a restaurant, Seb slips into jazz improvisation (\"Mia & Sebastian's Theme\") despite the owner's warning to only play traditional Christmas pieces. Mia hears him playing as she passes by. Moved, she enters the restaurant and observes Seb being fired for his disobedience. Mia attempts to compliment him as he storms out, but he brushes by her. Months later, she runs into Seb at a party where he plays in a 1980s pop cover band. Mia requests that Seb play \"I Ran\" for her. After the gig, they walk to their cars and – despite an obvious chemistry – lament wasting the night on each other (\"A Lovely Night\").","80":"During an argument with the impersonator Potti, the cook steals the key to the chamber from Potti's waist. He opens the chamber and blows out the lamp, weakening the chathan. Thevan and the cook then fight the chathan. The cook, now revealed to be Potti's illicit son, grabs the ring and sets the chathan on fire, causing the creature inside to emerge. As the rightful heir to the ring, the cook attempts to put it on, which would legitimize his ownership over the chathan, but is stopped by Thevan, who believes that the ring's power will corrupt him or any human being who wears it. The two start fighting while the fire destroys the mana, causing it to collapse over them.","81":"During his birthday party, Stark gets drunk while wearing the Iron Man suit. Annoyed by Tony's recklessness, Stark's best friend, U.S. Air Force Lieutenant Colonel James Rhodes, dons Stark's prototype armor and tries to restrain him. The fight ends in a stalemate, and Rhodes confiscates the prototype armor for the U.S. Air Force. Nick Fury, director of S.H.I.E.L.D., approaches Stark. Fury reveals that \"Rushman\" is S.H.I.E.L.D. agent Natasha Romanoff and that Fury personally knew Howard Stark, who was a founder of S.H.I.E.L.D. Fury explains that Vanko's father and Howard invented the arc reactor together, but Howard had Anton deported when the latter tried to sell it. The Soviets then sent Anton to the Gulag. Fury gives Stark some of his father's old material. In a diorama of the 1974 Stark Expo, Stark finds a diagram of the atomic structure of a new element. With the aid of his A.I., J.A.R.V.I.S., Stark determines it can replace his arc reactor's current palladium core, and successfully synthesizes it.","82":"During the evacuation, Donnelly expresses his love for Banks. They talk about their life choices and whether he would change them if he could see his life from beginning to end. Banks knows that she will agree to have a child with him despite knowing their fate: that Hannah will die from an incurable disease and that Donnelly will leave them both as a result of her revealing that she knew this.","83":"Edmond ingratiates himself to the Mondegos by staging the kidnap and rescue of their son, Albert. He lures Fernand, Villefort, and Danglars into a trap by letting slip the notion that he has located the treasure and is shipping it through Marseille. His plans result in Danglars being caught red-handed in the act of theft and Villefort being tricked into revealing his role in Clarion's death; both are arrested. Fernand is brought to financial ruin as Edmond has his gambling debts called in. Even though his appearance has changed dramatically, Edmond is recognized by Mercédès. Eventually, she softens him, and they rekindle their relationship. As Fernand prepares to flee the country, Mercédès reveals that the only reason she married him was that she was pregnant with Albert, who is actually Edmond's son.","84":"Eight years later, in New York City, Evan and Kayleigh pass each other on the street, briefly look at each other, and continue walking.","85":"Eivind breaks up with the obsessively social-justice-and-climate-conscious Sunniva due to her restrictive lifestyle. Julie and Eivind move in together. At a small party Eivind hosts, one of his friends discovers Eivind's stash of psychedelic mushrooms, which Julie consumes, leading to hallucinations. The following night, Julie confesses to Eivind that she feels comfortable being herself around him. Aksel's brother later runs into Julie at her workplace and reveals that Aksel has incurable pancreatic cancer. Sometime later, Eivind discovers a short story Julie wrote. Assuming it is autobiographical, he asks her about it, complimenting its writing. Still emotionally overwhelmed by the news about Aksel, she angrily denies it, patronizing him.","86":"Enraged, Baldev expels Raj from the house. At the train station, Raj and Kuljeet brawl, but Raj prevails. He boards a departing train with his father, and waits for Simran to come with him. Simran pleads with her father to let her go with Raj, and moved by her conviction, Baldev relents. Simran runs towards the train, and — just like he did on that first train ride in London — Raj extends his hand and pulls Simran aboard.","87":"Eric takes a liking to Schmidt, who develops a romantic interest in Molly. Jenko becomes friends with the students in his AP Chemistry class and finds himself becoming more interested in geeky hobbies and academic pursuits. Schmidt and Jenko throw a party at Schmidt's parents' house, where they are living during the course of their assignment, and invite Eric. During the party, a fight breaks out between Schmidt, Jenko, and some party crashers from another high school. Schmidt wins the fight, impressing Eric and gaining his trust. Jenko's friends hack Eric's phone to enable them to listen in on his conversations.","88":"Eric, stressed and terrified, recruits Schmidt and Jenko as security for a deal taking place at the school prom. While dressing for the prom, Schmidt and Jenko rekindle their friendship. At the prom, Schmidt is forced to reveal his identity as a cop, upsetting Molly. When they go to the penthouse, they discover that the supplier is the physical education teacher, Mr. Walters, who created the drug accidentally and started selling it to the students to supplement his teacher's salary and pay alimony to his ex-wife. Having caught Eric smoking marijuana, he was able to persuade him to be his dealer.","89":"Escaping through a tunnel, Bob notifies the resistance network for help, but is unable to remember the password. Willa's karate teacher and community leader Sergio St. Carlos assists him while evacuating a stream of immigrants through a hidden passageway. Fleeing with Sergio's students across the rooftops, Bob falls and is apprehended. Deandra brings Willa to the Sisters of the Brave Beaver, a convent of revolutionary nuns, where she learns the truth about her mother's betrayal.","90":"Feeling sidelined, the narrator confronts Tyler, who admits to orchestrating the explosion in the narrator's apartment to free him from his lifestyle. The two argue, and Tyler soon goes missing. When the police kill Bob during a mission, the narrator tries to dismantle Project Mayhem and discovers its nationwide reach. Marla claims the narrator's name is Tyler Durden, revealing that he and Tyler are split personalities, with Tyler taking full control during the narrator's insomnia episodes. This revelation triggers Tyler's reappearance and angers him.","91":"Fernand lusts after Edmond's lover Mercédès and decides with Danglars to inform on Edmond regarding the letter, which reveals information that could be used to aid Bonaparte's escape from Elba. Villefort, the city's chief magistrate, has Edmond arrested. Villefort then learns that the letter is addressed to his own father Clarion, a Bonapartist. He burns the letter and orders Edmond imprisoned in the Château d'If, an island prison. Before being taken to the island, Edmond escapes and flees to Fernand, who reveals that he and Danglars were complicit in his betrayal, but is apprehended again. In exchange for persuading Mercédès that Edmond has been executed for treason and that she should take comfort in Fernand, Villefort has Fernand assassinate Clarion.","92":"Four weeks later, Chuck returns to the mainland, where he learns he was presumed dead by his family and friends. As he is given a hero's welcome at the FedEx headquarters in Memphis, he meets his dentist Jerry Lovett, whom he discovers has married and had a daughter with Kelly. At a homecoming party in Chuck's hotel room, Kelly is emotionally unable to greet him. Later that night, Chuck visits Kelly, where they bond for the last time; the two share a passionate kiss and confess their love for each other. Both realize she cannot leave her family and they part ways. Chuck returns the pocket watch Kelly gave him and she returns his Jeep Cherokee, which she had kept after his disappearance.","93":"Four years later, Chuck, now bearded and disheveled, has adapted to life alone on the island. After a section of a portable toilet enclosure washes up, he begins constructing a raft, which he successfully launches past the surf with Wilson, the unopened FedEx package and his belongings in tow. Chuck survives a storm, but afterward, Wilson falls off the raft and floats away. He unsuccessfully attempts to rescue Wilson and is left to grieve his loss. Soon after, he is rescued by a passing cargo ship.","94":"Giselle Levy is liberal about sex and has had several lovers, including Wellesley Italian professor, Bill Dunbar. She moves on from him when he and Katherine begin dating. Giselle admires Katherine for encouraging students' independence. She earns Betty's enmity as her (Betty's) marriage falls apart.","95":"Gotham's mafia bosses gather to discuss protecting their organizations from the Joker, the police, and Batman. The Joker interrupts the meeting and offers to kill Batman for half of the fortune their accountant, Lau, concealed before fleeing to Hong Kong to avoid extradition. With the help of Wayne Enterprises CEO Lucius Fox, Batman finds Lau in Hong Kong and returns him to the custody of the Gotham police. His testimony enables Dent to apprehend the crime families. The bosses accept the Joker's offer, and he kills high-profile targets involved in the trial, including the judge and police commissioner. Although Gordon saves the mayor, the Joker threatens that his attacks will continue until Batman reveals his identity. He targets Dent at a fundraising dinner and throws Rachel out of a window, but Batman rescues her.","96":"Grant, Tim, and Lex reach the visitor center. Grant heads out to look for Sattler, leaving Tim and Lex inside. The raptors appear and pursue Tim and Lex throughout a kitchen, but they escape, locking one in a freezer before joining Grant and Sattler. The group reaches the control room, and Lex restores the park's systems, allowing them to contact Hammond, who calls for help. As they try to leave, they are cornered by the two remaining raptors, but the Tyrannosaurus appears and kills the raptors while the group flees. Hammond arrives in a jeep with Malcolm, and they board a helicopter to leave the island. Grant and Hammond agree not to endorse the park.","97":"Griffin later involves himself in the case, revealing more about the HKPF's past with Juntao's syndicate, and implores Han to pay the ransom to avoid further bloodshed. At the opening of a Chinese art exhibition at the Los Angeles Convention Center, overseen by Han and Griffin, the now $70 million ransom is delivered, and Carter, Lee, and Johnson enter disguised as guests. Carter orders the guests to evacuate for safety, angering the FBI, but Lee catches Griffin accepting a remote for the detonator from Sang. Lee and Johnson realize Griffin is Juntao when Carter recognizes him from the Chinatown surveillance tape. Griffin threatens to detonate a bomb vest attached to Soo Yung and demands that the ransom be paid in full, as compensation for the priceless Chinese artifacts which Lee recovered in his raid. Juntao's men start a shootout with the FBI while Carter sneaks out, locates Soo Yung in the van, and drives it into the building within range of Griffin, preventing him from setting off the vest.","98":"Growing up, Evan Treborn, his friends Lenny Kagan and Kayleigh Miller, and Kayleigh's brother Tommy suffered many severe psychological traumas that caused Evan to experience frequent amnesia. These traumas include being forced to create child pornography with Kayleigh by Tommy's father George, Evan nearly being strangled to death by his institutionalized father Jason before Jason is killed in front of him by guards, accidentally killing a mother and her infant daughter while playing with dynamite, and Tommy burning Evan's dog Crockett alive. Evan keeps meticulous journals of his day to day life as a coping mechanism.","99":"Han heals Dre's injuries using the Chinese medicine methods of fire cupping. He explains that Cheng and his friends are not inherently bad, but are taught to be merciless by their teacher, Master Li. Dre asks Han to teach him kung fu, and Han accompanies him to Li's Fighting Dragons studio to make peace. Li rebuffs the peace offer and challenges Dre to fight Cheng, but Han counters that Dre compete against all Li's students at the upcoming open kung fu tournament, requesting that they let Dre train in peace until then. Li accepts, saying if Dre doesn't show up, he will inflict pain on the both of them.","100":"Han teaches Dre kung fu by emphasizing movements that apply to life in general. Serenity and maturity, not punches and power, are the keys to mastering kung fu. He has Dre repeatedly take off and pick up his jacket to develop muscle memory. Han takes him to a Taoist temple where Dre drinks the water from a Taoist well and witnesses a woman make a cobra reflect her movements. After weeks of training, Han gives Dre a day off. Dre persuades Meiying to skip school with him. After finding out, Meiying's parents deem Dre a bad influence and forbid Meiying from seeing him.","101":"Harry Potter, an orphan, lives with his cruel aunt Petunia, uncle Vernon, and cousin Dudley. On his eleventh birthday, he learns from Hagrid that he is a wizard and enrolls at Hogwarts. Harry befriends Ron Weasley and Hermione Granger. At school, Harry discovers that someone is trying to steal the Sorcerer’s Stone. He suspects Professor Snape. Harry, Ron, and Hermione work together to stop the thief. They confront Professor Quirrell, who reveals that Voldemort is possessing him and seeks the Stone. Harry ultimately defeats Quirrell\/Voldemort.","102":"Harry Potter, an orphaned boy raised by his abusive aunt, uncle, and cousin, discovers on his eleventh birthday that he is a wizard when Rubeus Hagrid escorts him to Hogwarts School of Witchcraft and Wizardry. Harry befriends Ron Weasley and Hermione Granger after arriving at Hogwarts. The three learn about the Sorcerer’s Stone, a magical object that grants immortality.","103":"Harry calls Ken and reveals that the trip was an attempt to give Ray a good experience before he dies. He orders Ken to kill Ray, on the principle that killing a child, even accidentally, is unforgivable. With a handgun supplied by Harry's local contact Yuri, Ken tracks Ray to a park and reluctantly prepares to kill him. Ray, however, distraught at his killing of the boy, prepares to kill himself with Eirik's loaded gun. Seeing this, Ken stops Ray, informs him of Harry's order and tells him to leave Bruges to have a fresh start. He gives Ray some money and puts him on a train to another city, while confiscating his gun to prevent a further suicide attempt. Ken phones Harry to tell him the truth, and Harry immediately sets out for Bruges, furious at the insubordination. He picks up a gun and a box of dumdum bullets at Yuri's, and Eirik, Yuri's son, learns of his intention.","104":"Harry chases Ray to the hotel; Marie, the pregnant owner, refuses Harry entry, even when he draws his gun. To protect the owner and her unborn child, Harry and Ray agree to continue the chase on a nearby canal. Ray jumps onto a passing barge, but loses Eirik's gun. Harry wounds Ray with a shot from a distance. Ray stumbles into the street where Jimmy's film is shooting; Jimmy is costumed as a schoolboy. Harry catches up and repeatedly shoots Ray with the dumdum bullets. One of the bullets hits Jimmy, blowing his head open. Harry mistakenly believes that he has killed a child and, despite protests from Ray, kills himself. As Ray is loaded into an ambulance, he reflects on the nature of hell, speculating that it is an eternity in the city of Bruges, and hopes desperately that he does not die.","105":"Harry journeys to Hogwarts aboard the Hogwarts Express, where he meets Ron Weasley and Hermione Granger. Upon arrival, the first-year students are sorted into four houses: Harry, Ron, and Hermione join Gryffindor, while the haughty Draco Malfoy goes to Slytherin, known for producing dark wizards. As they begin learning about magic and exploring Hogwarts, the three accidentally wander onto a forbidden corridor on the third floor, guarded by a giant three-headed dog named Fluffy; they subsequently question what it could be guarding.","106":"Harry’s rival Draco Malfoy antagonizes him throughout the school year. Harry also learns that Professor Snape seems to dislike him. As Harry and his friends investigate the mystery of the Stone, they suspect Snape is trying to steal it for Lord Voldemort.","107":"Having realized his misdeeds through the Creature's story, Victor apologizes to him for his abuse & addresses him as his 'son’. The Creature forgives Victor, who then succumbs to his injuries as the Creature calls him 'father.' The Creature climbs off the ship and pushes the ship out of the ice into open water. Anderson abandons his own reckless pursuit by telling his crew that they are returning home. The Creature watches the ship sail toward the sunset, reaching out to embrace the sunlight as Victor once taught him.","108":"Hirayama's young assistant, Takashi, is often late, loud, and not as thorough. One day, a young woman named Aya calls on Takashi at the toilet he is cleaning, so he hurries to finish. He tries to leave with Aya, but his motorbike will not start, so he persuades Hirayama to let him use his van. When Aya says Takashi can stay with her as she works at a girls bar, he complains that he is broke. Unbeknownst to Hirayama, Takashi slips Hirayama's Patti Smith tape into Aya's purse. Takashi talks Hirayama into going into a shop to get some of his cassettes appraised. When Takashi discovers they are valuable, he urges Hirayama to sell but Hirayama refuses, giving him some cash so he can take Aya out. When Hirayama runs out of fuel, he is forced to sell a cassette for fuel money.","109":"Ignacio is a cook for the Oaxaca monastery orphanage where he was raised. He dreams of becoming a luchador, but wrestling is strictly forbidden by the monastery as it is considered a sin of vanity. Though Ignacio cares deeply for the orphans, he is unable to provide decent meals for them due to a lack of funds. He also struggles with his feelings for Sister Encarnación, a nun who has just arrived to teach at the orphanage. One night, Ignacio is mugged of the orphanage's tortilla chips by a street thief. While on the way home, a dejected Ignacio is brightened up when he sees his idol, an enormous gold-masked luchador champion named Ramses, giving autographs and being bombarded by paparazzi in the streets, and at the same time, Ignacio sees a flyer for an amateur tag team wrestling match.","110":"In 1815, Edmond Dantès, second mate of a French merchant vessel, and his friend Fernand Mondego, a representative of the shipping company, seek medical help on Elba for their ailing captain. Napoleon Bonaparte is in exile on the island. Having kept his guardians from killing the pair, Bonaparte privately requests that Edmond deliver a letter to the mainland in exchange for his physician's services. Edmond is sworn to secrecy, but Fernand witnesses the exchange. The captain dies. In Marseille, the company owner, Morrell, commends Edmond for his bravery, promoting him to captain over first mate Danglars, who had given Edmond explicit orders not to land at Elba.","111":"In 1857, the Horisont, a Royal Danish Navy expedition ship bound for the North Pole, becomes trapped in ice. After bringing aboard a badly injured Baron Victor Frankenstein, the crew is attacked by a Creature who demands Victor's surrender. Using a Blunderbuss to break the ice under the Creature & causing it to sink into the frozen water, Captain Anderson demands that Victor tell him what the Creature is. Victor explains that he is the Creature's creator and begins to recount the events that led to its creation.","112":"In 1932, identical twins and World War I veterans Elijah \"Smoke\" and Elias \"Stack\" Moore return home to Clarksdale, Mississippi after seven years working for the Chicago Outfit. Using money stolen from gangsters, they purchase a sawmill from landowner Hogwood to start a juke joint for the local Black community. Their younger cousin Sammie, a singer and guitarist, joins them despite his pastor father Jedidiah's warnings about the sins of blues music.","113":"In 1936, British composer Robert Frobisher finds work as an amanuensis to aging composer Vyvyan Ayrs, allowing Frobisher to compose his own masterpiece, \"The Cloud Atlas Sextet\". As the sextet nears completion, Ayrs demands credit for it and threatens to expose Frobisher's bisexuality if he refuses. Frobisher shoots and wounds Ayrs and goes into hiding. Frobisher finishes the sextet and shoots himself before his lover Rufus Sixsmith arrives.","114":"In 1947, Portland, Maine, banker Andy Dufresne arrives at Shawshank State Prison to serve two consecutive life sentences for murdering his wife and her lover. He is befriended by Ellis Boyd \"Red\" Redding, a contraband smuggler serving a life sentence, who procures for him a rock hammer and a large poster of Rita Hayworth. Assigned to work in the prison laundry, Andy is frequently raped by \"the Sisters\" gang, led by Bogs Diamond.","115":"In 1949, Andy overhears the captain of the guards, Byron Hadley, complaining about being taxed on an inheritance and offers to help him shelter the money legally. After the Sisters beat Andy to near-death, Hadley cripples Bogs, who is subsequently transferred to a minimum-security hospital; Andy is not attacked again. Warden Samuel Norton assigns Andy to the prison's decrepit library, ostensibly to assist elderly inmate Brooks Hatlen, but in reality, to use Andy's financial expertise in managing the warden's and other prison staff's finances. Andy also starts writing weekly letters to the state legislature, requesting funding to improve the library.","116":"In 1965, Andy and Red befriend Tommy Williams, a young inmate convicted of burglary. Andy helps Tommy pass his General Educational Development exam, and Tommy later reveals that his cellmate at another prison confessed to committing the murders for which Andy was convicted. When Andy informs Norton, the warden refuses to act. Although Andy promises to keep the money laundering a secret, Norton sends Andy to solitary confinement and has Hadley kill Tommy under the guise of an escape attempt. Norton then threatens to destroy the library, strip Andy of guard protection, and transfer him to harsher conditions if he refuses to continue with his scheme.","117":"In 1985, teenager Marty McFly lives in Hill Valley, California, with his depressed alcoholic mother, Lorraine; his older siblings, who are professional and social failures; and his meek father, George, who is bullied by his supervisor, Biff Tannen. After Marty's band fails a music audition, he confides in his girlfriend, Jennifer Parker, that he fears becoming like his parents despite his ambitions.","118":"In 1988, businessman Oh Dae-su is arrested for assault and drunkenness, causing him to miss his daughter's fourth birthday. His friend Joo-hwan collects him, but Dae-su disappears and awakens in a sealed hotel room. Takeout food is delivered through a pet door, and his only diversion is a television; from it, Dae-su learns that he has been framed for his wife's murder. As years pass, Dae-su grows deranged from solitude and attempts suicide by wrist-cutting, but is resuscitated. Dae-su then begins practicing martial arts against the wall and attempting to dig an escape tunnel.","119":"In 2003, Dae-su is sedated, hypnotised, and released after 15 years. He awakens on a rooftop, where he saves a suicidal man and recounts his story; once finished, Dae-su allows the man to commit suicide. Dae-su receives money and a phone from a beggar, and enters a sushi restaurant. Taunted by his captor over the phone, Dae-su orders and consumes a live octopus before collapsing. He is taken in by the young sushi chef, Mi-do, who reads his journals. Dae-su unsuccessfully attempts to rape her; he regretfully attempts to leave, but they reconcile and bond over their loneliness.","120":"In 2005, unpopular-yet-scholarly student Morton Schmidt and popular-yet-underachieving athlete Greg Jenko miss their school prom, Schmidt being rejected by the girl he was trying to ask to be his date and Jenko being barred from attending due to failing grades. Seven years later, the duo meets again at the police academy and become friends and partners on bicycle patrol. They catch a break when they arrest Domingo, the leader of a one-percenter motorcycle gang, but are forced to release him after they fail to read him his Miranda rights.","121":"In 2321, the tribesmen of a post-apocalyptic Hawaii worship Sonmi, whose recorded testimony is the basis of their sacred text. Zachry Bailey's village is visited by Meronym, a member of an advanced, off-world society called the Prescients, who are dying from a plague. Meronym is searching for a forgotten communication station on Mauna Sol to send an SOS to off-world humans. In exchange for healing Zachry's niece, Catkin, Meronym is guided by Zachry to the station where Sonmi made her recording. Returning home, Zachry finds his tribe slaughtered by the cannibalistic Kona tribe. He kills the sleeping Kona chief and rescues Catkin before he and Meronym fight off the other Kona tribesmen. Zachry and Catkin join Meronym and the Prescients as their ship leaves Big Island. On a distant planet, Zachry is married to Meronym and recounts the story to his grandchildren.","122":"In April 2003, avid mountaineer Aron Ralston goes hiking at Utah's Canyonlands National Park without telling anyone. He befriends lost hikers Kristi and Megan and gives them directions. While guiding them, he shows them an underground pool. The three have fun, and that afternoon, the girls invite him to a party that is being held the following night. Aron expresses half-hearted interest and says goodbye to the girls, who head home.","123":"In December 1995, Chuck Noland is a FedEx systems analyst who travels the world resolving productivity problems. He lives with his girlfriend, Kelly Frears in Memphis, Tennessee. The two talk of getting married but keep experiencing setbacks because Chuck is constantly called away to work, which starts to put a strain on their relationship. During a Christmas dinner, Chuck experiences pain due to an infected tooth, just before he is summoned to resolve a FedEx problem in Malaysia. Before leaving, Kelly gives Chuck her grandfather's pocket watch with a photo of her in it. He gives her a small box, saying she can wait to open it on New Year's Eve when he returns, implying it is an engagement ring.","124":"In Korea in 2144, Sonmi-451 is a \"fabricant\", a humanoid clone indentured as a fast food server in a dystopian Neo Seoul. She is exposed to ideas of rebellion by another fabricant, Yoona-939, who has obtained a clip of the movie about Cavendish's involuntary institutionalization. After Yoona is killed, Sonmi is rescued by rebel Commander Hae-Joo Chang, who exposes Sonmi to the banned writings of Aleksandr Solzhenitsyn and the full film version of Cavendish's experience. Eventually, Hae-Joo shows her that fabricants are actually recycled into food that keeps them acquiescent. Sonmi makes a public broadcast of her revelations before the authorities attack, killing Hae-Joo and recapturing Sonmi. After recounting her story to an archivist, she is executed.","125":"In London, 2012, gangster Dermot Hoggins murders a critic after a harsh review of his memoir, generating huge sales. Hoggins's brothers threaten the publisher, the aging Timothy Cavendish, for Hoggins's profits. Timothy's brother, Denholme, tells him to hide at Aurora House. Believing Aurora House is a hotel, Timothy signs in, only to discover he has unwittingly committed himself to a nursing home where all outside contact is prohibited; Denholme reveals that he sent Timothy there as revenge for an affair with his wife. Timothy escapes with three other residents, resumes his relationship with an old flame, and writes a screenplay about his experience.","126":"In New York City, FBI agent brothers Marcus Anthony II and Kevin Copeland inadvertently ruin a drug bust. Their boss, Chief Elliott Gordon, offers them a reprieve if they safely escort sisters Brittany and Tiffany Wilson - the rich, shallow socialite daughters of Wilson Cruiseliners CEO Andrew Wilson, whom the police suspect will become the next victims in a string of high-profile kidnappings - to a weekend-long fashion event in the Hamptons. On the drive, the sisters' dog Baby leaps out of the car window, causing Kevin to lose control of the car. The sisters suffer minor facial cuts, but refuse to be seen with them. Kevin sends them into hiding and has a makeup expert friend create prosthetic disguises so he and Marcus can replace them.","127":"In New York City, Steve Rogers is rejected for U.S. Army recruitment due to his small stature and poor health. While attending the Stark Expo, an event held by famous engineer Howard Stark, Rogers attempts to enlist again. Overhearing Rogers tell his best friend, James \"Bucky\" Barnes, that he wants to fight for his country, Dr. Abraham Erskine allows Rogers to enlist. He is recruited into the Strategic Scientific Reserve as part of a \"super-soldier\" experiment under Erskine, Stark, Colonel Chester Phillips, and British MI6 agent Peggy Carter. Phillips is not convinced by Erskine's claims that Rogers is the right person for the procedure until Rogers selflessly jumps on a grenade as part of a test. Erskine reveals to Rogers that he was a scientist under Schmidt, until the latter took a prototype version of the super-soldier formula that gave him superhuman strength but painfully changed his appearance.","128":"In Paris, Andy learns that Miranda's husband has filed for divorce. Later that night, Nigel tells Andy that he has accepted a job as creative director with rising designer James Holt. She spends the night with an attractive writer, Christian Thompson, who tells her that Jacqueline Follet (Miranda's counterpart as editor-in-chief at French Runway) is being prepped to replace Miranda. Andy attempts to warn Miranda, but Miranda dismisses her.","129":"In Russia, the media covers Tony Stark's disclosure of his identity as Iron Man. Ivan Vanko, mourning the death of his father Anton Vanko—a former Stark Industries employee, sees this and builds the same miniature arc reactor as Stark's using old Stark Industries blueprints left behind by Anton.","130":"In San Francisco, 1973, journalist Luisa Rey meets Sixsmith, now a nuclear physicist. Sixsmith tips off Rey to a conspiracy to create a catastrophe at a nuclear reactor run by Lloyd Hooks, who secretly promotes oil-energy interests. He is killed by Hooks' hitman, Bill Smoke, before he can give her a report as proof. Scientist Isaac Sachs passes her a copy of Sixsmith's report, but Smoke kills Sachs and then runs Rey's car off a bridge, destroying the report. With help from the plant's head of security, Joe Napier, Rey evades another murder attempt, and Smoke is killed. With another copy of the report from Sixsmith's niece, Rey plans to expose the plot.","131":"In a world populated by anthropomorphic vehicles, the Dinoco 400 race marks the climax of the Piston Cup season. The event intensifies a rivalry between the retiring seven-time champion, Strip \"The King\" Weathers, the cunning Chick Hicks, and the talented but overconfident rookie, Lightning McQueen, who are all tied for the most points. Lightning is desperate to win and leave his unglamorous Rust-eze sponsorship for the prestigious Dinoco, and struggles with teamwork due to his self-centered attitude. At the end of the high-stakes race, Lightning squanders his lead by refusing to take a pit stop, causing his rear tires to blow out before he can win. The race ends in a three-way tie, setting the stage for a decisive race at the Los Angeles International Speedway in one week.","132":"In an attempt to trick Rosie into exposing her location, General Kane announces plans to forcibly marry Sofía. Having learned Rosie's identity from a magazine, Brooke threatens to expose her unless she drops out of the vote for homecoming queen. Rosie reads of the pending nuptials in the magazine and tells Carter that she has decided to return home. Knowing Costa Luna is still too dangerous, Carter devises a plan to disguise herself as Rosie and use herself as bait to lure Kane into capture. Carter calls Mr. Elegante, Rosie's royal dressmaker and friend, for help with her plan. He tells Kane that Rosie will be attending the homecoming dance and plans to wear a blue dress, which he actually sends to Carter, giving Rosie a pink one. In the meantime, Rosie agrees to stay for the dance.","133":"In other efforts to become popular, the boys join the Safety Patrol team and a contest to become the school paper's cartoonist. After Greg accidentally breaks Rowley's arm during a game they invented, Rowley becomes popular and wins the cartoonist contest. During a Safety Patrol assignment, Greg walks kindergartners down a neighborhood street without Rowley. He encounters a truck identical to the teenagers' from Halloween and hides the kids in a construction zone. Having borrowed Rowley's coat, he is confronted by a neighbor who mistakes him for Rowley. He flees, abandoning the kindergarteners. Rowley is bewildered to be suspended from Safety Patrol, until Greg confesses. Greg is fired from the service, while Rowley is reinstated as captain and ends their friendship. Greg tries to reconcile with Rowley at the Mother and Son Sweetheart Dance until he sees that Rowley has befriended Collin Lee instead.","134":"In prison, Clyde demands a new mattress in his cell in exchange for a \"confession\". Nick initially refuses, but after learning that Clyde traumatized Nick's family with the video of Darby's murder, District Attorney Jonas Cantrell orders Nick to make the deal. In court, Clyde represents himself and successfully argues, before Judge Laura Burch, that he should be granted bail. He then belittles Burch for accepting the legal precedent he cited, reveals that he knows that Burch lazily convicted Ames and gave Darby a meaningless sentence, and criticizes her for being too easily convinced and eager to release potential criminals; Clyde is then denied bail and also jailed for contempt of court.","135":"In the American North Desert, a lamb’s elegant dancing is popular with the other animals. One day lamb-shearers arrive and shear him for wool. The other animals mock his skinny, bare state and he becomes shy and loses the confidence to dance. As the lamb mourns, a benevolent jackalope comes across him, and teaches him the merits of \"bounding\", not just dancing (that is, getting up whenever one falls down). The lamb is converted and his joy in life is restored. The lamb's wool eventually grows back in the winter, only for it to be cut again, but his confidence is now completely unshaken and he continues to \"bound.\"","136":"In the Chatham Islands, 1849, American lawyer Adam Ewing is waiting for his transport ship to be repaired. He witnesses the whipping of Autua, an enslaved Moriori man. Autua stows away on Ewing's ship, having noticed Ewing's sympathy, and persuades him to advocate for Autua to join the crew as a free man. Autua saves Ewing's life before the ship's doctor, Henry Goose, can poison Ewing and steal his gold under the guise of treating him for a parasitic worm. In San Francisco, Ewing and his wife Tilda denounce her father's complicity in slavery and leave for New York to join the abolition movement.","137":"In the Mayan jungle, Tomás finds that most of his fellow knights are exhausted and refuse to continue searching for the Tree of Life. After a failed mutiny and the death of their priest guide, he takes the few who remain loyal with him to a pyramid, carrying a ceremonial dagger. Once he arrives at the pyramid, the first scene repeats and Tomás engages in combat with the Mayan priest. Tom (whether he is a version of Dr. Tommy Creo, an element of Izzi's story, or an incarnation of Tommy himself in the future is unclear) spends much of his time performing physical or mental exercises, including a form of meditation allowing him to perceive and interact with the past. In that past, Tomás is stabbed in the stomach but, just as the priest is about to kill him, he appears before the figurehead. The priest now believes Tomás is the \"First Father\" who birthed all life. Tomás kills the priest as a sacrifice and proceeds to a pool with a large tree, convinced this is the Tree of Life. Tomás applies some of its sap to his torso and is cured of his stab wound. He drinks the sap flowing from the bark. But in a reenactment of the Mayan creation myth recounted earlier, his body is turned into flowers and grass that burst forth from it and he literally gives rise to new life, killing himself in the process. In space, the tree finally dies just before the spaceship arrives at its destination, much to Tom's horror. A final vision of Izzi appears, comforting him in the face of his acceptance of death. The star goes supernova, engulfing the ship and everything within. Tom's body, engulfed by the dying star inside the nebula, is absorbed by the tree, causing it to flourish back to life. Izzi's apparition picks a fruit from the new tree of life and hands it to Tommy, who plants it in Izzi's grave, accepting her death and moving on.","138":"In the Pride Lands of Africa, a lion named King Mufasa and Queen Sarabi present their newborn son, Simba, to the animals gathered at Pride Rock. Mufasa's younger brother, Scar, resents Simba's birth because it makes him second in line to the throne. As Simba grows, Mufasa teaches him about the “Circle of Life” and their kingdom. Scar plots to kill Simba and Mufasa in order to claim the throne. He tricks Simba into exploring a dangerous gorge and later orchestrates a wildebeest stampede, killing Mufasa when he tries to save Simba. Scar convinces Simba that he is responsible for the tragedy and advises him to flee the Pride Lands.","139":"In the Pride Lands of Tanzania, a pride of lions rules over the kingdom from Pride Rock. King Mufasa and Queen Sarabi's newborn son, Simba, is presented to the gathered animals by Rafiki, the mandrill who serves as the kingdom's shaman and advisor. Mufasa's younger brother, Scar, covets the throne and plots to eliminate Mufasa and Simba so that he may become king.","140":"In the climax, Harry confronts Professor Quirrell, who is possessed by Voldemort. Quirrell attempts to kill Harry and take the Stone, but Harry defeats him. Harry recovers in the hospital wing and returns home for the summer.","141":"In the demon world, Gwi-Ma grows enraged at his minions' failures. Five demons, led by former human Jinu, form a boy band called the Saja Boys to steal Huntr\/x's fans and weaken the Honmoon, in exchange for Gwi-Ma promising to Jinu to erase his painful human memories. Watching their debut, Huntr\/x quickly discover the Saja Boys' demonic nature and later attack them. As they fight, Jinu discovers Rumi's patterns, but helps hide them from her bandmates. Meeting privately, Jinu tells Rumi that feelings of shame enslave demons through voices from Gwi-Ma. He shares with her that 400 years prior, Gwi-Ma granted him a beautiful voice that helped his family emerge from poverty, but then condemned him to the demon world; Jinu now lives with guilt over his family's downfall.","142":"In the middle of winter, an American student, Dani, is traumatized after her bipolar sister Terri kills their parents and herself via carbon monoxide poisoning in a murder-suicide. This strains Dani's relationship with her already increasingly distant boyfriend, Christian.","143":"In the present, the K-pop girl group Huntr\/x—comprised of Rumi, Mira, and Zoey—are the latest demon-hunting trio, trained by former hunter Celine. Rumi is secretly half-demon, a fact known only to her and Celine, who raised Rumi. Disquieted by the demonic patterns gradually spreading across her skin, Rumi pushes forward the release and live performance of Huntr\/x's new single, \"Golden\", hoping it will turn the Honmoon gold and thereby erase her patterns. However, as they prepare for the performance, Rumi begins to lose her voice.","144":"In the upscale Miami suburb of Blue Bay, wealthy student Kelly Van Ryan accuses her high school guidance counselor, Sam Lombardo, of raping her. Following the accusation, her outcast classmate Suzie Toller, who comes from a poor family in the Everglades, makes a similar accusation. Sam hires attorney Kenneth Bowden to defend him. At trial, Suzie succumbs to pressure during cross-examination and admits that she and Kelly concocted the false allegations to get revenge on Sam. Suzie was seeking revenge for Sam's failure to bail her out of jail on a minor drug charge, and Kelly was seeking revenge for Sam's affair with her mother, real estate heiress Sandra Van Ryan. Sam and Kenneth negotiate an $8.5 million settlement for defamation, which Sandra pays out using funds from a trust Kelly would receive only upon Sandra's death. After the payout, it is revealed that Sam and the two girls were accomplices, using the trial to extort money from Sandra.","145":"In the year 2078, an anomalously expanding red giant Sun threatens to engulf the Earth within 100 years. Under a world government, humanity has constructed 12,000 enormous fusion-powered \"Earth Engines\" to thrust Earth out of the Solar System. Before his mission aboard the Navigation Platform International Space Station, Chinese astronaut Liu Peiqiang leaves his son Qi in the care of his father-in-law Han Zi'ang. Half of humanity, mostly chosen by lottery, moves underground; the others die from the cold and cataclysms resulting from the halt of the Earth's rotation as the planet is thrust out of its orbit around the Sun.","146":"Industrialist John Hammond has created Jurassic Park, a theme park of de-extincted dinosaurs, on the tropical island Isla Nublar, off the coast of Costa Rica. After a Velociraptor kills a dinosaur handler, the park's investors, represented by lawyer Donald Gennaro, threaten to pull funding unless experts certify the island's safety. Gennaro invites chaotician Ian Malcolm, and Hammond invites paleontologist Alan Grant and paleobotanist Ellie Sattler. Upon arrival, the group is shocked to see living Brachiosaurus and Parasaurolophus. At the park's visitor center, the group learns that the cloning was accomplished by extracting dinosaur DNA from prehistoric mosquitoes preserved in amber. DNA from frogs, among other animals, was used to fill in gaps in the dinosaurs' genome.","147":"Irritated at not being asked to the prom by Cameron, Bianca accepts Joey's invitation, but Walter declines to allow it unless Kat accompanies her. Kat confesses to Bianca that she dated Joey when they were freshmen and, succumbing to peer pressure, had sex with him, later regretting it. After Joey dumped her, she vowed against doing anything out of peer pressure. Bianca insists that she can decide her own life, so Kat goes to the prom with Patrick, and Bianca goes to the prom with Cameron instead of Joey. Joey goes to the prom with Chastity. At the prom, Bianca learns from Chastity that Joey was planning to have sex with Bianca that night. Angry that Bianca has spurned him for Cameron, Joey reveals his arrangement with Patrick, which causes Kat to leave, heartbroken. Joey then shoves Michael and punches Cameron, but Bianca then punches him for hurting her, Kat, and Cameron. Bianca and Cameron share another kiss.","148":"It is revealed that Sam is in cahoots with Ray. Although Sam is displeased that Ray killed Kelly instead of simply framing her for Suzie's murder, he agrees that they now have fewer loose ends to deal with. The two go sailing on Sam's boat, where Sam attempts to kill Ray. When Ray fights back, he is shot and killed with a speargun by Suzie, who staged her murder with Sam. Suzie reveals she was motivated to kill Ray to avenge the murder of her best friend, Davey, whom Ray wrongly shot to death and framed as a self-defense killing. Sam reluctantly accepts a drink from Suzie, who assures him she will not double-cross him; however, upon drinking it, he realizes she has poisoned it before Suzie knocks him overboard and sails into the sunset.","149":"Joan Brandwyn considers studying law at Yale Law School, so Katherine encourages her to apply. Although accepted, Joan declines admission to instead elope with Tom Donegal. When Joan tells Katherine it is what she truly wants, Katherine offers congratulations and wishes her happiness.","150":"Joey offers to pay Patrick to take Kat to the prom so he can take Bianca. He initially refuses, but relents when Joey offers him more money. Although Kat is still angry with Patrick, he eventually wins her over by serenading her, accompanied by the Padua High School marching band, with a performance of \"Can't Take My Eyes Off You\" by Frankie Valli, and she returns the favor by assisting him in sneaking out of detention. Their subsequent date turns romantic, but Kat becomes suspicious when Patrick insists that she accompany him to the prom, which she adamantly opposes.","151":"Johnson gets the vest off Soo Yung, while Griffin heads to the roof with the bag of money. Lee takes the vest and pursues Griffin. Sang tries to deceive Carter and pulls a gun on him but Carter manages to shoot Sang first and saves Russ. Lee has a brief altercation with Griffin that culminates in both dangling from the rafters. Griffin, holding on to the vest, falls to his death when its straps are torn, but when Lee falls, Carter catches him with a large flag. Han and Soo Yung are reunited and Han sends Carter and Lee on vacation to Hong Kong as a reward. Before Carter leaves, agents Russ and Whitney offer him a position in the FBI, which he mockingly refuses, proudly stating he is LAPD. Carter boards the plane with Lee, who annoyingly starts singing Edwin Starr's \"War\" off-key. A desperate Carter yells for a stewardess, demanding that she give him another seat.","152":"Jojo Rabbit is a 2019 satirical black comedy-drama film written and directed by Taika Waititi, adapted from Christine Leunens's 2008 book Caging Skies. Roman Griffin Davis makes his film debut as the title character, Johannes \"Jojo\" Betzler, a ten-year-old Hitler Youth member who finds out that his mother (Scarlett Johansson) is hiding a Jewish girl (Thomasin McKenzie) in their attic. He must then question his beliefs while dealing with the intervention of his imaginary friend, a childlike, eccentric version of Adolf Hitler (played by Waititi) with a comedic stance on the politics of the war. The film also stars Sam Rockwell, Rebel Wilson, Stephen Merchant, and Alfie Allen.","153":"Joker goes out to look for his brothers and finds Elroy on the ground due to his back giving out after tackling Lil' Joker. Craig then engages him in a fight. As Craig and Joker fight, Day-Day and Roach, while bound and gagged, attempt to escape but fail until Elroy comes and unties them. Day-Day and Roach run to Craig’s aid but Joker gains the upper hand when he picks up his AK-47. Deebo and Tyrone then appears and knocks Joker out. Armed with Joker's rifle, Deebo prepares to shoot but is bitten by Chico. The sheriff's department arrive and arrest the Joker brothers, Deebo and Tyrone. Craig leaves with the Jokers' pump and the money inside it. They watch TV and neighbour, Mrs. Ho-Kym, chiropracts Elroy's back until he gives her some of the money and leaves.","154":"Jong-su asks to meet Ben in the countryside, claiming he is with Hae-mi. Ben sees that Hae-mi is not there and asks Jong-su where she is; Jong-su stabs him to death. He then douses Ben's car and body in gasoline and sets them on fire, tossing his blood-soaked clothes in as well. He stumbles naked to his truck and drives off.","155":"Julie writes a short story about feminism and oral sex, impressing Aksel, who encourages her to post it online. It gains attention. She celebrates her 30th birthday at her divorced mother's home, but her father fails to attend, citing back pain. Days later, Julie's half-sister inadvertently reveals that their father was actually watching her play at a football tournament on Julie's birthday. He makes excuses to decline Aksel's invitation to visit them in Oslo. While working at a bookstore, Julie encounters Eivind and his girlfriend Sunniva. During dinner with Aksel's brother and sister-in-law, Aksel complains about the sanitized cinematic adaptation of his politically incorrect comic series Bobcat (Gaupe in Norwegian), leaving Julie feeling bored and ignored. The next morning she daydreams about spending the day with Eivind, imagining falling in love. That same day she ends her relationship with Aksel.","156":"Julie, a medical student in Oslo, transitions from medicine to psychology and then photography. In her late 20s, she begins a relationship with Aksel Willman, a comic artist 15 years her senior. Now exploring writing, she spends a weekend with Aksel at his parents' house. Aksel suggests starting a family, but Julie is uncertain. While walking home from a publishing event for Aksel, Julie crashes a wedding reception and meets Eivind, a barista. Despite both being in relationships, they spend the night together sharing jokes and intimacies, but refrain from sexual relations. They exchange only their first names before parting ways.","157":"Jurassic Park's disgruntled lead computer programmer, Dennis Nedry, was previously bribed by Lewis Dodgson, a man working for Hammond's corporate rival, to steal frozen dinosaur embryos. He deactivates the park's security system to access the embryo storage room and stores them inside a container disguised as a Barbasol shaving cream can.","158":"Kate realizes mid-flight that Kevin was left behind, and upon arrival in Paris, Kate plans to return home immediately due to Kevin being home alone, but the family discovers that all flights for the next two days are booked, and that the phone lines are still down back home in Chicago. Peter and the rest of the family stay at his brother Rob's apartment in Paris while Kate stays at the airport in hopes of finding a seat on an outbound flight to Chicago more quickly. Kate is unsuccessful, but convinces a couple to trade tickets to Dallas, Texas with her. After then flying to Scranton, Pennsylvania, she meets Gus Polinski, the lead member of a traveling polka band, who offers to let her travel with them to Chicago in a moving van on the way to Milwaukee.","159":"Katherine's California boyfriend Paul unexpectedly visits and proposes, but Katherine declines and they break up. She begins dating Bill Dunbar, who often recounts stories about his war service in Italy. Bill has had affairs with students, including Giselle, so Katherine insists he stop. Upon learning Bill never served in Italy and was only stationed at the Army Languages Center on Long Island, Katherine ends the relationship.","160":"Kevin as Brittany and Marcus as Tiffany meet the sisters' three best friends – Lisa Anderson, Karen Googlestein, and Tori Wilson – and their rivals, Heather and Megan Vandergeld. Unbeknownst to Kevin and Marcus, they are being watched by Gordon, along with colleagues Vincent Gomez and Jake Harper, who are undercover posing as hotel staff. At the hotel, pro football player Latrell Spencer is attracted to Marcus\/Tiffany, and Kevin sets his sights on New York One News reporter Denise Porter.","161":"Kevin returns home and rigs the house with handmade booby traps. Harry and Marv break in, spring the traps, and suffer various injuries. Kevin calls the police and lures the duo into a neighboring house that they had previously broken into. Harry and Marv ambush Kevin and prepare to get their revenge, but Marley intervenes and knocks them out with his snow shovel. The police arrive and arrest Harry and Marv, having identified all the houses that they broke into due to Marv's habit of flooding them by leaving sinks running after plugging up the drains.","162":"Klein convinces Bobby to play anyway, seeing that he is eager to attend college. Bobby becomes a feared outside linebacker. In his first game, he costs the Mud Dogs a win to take down a player who trash-talked his mother. Afterwards, the Mud Dogs go on a subsequent winning streak. Bobby's newfound fame and confidence also allow him to reconnect with his felonious childhood love interest, Vicki Vallencourt. Helen forbids Bobby from seeing her, insisting that she is \"the devil\".","163":"Klein convinces the National Collegiate Athletic Association (NCAA) to let Bobby play if he can pass a General Educational Development (GED) exam. He apologizes to Bobby and admits to submitting the fake transcript because he was desperate to finally win something and get even with Beaulieu. Twenty years ago, Klein and Beaulieu were assistant coaches at the University of Louisiana and the predecessor was retiring. After Beaulieu intimidated Klein into turning over his playbook and took credit for the plays, he was promoted, and Klein was fired. Klein suffered a mental breakdown and could not come up with new plays. The story convinces Bobby to help Klein get revenge on Beaulieu and prove himself to everyone. Bobby finally stands up to Helen while studying for the GED, angrily revealing that he has been playing football, going to college, and seeing Vicki, and intends to continue doing so.","164":"Later that night, Roach drugs the Jokers' dog, Chico, with Cannabis to keep him distracted while Craig sneaks into the Jokers' house. Craig locates the pump finding cash is hidden inside and taking some for himself. He bumps into Karla, who talks about what happened to her mom and the Joker brothers. Craig escapes out of a window. Panicking after the eldest Joker closes the window (the way Craig got into the house), Day-Day and Roach knock on the Jokers' door as a diversion for Craig to escape. After discovering the money from the pump is missing, The Jokers take Day-Day and Roach hostage and tie them up with duct tape.","165":"Later, Negasonic and her girlfriend Yukio repair Cable's time-traveling device for Wade. He uses it to save the lives of Vanessa and X-Force member Peter, as well as to kill both an alternate version of himself confronting Wolverine, and Ryan Reynolds after he finishes reading the screenplay for Green Lantern.","166":"Lee Jong-su, an aspiring young novelist, performs odd jobs in Seoul. One day he runs into Shin Hae-mi, a childhood neighbor and classmate, at a promotion at which he is making a delivery. Jong-su initially does not remember her, but Hae-mi tells him she had plastic surgery. Jong-su gives her the pink watch that he won at the promotion. Later, she tells him about her upcoming trip to Africa and asks him to feed her cat, Boil, while she is away. Before Hae-mi's departure, Jong-su's father, a cattle farmer in Paju, becomes entangled in disagreeable legal affairs, and Jong-su has to return to the farm. Jong-su visits Hae-mi's apartment, where he receives instructions about feeding the cat. They then have sex.","167":"Lightning finishes repairing the road and decides to spend an extra day in Radiator Springs helping the local businesses, but Doc alerts the media to Lightning's location, leading them and Mack to descend on the town and force Lightning to leave in time for the race. Doc regrets his actions after seeing the residents disappointed by the departure. At the race, Lightning initially struggles, but is reinvigorated by the arrival of his friends from Radiator Springs, who act as his pit crew. With Doc taking over from Mack as crew chief, Lightning stages a remarkable comeback. However, Chick employs a PIT maneuver that intentionally damages the King, rendering him unable to continue. Fearing that the King's career may end as Doc's did, Lightning halts just before the finish line and pushes him across, allowing Chick to win the Piston Cup while ensuring the King's safe finish.","168":"Lightning repaves the road shoddily in a rush to leave, and Doc challenges him to a race for his freedom, on the condition that he starts over from scratch if he loses. The overconfident Lightning, having never raced on a dirt road before, spins out on a turn and crashes into a cactus patch, with Doc having set up the race to dampen his ego. Over time, Lightning warms up to and befriends the town's residents, especially Mater, a rusty tow truck, and Sally, who dreams of reviving Radiator Springs. As he bonds with the locals, Lightning helps rejuvenate Radiator Springs and develops a newfound appreciation for its charm. He discovers the town was once a bustling attraction for drivers on Route 66, before the construction of the interstate caused them to lose all their business traffic. Lightning also discovers that the bitter Doc, reticent about his past, used to race as the legendary Hudson Hornet until a disastrous crash ended his career. Lightning is dumbfounded that Doc considers his previous Piston Cups worthless junk.","169":"Linguist Louise Banks's daughter Hannah dies at the age of twelve from an incurable illness.","170":"Lockjaw is invited to join the Christmas Adventurers Club, a secret society of wealthy far-right white supremacists. He hunts for Willa to cover up his interracial relationship, which the club forbids. Lockjaw hires an indigenous bounty hunter, Avanti Q, who captures Bob's comrade Howard Sommerville, triggering a distress signal to the remaining French 75.","171":"Long ago, demons preyed on humans, feeding their souls to their ruler Gwi-Ma. Eventually, three women became demon hunters and used their singing voices to create a magical barrier against demons called the Honmoon. As time passed, new trios of hunters emerged to maintain the Honmoon, with the ultimate goal of strengthening it into the Golden Honmoon—a final seal that would banish demons permanently.","172":"Malcolm Adekanbi and his best friends, Jib Caldones and Diggy Andrews, are high school \"geeks\" living in \"The Bottoms\", a high-crime neighborhood in Inglewood, California. They idolize '90s hip hop music and fashion. Malcolm is confident he will be admitted to his dream school, Harvard University, but his school counselor is skeptical and suggests he take an interview with local businessman and Harvard alumnus, Austin Jacoby.","173":"Malcolm gets a modern haircut and waits for Nakia at prom, but she does not show. Later, Nakia meets Malcolm at his home and thanks him for helping her pass her GED, giving him a pass to Six Flags and they share a kiss. He returns to his room to find a letter from Harvard on his bed. He opens it and looks at the audience before smiling.","174":"Malcolm, Jib and Diggy flee to the address, chased by the unknown caller, and are greeted by Jaleel and his sister Lily. Since AJ, their father, isn't home, Jaleel invites them inside their mansion and takes Jib and Diggy out for food, while Lily seduces Malcolm, finds the drugs and takes a heavy dose. Intoxicated, Lily passes out while driving Malcolm to his interview before urinating on a bush while bystanders record, and Malcolm drives her car to the meeting himself.","175":"Malcolm, Jib and Diggy seek help from hacker Will Sherwood, who sets up an online black-market website to sell the drugs through Bitcoin transactions, which soon goes viral. The three friends enroll in a Google Science Fair project to access the school lab and computer room, where they can sell the drugs to the various buyers. Even though no one suspects them, they almost get caught one day during a routine police search. This episode frightens Jib who wants to leave, but eventually accepts to go on to finish the sales.","176":"Marlin and Coral, a clownfish couple who are waiting for their eggs to hatch, live on the edge of the Great Barrier Reef. After a barracuda knocks Marlin unconscious, Marlin awakens to find Coral and all but one of the eggs gone. Marlin names the surviving child Nemo and vows to keep him safe.","177":"Marlin and Dory awaken in the East Australian Current with a large group of sea turtles, including Crush and his son, Squirt. Crush teaches Marlin to relax and be less worried about Nemo. News of Marlin's journey spreads across the ocean and reaches Nigel, a pelican who regularly converses with the Tank Gang. Nigel informs Nemo of Marlin's efforts; inspired, Nemo successfully clogs the filter and the tank quickly becomes covered in green algae.","178":"Marlin races after the boat and meets Dory, a blue tang with short-term memory loss who offers to help him. The pair encounter Bruce, a Great White Shark who is part of a support group of sharks trying to abstain from eating fish. At the meeting, Marlin finds a diver's mask from the boat with an address written on it. When Marlin accidentally injures Dory, Bruce smells her blood and relapses into a rampage that sets off old naval mines. As they escape, Dory recalls that she can read the address.","179":"May and Kari learn through local police and medical records that Lita apparently died of heart failure on a lakeside in the country, and did not commit suicide there as they had been told. This news relieves them both due to their Christian views on suicide. Discord begins to erupt between May, Kari, and Olaug, which is exacerbated when Olaug suggests that she believes, based on the police reports and her own military expertise, that Lita was murdered. Feeling a deep disconnect toward the family, Olaug suggests that the three, along with Lita's daughter Trine, undergo a second DNA test. The results disprove the previous test, showing that Olaug is not a blood relative of May or Kari, and that the likelihood of her being Trine's biological aunt is 0.02%. The documentary's director, Maria, vocalizes her confusion and distrust of the three women's conflicting claims.","180":"May, a pious older woman from northern Norway, is visiting her sister Kari in Gullspång, Sweden. May is injured on an amusement park ride, and chooses to take an extended stay in Gullspång to convalesce. May decides to rent an apartment and begins touring available units. In one, she observes three paintings of fruit hanging in the kitchen, a decorative feature she had envisioned herself. May interprets this as a divine sign and chooses to rent the apartment. May and Kari are shocked when they meet the realtor, Olaug, who bears a striking resemblance to their elder sister Astrid \"Lita\", who committed suicide in 1988 after being involved in an embezzlement scheme. May and Kari are further surprised when they learn that Olaug shares the same birthday as Lita – 9 February 1941 – and also went by the same nickname in her youth.","181":"Meanwhile, Nemo is placed in a fish tank in dentist Philip Sherman's office in Sydney. He meets the \"Tank Gang\", led by Gill, a scarred Moorish idol. They inform him that Sherman plans to gift Nemo to his niece, Darla, who has an infamous history of killing her pet fish. To prevent this, Gill hatches an escape plan: Nemo, the smallest of the gang, will clog the tank's filter, forcing Sherman to clean it and bag the fish. Then, they can roll their bags out the window and into the harbour. Nemo attempts the plan but is nearly killed by the filter's machinery in the process, causing Gill to feel deeply regretful.","182":"Meanwhile, Stoick rallies his fleet to destroy the dragons' nest. Before leaving, Stoick heeds the advice of his best friend and Hiccup's mentor, local blacksmith Gobber the Belch, and enrolls Hiccup in a dragon-fighting class with other local teens: Fishlegs Ingerman, Snotlout Jorgenson, the Thorston twins Ruffnut and Tuffnut, and Hiccup's crush, Astrid Hofferson. Hiccup is mocked by his peers and struggles in class. Returning to the forest, he finds the Night Fury trapped in a cove, unable to fly because Hiccup's bolas severed half of his tail fin. Hiccup befriends the dragon, naming him \"Toothless\" for his retractable teeth; he builds a harness, saddle, and prosthetic fin, allowing Toothless to fly with Hiccup riding on his back to guide him. Hiccup also learns about dragon behavior from Toothless, which allows him to subdue the captive training dragons, impressing the villagers, but arousing Astrid's suspicions.","183":"Meanwhile, Stoick's fleet is damaged while searching for the nest, and returns to Berk. Upon learning he must kill a dragon for his final exam, Hiccup attempts to flee with Toothless, but Astrid discovers them. Hiccup takes her on a flight to show her Toothless' friendliness. During the flight, Toothless is drawn to a dragon's nest, where a gigantic evil dragon, the Red Death, commands smaller dragons to feed it to avoid being eaten themselves. Realizing the dragons attack Berk for survival, Astrid wants to inform the villagers, but Hiccup advises against it to protect Toothless. In his final exam, Hiccup faces a captive Monstrous Nightmare dragon. Rather than killing it, he attempts to publicly prove dragons can be peaceful, but Stoick inadvertently enrages the Monstrous Nightmare, causing Toothless to emerge from hiding to protect Hiccup. Stoick captures Toothless and disowns Hiccup after discovering the truth. Stoick's fleet uses Toothless to guide him to the nest despite Hiccup's warnings. After reminding a distraught Hiccup he spared Toothless out of sympathy, not cowardice, Astrid has Hiccup rally the other teens to tame the training dragons. Together, they pursue Stoick's fleet to the nest.","184":"Meanwhile, police stop Ray's train in the Belgian countryside; they detain Ray for attacking the Canadians and escort him back to Bruges. Chloë bails him out and the two share a drink on the market square beneath the Belfry of Bruges. Meanwhile, Harry spots Ken at a café. As the two have drinks, Harry boasts that if he himself had killed a child, he would have immediately taken his own life. Ken argues that Ray is trying to better himself and deserves a chance at redemption, but Harry is not convinced. Ken suggests they ascend the bell tower for a shootout away from bystanders. At the top, Ken says he accepts whatever punishment Harry intends. A conflicted Harry cannot bring himself to kill Ken, so he shoots him in the leg as punishment for not killing Ray.","185":"Meanwhile, the relationship between Sarah and Aldous is showing signs of trouble. This is exacerbated by the news that Sarah's latest TV show has been canceled and that Aldous is about to embark on an 18-month world tour with his band, Infant Sorrow. At the same time, Peter's room is needed by new occupants, so he is placed in the suite next to Sarah's.","186":"Mendez is told the operation has been canceled in favor of a planned military rescue of the hostages. He pushes ahead anyway, forcing his boss, Deputy Director Jack O'Donnell, to hastily re-obtain authorization for the mission and rebook their canceled tickets on a Swissair flight. Tensions rise at the airport, where the escapees' new ticket reservations are belatedly confirmed, and the head guard's call to the fake Hollywood production company is answered only at the last second. The escapees board the plane as airport authorities are alerted to the ruse, but fail to stop the plane from taking off.","187":"Nedry's sabotage cuts power to the tour vehicles, stranding them as they near the park's Tyrannosaurus rex paddock. Most of the park's electric fences have also been deactivated, allowing the Tyrannosaurus to escape and attack the group. After the Tyrannosaurus overturns a tour vehicle, it injures Malcolm and devours Gennaro while Grant, Lex, and Tim escape. On his way to deliver the embryos to the island's docks, Nedry gets lost in the rain, crashes his Jeep Wrangler, and is killed by a venom-spitting Dilophosaurus. Sattler helps the game warden Robert Muldoon search for survivors; they find Malcolm just before the Tyrannosaurus returns and chases them away. Grant, Tim, and Lex take shelter in a treetop and encounter a Brachiosaurus herd. They discover the broken shells of dinosaur eggs the following morning. Grant concludes that the dinosaurs are breeding, which is possible because of amphibian DNA—animals like West African frogs can change their sex in a single-sex environment, enabling the dinosaurs to breed. The three later encounter a Gallimimus stampede being hunted by the Tyrannosaurus.","188":"On Christmas Eve, Harry and Marv finally realize that only Kevin is in the McCallister home, and Kevin overhears them discussing plans to break into the house that night. He starts to miss his family and asks the local Santa Claus impersonator if he could bring them back for Christmas. Kevin attends a church choir performance, eventually re-encountering Marley, who proves the rumors about himself to be false. Marley points out his granddaughter in the choir and mentions he has never met her since she is the daughter of his estranged son. Kevin suggests he try to reconcile with his son.","189":"On November 4, 1979, Iranian Islamists storm the United States Embassy in Tehran in retaliation for the right of asylum granted by President Jimmy Carter to Shah Mohammad Reza Pahlavi, whose Western-supported monarchy was overthrown by the Iranian Revolution. Sixty-six embassy staff are taken hostage, but six avoid capture and are secretly sheltered in the home of Canadian ambassador Ken Taylor.","190":"On a day out hiking with Peter, Rachel dares him to jump off a cliff into the ocean. He starts the jump but is caught by some vines, so is left dangling off the edge. With some prodding from Rachel, he lets go and safely lands in the water, after which she kisses him.","191":"On his free day, Hirayama does his laundry, takes the film with his tree photos to be developed, cleans his flat, buys a new book, and dines at a restaurant where the proprietor shares gossip with him. Niko, Hirayama's niece, shows up unannounced, having run away from his wealthy estranged sister Keiko's home. Hirayama lets Niko accompany him to work during the next two days. They photograph the trees in the park and ride bikes together. Eventually, Keiko comes to pick up Niko in a chauffeured car. Keiko tells him that their father’s dementia has worsened and asks whether Hirayama will visit him in the nursing home where he lives. She says that he does not recognise anything anymore and will not behave the way he did before. Hirayama sorrowfully refuses but hugs his sister goodbye. Before she leaves, she asks him whether he really cleans toilets for a living, and he says yes. As they drive away, Hirayama begins to cry inconsolably.","192":"On the advice of John Chambers, a Hollywood make-up artist who had previously worked for the CIA, Mendez works with film producer Lester Siegel to create a phony film production company. They successfully establish the pretense of developing Argo, a \"science fantasy adventure\" in the style of Star Wars, to lend the cover story credibility. The revolutionaries reassemble embassy photographs shredded before the takeover and realize some personnel are unaccounted for. Posing as a producer for Argo, Mendez enters Iran under the alias Kevin Harkins and meets with the six escapees, who are growing restless. He provides them Canadian passports and fake identities. They reluctantly go along, knowing that Mendez is also risking his own life. A scouting visit to the bazaar to maintain their cover story takes a bad turn when a hostile shopkeeper harasses them, but their Iranian culture contact hustles them away from the hostile crowd.","193":"On the last day of British rule of Hong Kong on June 30, 1997, Detective Inspector Lee of the Royal Hong Kong Police Force leads a raid at the wharf, hoping to arrest the unidentified, anonymous crime lord Juntao. He finds only Sang, Juntao's right-hand man, who escapes in a boat. Lee recovers numerous Chinese cultural treasures stolen by Juntao, which he presents as a farewell victory gift to his departing superiors, Chinese consul Solon Han and British police commander Thomas Griffin.","194":"On their way to the ISS, the two discuss Stone's home life and her daughter, who died young in an accident. As they approach the station, they see that the ISS's crew has evacuated using one of its two Soyuz spacecraft, with the remaining craft exhibiting damage and unable to return to Earth. Kowalski suggests using it to travel to the nearby Chinese Tiangong space station,[N 1] 100 km (60 mi) away, to board its similar Shenzhou spacecraft and return to Earth.","195":"Orphaned as a baby, Harry Potter is entrusted to his only living relatives, the Dursley family, by Professor Albus Dumbledore, Professor Minerva McGonagall, and gamekeeper Rubeus Hagrid from Hogwarts School of Witchcraft and Wizardry. The Dursleys keep Harry unaware of magic until his eleventh birthday approaches, when their home is flooded with letters addressed to Harry, informing him he has been accepted to study magic at Hogwarts. When the Dursleys intercept the letters, Hagrid is sent to confirm that Harry is a wizard. Harry subsequently purchases school supplies with Hagrid at Diagon Alley, where he learns he is celebrated for surviving the dark wizard Lord Voldemort, who seemingly perished after murdering Harry's parents and left him with only a scar.","196":"Outspoken conservative Betty Warren writes editorials for the college paper, and insists that a universal standard exists for what is good art. She attacks Katherine for advocating that women seek careers in addition to marriage and exposes campus nurse and lesbian Amanda Armstrong for supplying contraception to students, resulting in her termination.","197":"Peter immediately goes to Rachel to confess what happened, but she is hurt and demands that he leave and never contact her again. Before leaving, he goes to the bar they visited and removes a topless photo of her that was hung in the restroom's collage without her consent. Peter returns the photo to Rachel, bruised from a beating by the bar owner.","198":"Peter's heartbreak is aggravated by awkward run-ins with Sarah and Aldous, as well as seeing all the vacationing couples at the resort. Things improve when he begins spending time with Rachel and developing feelings for her.","199":"Plot","200":"Police detective Ray Duquette suspects the trio of working a scam. Against the wishes of the district attorney's office, he continues investigating Sam. He tells Kelly and Suzie that Sam has already transferred the money to an off-shore account. Suzie panics and goes to Kelly, who comforts her. Kelly, however, calls Sam and tells him they may have to get rid of Suzie. In the pool, Suzie attacks Kelly. They fight but eventually end up kissing while unaware Ray is watching them. A few nights later, at the beach, Sam bludgeons Suzie to death while Kelly waits nearby. The two then drive to the swamp, where Sam disposes of the plastic-wrapped body.","201":"Potti compliments Thevan on the song and insists that he stay in the mana for the rest of his life, despite his desire to leave. The cook, while showing Thevan his room, discourages him from asking questions about the house or investigating any areas that are off-limits. Over the next few days, he discovers from the cook that the Potti is a descendant of the sorcerer Chudalan Potti, who was gifted a mystical goblin helper, a chathan, by the goddess Varahi. His constant torture of the chathan turned it vengeful, and it went on to kill Chudalan Potti and his family. Kodumon Potti, a strong sorcerer in his own right eventually defeated the Chathan and chained him in the mansion's attic. He also realises that the cook is not on good terms with Kodumon Potti, and that the latter is not a devotee of God. Thevan befriends the cook, who soon appears to confide in him and warns him not to trust Kodumon. It is also revealed that there was a singer staying in the mansion before Thevan arrived, who was killed and buried in the backyard as he went insane.","202":"Princess Rosalinda María Montoya Fioré is about to be crowned queen of the small nation of Costa Luna. However, her coronation rehearsal is interrupted by General Magnus Kane, the dictator of neighboring country Costa Estrella, who invades her palace with his agents and attempts to capture the royal family and take over the country. Major Joe Mason, an agent of the Princess Protection Program (P.P.P.), a secret organization funded by royal families that looks after endangered princesses, whisks her away to safety via helicopter. Kane's agents, however, succeed in capturing her widowed mother, Queen Sofía.","203":"Raj and Simran first meet on a train departing London. Immediately, they clash — Raj is cheeky and flirtatious, while Simran is reserved and wary of his antics. They keep running into each other, however, and are forced into an uneasy alliance when they miss their train in Zurich. They journey together to catch up with their group, and start bonding. Their initial dislike turns into quiet understanding. One night, the two get drunk after being caught outdoors in a winter storm. Simran wakes up in a panic the next morning, unsure of what transpired with Raj, but he reassures her that nothing happened between them.","204":"Ray and his partner, Detective Gloria Perez, investigate Suzie's disappearance. Her blood and teeth are found at the beach, while her car is located abandoned at a bus terminal. The D.A.'s office again insists that Ray drop the case, but he asks Gloria to watch Sam. Sam shows Gloria his files from the school on Kelly, which suggests she is troubled and violent. Meanwhile, Ray goes to the Van Ryans' guest house to confront the scared and upset Kelly, but they end up shooting each other. Sandra rushes over as Ray stumbles out of the house; he has sustained a gunshot wound to the shoulder, while Sandra discovers Kelly dead from two shots to the chest. Ray claims he was forced to shoot Kelly in self-defense. No charges are filed against him, but he is dismissed from the force for disobeying orders.","205":"Realizing he cannot die and will spend eternity alone, the Creature confronts Victor on the night of William and Elizabeth's wedding, demanding he create a companion. Victor refuses, professing his disgust and regret toward creating the Creature. The Creature attacks Victor, but is found and embraced by Elizabeth. Victor attempts to shoot The Creature, but Elizabeth gets shot instead. William is also mortally wounded as the Creature fights off the guests. A dying William confesses that he had always feared Victor and calls him the 'monster'. The Creature takes Elizabeth to a cave and comforts her as she dies. The Creature vows from that day forward to be the master of his creator, and disfigures Victor; forcing him to hunt him until he finds a way to undo his immortality. Victor hunts the Creature to the Northern Arctic, where he fails to kill him with dynamite and is there discovered by Anderson's crew.","206":"Returning to Pride Rock, Simba challenges Scar, who eventually admits to killing Mufasa. The lionesses fight Scar’s hyenas while Simba battles Scar, ultimately defeating him. Simba reclaims the throne and restores balance to the Pride Lands with Nala by his side.","207":"Rogers awakens in a 1940s-style hospital room. Hearing a radio broadcast of a baseball game that he attended in 1941, Rogers grows suspicious and escapes from the room. He finds himself in contemporary Times Square, where S.H.I.E.L.D. director Nick Fury informs him that he has been asleep for almost 70 years. In a post-credits scene, Fury approaches Rogers and proposes a mission with worldwide ramifications.","208":"Samantha convinces Theodore to go on a blind date with a woman with whom a friend has been trying to set him up. The date goes well, but when Theodore hesitates to promise to see her again, she insults him and leaves. While discussing relationships with Samantha, Theodore explains that he briefly dated his neighbor Amy in college, but they are now just friends and Amy is married to their mutual friend Charles. After a verbal sexual encounter, Theodore and Samantha develop a relationship that reflects positively in Theodore's writing and well-being, and in Samantha's enthusiasm to grow and learn. Amy later reveals that she is divorcing Charles after a trivial fight. She admits to Theodore that she has befriended a feminine OS that Charles left behind, and Theodore also confesses that he is dating his OS.","209":"Schmidt and Dr. Arnim Zola harness the energies of the Tesseract to fuel Zola's inventions and Hydra's planned worldwide offensive. Schmidt discovers Erskine's location and sends an assassin, Heinz Kruger, to kill him. Erskine and Stark put Rogers through the super-soldier treatment, injecting him with the formula and dosing him with \"vita-rays\". After Rogers emerges from the experiment taller and more muscular, Kruger kills Erskine and flees with the last vial of the formula. Rogers pursues and captures Kruger, but the assassin avoids interrogation by killing himself with a cyanide capsule. The vial is destroyed during the chase. With Erskine dead and his formula lost, U.S. Senator Brandt has Rogers tour the nation as \"Captain America\" to promote war bonds while scientists study his blood and attempt to reverse-engineer the formula. In 1943, while on tour in Italy performing for active servicemen, Rogers learns that Barnes's unit is MIA following a battle against Schmidt's forces. Rogers has Carter and Stark fly him behind enemy lines to mount a rescue. Rogers infiltrates Schmidt's fortress, frees Barnes and the other prisoners, and confronts Schmidt. The latter escapes, but first he removes a mask to reveal his red, skull-like visage that has earned him the sobriquet \"Red Skull\".","210":"Seb arrives at Mia's workplace, and she shows him around the Warner Bros. backlot, where she works as a barista, while expressing her passion for acting. He takes her to a jazz club, describing his passion for jazz and his desire to open his own club. Seb invites Mia to a screening of Rebel Without a Cause and she accepts, forgetting a date with her boyfriend. Bored with the latter date, she rushes to the theater and finds Seb as the film begins. When the screening is interrupted by a projector malfunction, Seb and Mia spend the rest of the evening together with a romantic visit to the Griffith Observatory.","211":"Seventeen years later, Peiqiang is about to return to Earth after the Chinese New Year. Qi, now an adult, obtains fake IDs and stolen thermal suits from criminal gangs and uses his grandfather's clearance pass to bring his foster sister, Han Duoduo, to tour the surface. Both are arrested at a checkpoint and meet another prisoner, Tim. Zi'ang is also arrested as he attempts to bribe for his grandchildren's release. As Earth approaches its gravity assist around Jupiter, a gravitation spike from Jupiter causes devastating earthquakes that disable many Earth Engines and sets the planet on a collision course with Jupiter.","212":"Several months later, Christian and his friends Mark and Josh have been invited by their Swedish friend Pelle to attend a nine-day midsummer festival at his ancestral commune, the Hårga, in the rural Hälsingland region of Sweden. The festival occurs only once every 90 years. Josh, writing his thesis on European midsummer festivities, regards it as a once-in-a-lifetime opportunity. Christian had intended to break up with Dani, who is still grieving the death of her family, but reluctantly invites her after an argument.","213":"Shinobu Kocho encounters Upper Rank Two Doma, recognizing him as her sister Kanae's killer. Despite her use of poisons, Doma develops immunity to her attacks, ultimately killing and consuming her. Shinobu's adoptive younger sister Kanao Tsuyuri arrives too late to save her and takes her place in the battle against Doma, while the Kasugai crows announce Shinobu's death to the rest of the Demon Slayers.","214":"Simba collapses in a desert, where he is rescued by Timon and Pumbaa, a meerkat and warthog who befriend him. Years pass, and Simba grows into an adult. When his childhood friend Nala encounters him, she urges him to return home, revealing that Scar's tyrannical rule has devastated the Pride Lands. With Rafiki’s guidance, Simba decides to confront Scar.","215":"Simran lives a quiet life with her traditional family in the suburbs of London. Despite her outward demeanour, she is a dreamer — a girl who longs for grand romance and a life shaped by her own choices. Her father, Baldev, is a rigid patriarch, who discourages anything beyond the bounds of duty and discipline. Since childhood, Simran has been betrothed to Kuljeet, the brash son of Baldev’s friend, Ajit, who lives in Punjab.","216":"Six months later,[b] Tony wants to continue the legacy of his father Howard, and re-institutes the Stark Expo in New York City's Flushing Meadows–Corona Park. He also resists pressure to turn over his armored suits to the government and Stark's rival, Justin Hammer. However, Stark learns that the palladium core in the arc reactor that keeps him alive and powers the armor is slowly poisoning him, and he is unable to find a substitute. Growing increasingly despondent about his impending death, and refusing to tell anyone about his condition, Stark appoints his assistant Pepper Potts as CEO of Stark Industries and hires Stark employee Natalie Rushman to replace her as his assistant.","217":"Six years later, an eruption in the ground of Edmond's cell reveals another prisoner, Abbé Faria, who has been imprisoned for eleven years after refusing to tell Bonaparte the whereabouts of the Spada family's treasure. Faria has been digging an escape tunnel, but he dug in the wrong direction and ended up in Edmond's cell. In exchange for Edmond's help digging a new tunnel, Faria educates him in several academic and martial disciplines. Faria is fatally injured in a tunnel cave-in. Before dying, he gives Edmond a map to the treasure and implores him to use it only for good. Edmond escapes the prison by taking Faria's place in the disposal of his corpse and is thrown into the sea, pulling warden Armand Dorleac along with him and drowning him.","218":"Stark competes in the Monaco Historic Grand Prix, where he is attacked in the middle of the race by Vanko, who wields electrified whips powered by his arc reactor. Stark dons his armor and defeats Vanko, but the armor is severely damaged. Vanko explains that he intended to prove to the world that Iron Man is not invincible. Impressed by Vanko's performance, Hammer fakes Vanko's death while breaking him out of prison and asks him to build a line of armored suits to upstage Stark. Vanko decides that unmanned drones are better to eliminate the human factor.","219":"Suzie was the ultimate mastermind of the plot: Upon finding that Sam and Kelly were in a sexual relationship, Suzie blackmailed Sam with photographs of the two using drugs during sex, convincing him to help with her scheme. Suzie subsequently orchestrated the meeting between Sam and Ray at a local bar. During her staged murder on the beach, Suzie pulled out her own teeth with pliers to make her death appear legitimate. Ray shot Kelly first before shooting himself in the shoulder to pretend he killed her in self-defense. Finally, with Kelly, Ray, and Sam all dead, Suzie is met by Kenneth, who gives her a briefcase full of cash that he describes as \"just walking around money\" and a check for millions of dollars. As she leaves, he tells her to \"be good\" before taking her drink.","220":"Tanjiro Kamado and Giyu Tomioka fight Upper Rank Three Akaza. Though Giyu unlocks his mark to enhance his power, Akaza continues to overwhelm them. Determining that the demon is able to target people based on their willpower, Tanjiro recalls memories of Inosuke's ability to detect attacks and observing his late father in combat. He enters the Transparent World and Selfless State, giving him heightened perception and masking his emotions, successfully beheading Akaza. However, Akaza's body continues to resist and fight Tanjiro and Giyu while headless, pushing them to the brink.","221":"Ten years later, during Ames' execution via lethal injection, he surprisingly dies in agonizing pain. The police find the chemicals had been tampered with and evidence left behind implicates Darby. An anonymous caller warns him law enforcement is on their way to arrest him. Following the caller's instructions, Darby ditches his gun and hijacks a police car, forcing a lone officer to drive to a deserted warehouse. The officer is revealed to be Clyde, also the caller. Darby attempts to shoot Clyde, but instead, the gun paralyzes Darby with tetrodotoxin-coated spikes. Clyde then straps Darby to a table, makes medical preparations to prolong Darby's suffering, then records himself (disguised) slowly dismembering and eventually killing Darby. When Darby's remains are found on property he owns, Clyde allows himself to be arrested and goes to prison.","222":"That night, Marty meets his eccentric scientist friend, Emmett \"Doc\" Brown, in the Twin Pines mall parking lot. Doc unveils a time machine built from a modified DeLorean, powered by plutonium he swindled from Libyan terrorists. After Doc inputs a destination time of November 5, 1955 (the day he conceived his time travel invention), the terrorists arrive unexpectedly and gun him down. Marty flees in the DeLorean, inadvertently activating time travel when reaching 88 miles per hour (142 kilometers per hour).","223":"The Christmas Adventurers uncover evidence of Lockjaw's relationship with Perfidia, including claims that he fathered a child with her, and send member Tim Smith to eliminate him and Willa. Lockjaw tracks Willa down to the convent, where Deandra is arrested. While holding Willa hostage, he forcibly tests her DNA, confirming she is his biological daughter and thus disqualifying him from the Christmas Adventurers Club.","224":"The FBI traces the call to a warehouse, where a team of agents are killed by plastic explosive. Spotting Sang nearby, Lee and Carter give chase but he escapes, dropping the detonator. Carter's colleague and past romantic partner, LAPD bomb expert Tania Johnson, traces it to Clive Cobb, the man arrested by Carter in the earlier botched sting operation. Lee presses Clive into revealing his business relationship with Juntao, whom he met at the Foo Chow restaurant in Chinatown. Clive is initially unwilling to speak to the duo but Lee shows him a picture of Soo Yung, causing him to relent. Lee then begins to earn Carter's trust. Carter goes to the restaurant alone and sees a surveillance video of Juntao, who is actually Griffin, present as Soo Yung is carried into a van. Lee arrives and saves Carter from Juntao's syndicate, but they are taken off the case as the FBI blames them for the botched ransom drop, with Lee sent back to Hong Kong. However, Carter refuses to give up and appeals to Johnson for assistance to sneak on board Lee's plane, where he persuades the Hong Kong detective to help stop Juntao together.","225":"The FedEx cargo plane Chuck boards crashes into the Pacific Ocean during a violent storm, leaving him as the only survivor. Washing ashore on a deserted island, Chuck explores the area, discovering several FedEx packages washing up on the coast, as well as the body of one of the pilots, Albert Miller, which he buries. In the following days, Chuck struggles to locate food and water. After seeing a ship on the horizon, he unsuccessfully tries to escape the island on a life raft, but is prevented by the tide and injures his leg. Realizing it is unlikely he will be rescued, Chuck opens most of the packages, finding items he uses to improve his living conditions. However, he does not open a package with golden angel wings painted on it, thinking the wings have symbolic meaning. While attempting to start a fire, Chuck cuts his hand and furiously throws several objects including a Wilson volleyball, leaving a bloodstained hand print. He draws a face into the blood, names the ball Wilson and begins talking to it. Chuck realizes the chances of his rescue are low because of the wide search area. Due to severe pain from his infected tooth, he performs his own tooth extraction using a rock and an ice skate. The extraction is successful, but he passes out from the pain.","226":"The McCallister family prepares to spend Christmas in Paris, gathering at Kate and Peter's home in Winnetka, a Chicago suburb, on the night before their departure. Kate and Peter's youngest son Kevin is ridiculed by his siblings and cousins due to his immaturity. Kevin inadvertently ruins the family dinner after a scuffle with his oldest brother Buzz, resulting in Kate sending him up to the attic. Frustrated with Kate for allowing the rest of the family to pick on him, Kevin wishes that his family would disappear. During the night, heavy winds damage electricity and phone lines to the house, disabling the alarm clocks and causing the family to oversleep. In the confusion and rush to get to O'Hare Airport, Kevin is accidentally left behind.","227":"The Space Shuttle Explorer, commanded by veteran astronaut Matt Kowalski, is in Earth orbit to service the Hubble Space Telescope. Dr. Ryan Stone is aboard on her first space mission, to perform hardware upgrades on the telescope.","228":"The U.S. State Department explores options for exfiltrating them from Iran and consults Tony Mendez, a U.S. Central Intelligence Agency exfiltration specialist. He criticizes their proposals but offers no alternative until inspired by watching Battle for the Planet of the Apes. The cover story he crafts for the escapees requires them to pose as Canadian filmmakers scouting exotic locations for a science-fiction film in Iran.","229":"The droids are captured by Jawa traders, who sell them to the moisture farmers Owen and Beru Lars and their nephew, Luke Skywalker. While Luke is cleaning R2-D2, he discovers a recording of Leia requesting help from a former ally named Obi-Wan Kenobi. R2-D2 goes missing, and while searching for him, Luke is attacked by Sand People. He is rescued by the elderly hermit Ben Kenobi, who soon reveals himself as Obi-Wan. He tells Luke about his past as one of the Jedi Knights, peacekeepers of the former Galactic Republic, who drew mystical abilities from the Force and were all but exterminated when the Empire replaced the Republic. Luke learns that his father, also a Jedi, fought alongside Obi-Wan during the Clone Wars until Vader, Obi-Wan's former pupil, turned to the dark side of the Force and murdered him. Obi-Wan gives Luke his father's lightsaber, the signature weapon of the Jedi. R2-D2 plays Leia's full message, in which she begs Obi-Wan to take the Death Star plans to Alderaan and give them to her father, a fellow veteran, for analysis. Luke initially declines Obi-Wan's offer to accompany him to Alderaan and learn the ways of the Force. However, he quickly changes his mind after Imperial stormtroopers murder his family and destroy his home while searching for the droids. Seeking a way off the planet, Luke and Obi-Wan travel with the droids to the city of Mos Eisley and hire the smuggler Han Solo and his Wookiee partner Chewbacca, pilots of the starship Millennium Falcon.","230":"The duo is reassigned to a revived scheme from the 1980s, which specializes in infiltrating high schools. Captain Dickson assigns them to contain the spread of a synthetic drug called HFS (\"Holy Fucking Shit\") at Sagan High School. He gives them new identities and enrolls them as students, giving them class schedules fitting their previous academic performances; Jenko taking mostly arts and humanities, and Schmidt taking mostly science classes, but the duo mix up their identities. Schmidt gets a lead on HFS from classmate Molly, and he and Jenko meet the school's main dealer, popular student Eric. The two take HFS in front of him to maintain their cover, and then rush to the bathroom and attempt to vomit the HFS out of their systems, but are unsuccessful.","231":"The film concludes with May finally deciding to vacate the apartment she leased in Gullspång. She and Kari ponder the paintings of the fruit in the kitchen before removing them both.","232":"The following day, Dani and Christian are pressured into drinking a hallucinogenic tea. Dani wins a maypole dancing competition, inspired by the myth of Hårgalåten, and is crowned May Queen. Pelle kisses Dani. Christian drinks the hallucinogenic tea and is coerced into a sex ritual to impregnate Maja, a 15-year-old member of the Hårga, while older nude female members watch and mimic Maja's moans. Dani witnesses the ritual and has a panic attack. She is surrounded by the commune's women, who mimic her cries of despair. After the ritual, a naked Christian attempts to flee. He discovers Josh's severed leg planted in a flowerbed. Pelle blows a powder in Christian's face, paralyzing him.","233":"The four escape in the collapse and attempt to make their way to another underground city, but their truck is requisitioned for an emergency mission led by Captain Wang Lei to transport a Lighter Core to restart an Earth Engine in Hangzhou. In the frozen ruins of Shanghai, they lose their vehicle while transporting the component up the ruins of the Shanghai Tower, where Han Zi'ang freezes to death. After confronting the other rescue team members, Qi, Tim and Han Duoduo abandon the mission. The trio come upon a crashed cargo plane with an intact vehicle, where the surviving engineer aboard, Li Yiyi, eventually convinces them to transport another Lighter Core to repair the Earth Engine in Sulawesi, reconciling with the other members on the way.","234":"The motorcycle gang arrives for the deal, but Molly, high on the HFS, interrupts them and starts arguing with Schmidt. As a result, gang leader Domingo recognizes Schmidt and Jenko and orders his men to kill them. Two of the gang members then reveal themselves to be undercover DEA agents Tom Hanson and Doug Penhall, former members of the 21 Jump Street program. Domingo orders his men to shoot Hanson and Penhall; in the ensuing exchange of gunfire, Hanson and Penhall are both mortally wounded. Mr. Walters and Eric escape with the money and Molly as a hostage; the gang, Schmidt, and Jenko follow close behind. Jenko creates a homemade bomb and uses it to kill the gang. Mr. Walters shoots at Schmidt but Jenko takes the bullet to his arm, sparing Schmidt's life. In response, Schmidt shoots Mr. Walters, unintentionally severing his penis. They arrest Mr. Walters and Eric, successfully reading the former his Miranda rights. Schmidt and Molly share a kiss while Eric and Mr. Walters get arrested.","235":"The narrator discovers Project Mayhem's ultimate objective: to erase all debt records by blowing up the skyscrapers of consumer credit companies. He warns Marla to stay away from him and goes to the police to confess, but finds many of the police are themselves Project Mayhem members, who attempt to castrate him on Tyler's orders. The narrator escapes and disarms one of the bombs, prompting Tyler to attack him. Accepting that he is Tyler, the narrator shoots himself in the mouth, \"killing\" Tyler, while the bullet passes through the narrator's cheek. Marla and the narrator hold hands and watch the skyline as the targeted buildings collapse","236":"The narrator quits his job and blackmails his boss for funds. He grows Fight Club, attracting new members, including his cancer support group friend, Bob. Tyler transforms the club into Project Mayhem, committing acts of vandalism to disrupt the social order.","237":"The next day, following a disastrous lunch service, Ignacio has enough and decides to disregard the monastery's rules and become a luchador to make money. He finds the man that robbed him, an atheist named Steven, and convinces him to join him by promising to share the prize money if they win, so the two join the advertised local competition as tag partners. Ignacio fights with the moniker \"Nacho\" to keep his identity secret, while Steven adopts the name \"Esqueleto\" (skeleton).","238":"The next morning, a disillusioned Ignacio expresses his resentment towards Ramses for treating him terribly and decides not to continue wrestling, which starts a heated argument between him and Steven, who wants him to continue. Later, Ignacio's secret is revealed to the entire monastery when his robe catches fire during Mass, exposing his wrestling costume and forcing him to confess to everyone. He declares that he intends to fight at the battle royale for the right to take on Ramses for a cash prize he hopes to use to buy a bus for the orphanage, but he comes in second place, losing unfairly to another wrestler named Silencio after he was tripped by an out competitor. Banished from the monastery, Ignacio goes to live in exile, where only a day later he and Steven reconcile. It turns out Silencio has withdrawn on account of Steven injuring him, giving the runner-up Ignacio the right to fight Ramses instead. After praying with Steven, Ignacio overcomes difficulty and manages to do well in the match, winning the crowd's support, but Ramses, enraged, resorts to cheating by attacking Ignacio during the match's break and unmasking him, revealing his face and identity to the crowd, before pinning him to the ground. Ramses nearly wins the match until Ignacio sees Encarnación and the orphans enter the arena. Inspired by their support, Ignacio rallies himself and defeats Ramses.","239":"The party guests appear to hold some sort of silent auction with a photo of Chris as the prize. Chris sends a photo of Logan to his friend, TSA officer Rod Williams, who recognizes Logan as Andre Hayworth, a missing man from Brooklyn. Chris discovers photos of Rose dating numerous black people, including Walter and Georgina, contradicting her earlier claim that Chris is the first black person she has dated. He tries to leave, but Rose refuses to give him the car keys. Jeremy and Dean block the doors and Missy hypnotizes Chris back to the sunken place.","240":"The revelation of the second DNA test upsets May and Kari, who have come to agree that Lita may have actually been a murder victim based on conflicting eyewitness reports, an ominous conversation she had with Kari shortly before her death, and the fact that Lita had taken out three life insurance policies shortly before she died—one of which was issued through the employer of her partner Steiner, from whom she had recently separated. Trine continues to believe that Olaug is in fact her aunt, while May and Kari suspect that Olaug tampered with her blood test in order to cut ties with the family.","241":"The trio sneaks into the Jokers' backyard. Joker sends Baby Joker and Lil' Joker to get a chainsaw from the toolshed. Willie knocks Baby Joker with a 2x4 and Elroy tackles Lil' Joker. Willie ties the younger Jokers up and puts them in the shed.","242":"The twins recruit pianist Delta Slim as a performer, local Chinese shopkeeper couple Grace and Bo Chow as suppliers, field worker Cornbread as a bouncer, and Smoke's wife Annie as a cook. Annie believes her Hoodoo practices kept the twins safe, but Smoke doubts them for not preventing their infant daughter's death. Stack runs into his white-passing ex-girlfriend Mary, who resents him for abandoning her out of protection. Elsewhere, Irish-immigrant vampire Remmick shelters from Choctaw vampire hunters with a married Klansmen couple, whom he turns into vampires.","243":"Their persistence causes Akaza to remember his tragic past; he was a young criminal named Hakuji, who stole to fund his father's medication. After being caught stealing numerous times, his father committed suicide to unburden him, leading to a chance encounter with a dojo owner, Keizo. Hakuji served as his sole disciple while caring for his sick daughter, Koyuki. Hakuji and Koyuki eventually became engaged, but she and her father were poisoned by a resentful neighboring dojo that wanted his land while he visited his father's grave. The vengeful Hakuji massacred all of the dojo's members and was turned into a demon during an encounter with Muzan afterwards.","244":"Theodore meets with Catherine to sign their divorce papers. When he mentions Samantha, Catherine is appalled that he is romantically attracted to a \"computer\" and accuses him of being unable to handle real human emotions. Sensing that Catherine's words have lingered in Theodore's mind, Samantha engages a volunteer sex surrogate, Isabella, to stimulate Theodore so that they can be physically intimate. Theodore reluctantly agrees, but is overwhelmed by the strangeness of the encounter and sends a distraught Isabella away, causing tension between himself and Samantha.","245":"They chance upon a film shoot involving a dwarf actor, which amuses Ray. Ray is attracted to Chloë, a local drug dealer moonlighting as a production assistant. He takes her to a restaurant, where he gets into an argument with a Canadian couple over smoking indoors and punches them. Chloë takes Ray to her apartment where they begin to have sex, but her ex-boyfriend Eirik appears and threatens Ray with a handgun. Ray effortlessly disarms the small-time criminal and fires the gun, loaded with blanks, in Eirik's face, blinding him in one eye. Chloë admits that she and Eirik rob tourists, but insists she had told Eirik that Ray was not a target. As Chloë drives Eirik to the hospital, Ray pockets the gun and helps himself to a handful of live rounds as well as Chloë's stash of drugs. He and Ken spend a debauched night with the dwarf actor, Jimmy, who takes cocaine and rants about a coming war between blacks and whites.","246":"They lose their first match but still get paid, as wrestlers are entitled to a portion of the total revenue, and the crowd of the event was charmed by their performance. Following this round, Ignacio has Steven make him his own luchador costume for the next matches. They continue to wrestle every week, with Ignacio using the money to improve the orphans' lives but becoming frustrated that they can never win. Ignacio tries everything he can think of, including a folk remedy to acquire the powers of an eagle, but success still eludes them. He then seeks advice from Ramses himself, who arrogantly rebuffs him and the orphans. Undeterred, the duo infiltrates a party Ramses's manager holds for the best wrestlers in Mexico. They discover that in order to be considered a professional, one must be the last luchador standing in the ring at an upcoming free-for-all match. Their cover is blown when Steven encounters an overweight woman named Candidia who falls madly in love with him, to his horror, and when Ignacio, who got in by impersonating a member of a Mariachi band, tries to improvise a song for Ramses, but is rebuffed by Ramses once again and kicked out of the party alongside Steven. In the parking lot, they encounter a duo of rival wrestlers that slash Ignacio's tires, but are defeated by Steven throwing a corncob like a throwing knife into one of their eyes.","247":"Three years later, Qi, Duoduo, and Yiyi work as truck operators, as Earth continues towards the Alpha Centauri star system.","248":"Throughout the days, Aron becomes desperate and depressed and begins hallucinating about escape, relationships, and past experiences, including his family and his former girlfriend, Rana. He also imagines going to the party he was invited to and having fun. During one hallucination, Aron realizes his mistake was that he did not tell anyone where he was going or for how long. Aron has a vision of his future son on the sixth day, spurring his will to survive. He fashions a tourniquet from CamelBak tube insulation and uses a carabiner to tighten it. Then, using his knowledge of torque, he breaks the bones in his arm and, using the multi-tool, slowly amputates it. Aron then wraps the stump to prevent exsanguination and takes a picture of the boulder before rappelling down a 65 ft (20 m) rockface. He then finds some rainwater collected while descending down, drinks the stagnant water due to dehydration, and continues. He spots a family on a hike in the desert and calls for help. They give him water and alert the authorities; a Utah Highway Patrol helicopter brings him to a hospital.","249":"Tipped-off by Wang, Shi and the People's Liberation Army raid the meeting, arresting Ye. An international military force then seizes the converted oil tanker housing ETO's communications with Trisolaris. From these actions, Earth's governments directly learn of Trisolaris' existence and the approaching invasion force. Wang and his colleagues resolve to fight in Humanity's defense.","250":"To prevent breeding, the dinosaurs were made female by direct chromosome manipulation. The group witnesses the hatching of a baby Velociraptor and visits the raptor enclosure. During lunch, the group debates the ethics of cloning and the park's creation. Malcolm warns of the implications of genetic engineering while Grant and Sattler express uncertainty over the ability of humans and dinosaurs to coexist. Hammond's grandchildren, Lex and Tim, join the others for a park tour in two self-driving electric Ford Explorer tour vehicles, while Hammond oversees them from the control room. Most of the dinosaurs fail to appear, and the group encounters a sick Triceratops. The tour is cut short as a tropical storm approaches. The park employees leave for the mainland on a boat while the visitors return to their railed-electric tour vehicles, except Sattler, who stays behind with the park's veterinarian, Dr. Harding, to study the Triceratops.","251":"Twelve extraterrestrial spacecraft hover over various locations around the Earth. In the ensuing widespread panic, affected nations send military and scientific experts to monitor and study them. In the United States, US Army Colonel Weber recruits Banks and physicist Ian Donnelly to study the craft above Montana. On board, Banks and Donnelly make contact with two cephalopod-like, seven-limbed aliens, whom they call \"heptapods\"; Donnelly nicknames them Abbott and Costello. Banks and Donnelly research the complex written language of the heptapods, consisting of phrases written with logograms, and share the results with other nations. As Banks studies the language, she starts to have flashback-like visions of her daughter.","252":"Two months later after Han takes up his new diplomatic post in Los Angeles, Han's daughter Soo Yung is kidnapped by Sang while on her way to school. Han calls Lee to assist in the case, but the FBI, fearing that Lee's involvement could cause an international incident, pawns him off on the LAPD. Detective James Carter, a talented but obnoxious LAPD officer who is disliked by the rest of his precinct for his self-aggrandizing attitude, is tricked into \"babysitting\" Lee as punishment for botching a sting operation under the guise of an arms deal. Carter has long fantasized about joining the FBI and believes he has been selected for an important case. But when Carter finds out he’s been deceived, he decides to solve the kidnapping himself. Carter takes Lee on a sightseeing tour, keeping him away from the embassy while contacting informants about the kidnapping. Lee gets into trouble at a bar when Carter tells him to follow his lead, resulting in Lee calling a black bartender the N-word, unaware it is offensive. Several black patrons attack Lee as a result, forcing him to defeat them. Carter tries to prevent Lee from leaving him but Lee makes his own way to the Chinese Consulate, where Han and the FBI await news about his daughter. While arguing with Special Agent in Charge Warren Russ, Carter unwittingly negotiates with Sang, arranging a $50 million ransom drop.","253":"U.S. involvement in the rescue is suppressed to protect the remaining hostages from retaliation, and full credit is given to the Canadian government. Taylor shuts down the embassy and leaves Iran with his wife while their Iranian housekeeper escapes to Iraq. Mendez is awarded the Intelligence Star, secretly due to the mission's classified nature, and returns to his wife and son in Virginia.","254":"Unable to decipher Nedry's code to reactivate the security system, Hammond and chief engineer Ray Arnold decide to reboot the park's systems. The group shuts down the park's power grid and retreats to an emergency bunker while Arnold heads to a maintenance shed to complete the rebooting process. When Arnold fails to return, Sattler and Muldoon head over, discovering the shutdown has released the Velociraptors. Muldoon distracts two of them while Sattler turns the power back on before being attacked by a third and discovering Arnold's severed arm. While she escapes, Muldoon is caught off-guard and killed by a Velociraptor.","255":"Victor's mother dies giving birth to his younger brother William, who becomes the favorite of their aristocratic father, a renowned physician. Grieving his mother and hardened by his father's abuse, Victor grows to become a brilliant, arrogant surgeon, and becomes obsessed with \"curing\" death through science. In 1855, Victor is expelled from the Royal College of Surgeons of Edinburgh following a demonstration of his research into reanimating corpses, which a disciplinary tribunal views as sacrilege.","256":"Wading ashore, Edmond encounters a band of pirates preparing to execute one of their own, Jacopo. Their leader, Luigi Vampa, decides justice and entertainment would be better served by pitting Edmond against Jacopo in a knife fight. Edmond wins but spares Jacopo, who swears himself to Edmond for life. They both work with the pirates until they arrive in Marseille. Edmond learns from Morrell, who does not recognize him, that his father committed suicide out of grief, and that Fernand and Mercédès have wed. With Faria's map, he and Jacopo locate the treasure on the island of Montecristo. With his newfound wealth and comprehensive education, Edmond establishes himself in Parisian society as \"The Count of Monte Cristo\" with Jacopo as his manservant and swears vengeance on those who conspired against him.","257":"Wang's successes in Three Body result in his induction into the ETO, where Ye reveals to Wang the full extent of the conspiracy. Wang also witnesses the schism between the \"Adventist\" faction of the ETO, which views humanity as irredeemable and promotes its complete destruction by Trisolaris, and the \"Redemptionist\" faction, which aims to save the Trisolaran civilization by developing a solution to the three-body problem and producing an accurate calendar.","258":"Weeks later, Connie and Charlie reconnect with him insisting he had stopped seeing Deb the previous summer and only began dating his current girlfriend after Connie stopped seeing him. Connie tearfully confronts Betty for lying and being hurtful, asking why Betty could not let her be happy. Later, Connie breaks into Charlie's dorm to ask for another chance, and they rekindle their relationship.","259":"Weeks later, Marlin drops Nemo off at school, and Dory arrives shortly afterward. Nemo and Marlin share a warm hug before Marlin waves goodbye to Nemo and tells him to \"go have an adventure\".","260":"When Dumbledore is summoned to London, the three suspect Snape will attempt to steal the stone and decide to stop him. Sneaking onto the third floor, they get past Fluffy and face further defences of a strangling plant, flying keys, and a giant, enchanted chessboard, which leaves Ron incapacitated. Hermione tends to him, leaving Harry alone to confront the intruder, which turns out to be timid Professor Quirrell, whom Snape had been investigating all year while protecting Harry. Harry is granted the Stone by the final defence, the Mirror of Erised, by virtue of not desiring it. Quirrell reveals Voldemort's weakened form on the back of his head, and they attempt to persuade Harry to hand it over. When Harry refuses, Voldemort orders Quirrell to kill him, but Harry's touch incinerates Quirrell's body, from which Voldemort's soul escapes.","261":"When Emily arrives to work while sick and forgets important details about the guests at a charity benefit, Andy steps in to save Miranda from embarrassment. Miranda then selects Andy to be her assistant at Paris Fashion Week instead of Emily. Emily is later hit by a car; while visiting her in the hospital, Andy informs Emily of Miranda's changed plan, and Emily berates Andy for accepting Miranda's offer. Andy's boyfriend, Nate, is disappointed that she has become one of the shallow, egoistical women she once ridiculed, and they break up.","262":"When Stark learns that Vanko is still alive, he goes to Hammer's expo. The armored drones are unveiled, with Rhodes – in a heavily weaponized version of the prototype armor, dubbed \"War Machine\" – as their leader. Just as Stark arrives to warn Rhodes, Vanko takes remote control of all the drones and Rhodes's armor and attacks Stark. Hammer is arrested for breaking Vanko out of prison while Romanoff and Stark's bodyguard Happy Hogan infiltrate Hammer's factory. Vanko escapes, but Romanoff gains access to Hammer Industries software and returns control of Rhodes's armor to him. Together, Stark and Rhodes defeat Vanko, who dies by suicide via blowing up his suit and the drones.","263":"While Harry and Ron become friends, Hermione's studious ways ostracise her from the other students. After Ron insults her, she retreats to the girls' toilets at the same time a mountain troll is found loose in the school. Harry and Ron rescue her from the troll and, when the teachers find them, Hermione takes the blame by saying she went looking for the troll, affirming the three's friendship; at the same time, Harry notices potions professor Severus Snape has sustained an injury. At his first flying lesson, Harry displays such impressive flying skills that McGonagall makes him Seeker for the Gryffindor Quidditch team; during his first match, Ron and Hermione act when they see Snape appearing to jinx Harry's broomstick. Snape's actions lead Harry to suspect him of trying to get into the third-floor corridor, which Hagrid dismisses, unintentionally revealing Fluffy is guarding something known only to Dumbledore and Nicholas Flamel.","264":"While Wade recovers, Cable offers to work with him and Domino to stop Russell from killing the headmaster. Cable explains that in his timeline, after Russell kills the headmaster, he becomes a serial killer who killed Cable's wife and daughter. Wade accepts Cable's offer, on the condition that Cable gives him a chance to change Russell's mind. At the orphanage, however, Deadpool and team are overpowered by Juggernaut, while Russell pursues the headmaster. Colossus, having initially refused to help out, due to Wade's murderous ways, arrives to distract Juggernaut. Wade fails to placate Russell, forcing Cable to shoot at the boy. Wade leaps in front of the bullet while wearing the Ice Box collar and dies, reuniting with Vanessa in the afterlife. His sacrifice dissuades Russell from killing the headmaster and, consequently, saves Cable's family. Cable uses his last charge, reserved for his return trip to his family, to warp back several minutes, strapping Vanessa's token in front of Wade's heart so he survives the bullet. Cable then decides to stay in the present for a while to help improve the world, knowing that his family will be safe in the future. Afterward, the headmaster is run over and killed by Wade's taxi driver friend Dopinder.","265":"While the P.P.P. is given the mission to find a way to legally remove Kane and liberate Rosalinda's kingdom, they hide her in Joe's home in Lake Monroe, Louisiana, where she meets his insecure, tomboyish teenage daughter, Carter. Carter works at the family bait shop and dreams of going to the homecoming dance with her crush, Donny, though her classmate Ed secretly has a crush on her. Rosalinda poses as \"Rosie Gonzalez\", Carter's cousin from Iowa. Though Carter initially treats her with hostility, she warms up to her after Rosie explains her situation, and the two become close friends. Carter teaches Rosie how to act like an average American teenager, while Rosie shows Carter how to disarm those that scorn them, especially resident mean girls Chelsea Barnes and Brooke Angels. Rosie soon becomes popular at their high school.","266":"Willie returns to the neighborhood while unknowingly hauling Deebo and Tyrone in his truck, who snuck in earlier after calling Willie about a message that Craig is in trouble. Craig returns to Elroy's house only to find Willie and Elroy waiting for him. Craig, Willie, and Elroy decide to head the Jokers' house to rescue Day-Day and Roach with Elroy's girlfriend Suga saying she will call the police if they are not back in ten minutes.","267":"With the Red Death's threat over, the Berk villagers co-exist peacefully with the dragons. Gobber replaces Hiccup's foot and Toothless's fin with prosthetics, and Hiccup, now admired by his fellow villagers, begins a relationship with Astrid.","268":"Years later, Aron gets married and has a son. He also continues climbing and always leaves a note telling his family where he has gone.","269":"Yusuf drives the team around the first level as they are sedated into the second level, a hotel dreamed by Arthur. Cobb persuades Robert that Browning has kidnapped him to stop the dissolution and that Cobb is a defensive projection, leading Robert to another third level deeper as part of a ruse to enter Robert's subconscious.","270":"Zenitsu Agatsuma faces his former senior Kaigaku, who became the new Upper Rank Six after an encounter with Upper Rank One Kokushibo. Angered by Kaigaku's lack of guilt over his betrayal, which led to their master Jigoro committing seppuku, they battle. Kaigaku voices his frustration at being compared to Zenitsu, but is killed when he uses a self-taught Thunder Breathing form. Zenitsu passes out and momentarily enters the afterlife, where Jigoro reaffirms he has always been proud of him; he is then rescued by a disguised Yushiro, who has been using his Blood Demon Art to help the Ubuyashikis map the Infinity Castle. Meanwhile, Nezuko Kamado takes a drug produced by Shinobu and Tamayo to restore her humanity and is placed under the care of Sakonji Urokodaki."},"triples":{"0":["<Perfidia Beverly Hills,nemeses,Steven Lockjaw>"],"1":["<Dre Parker,family,Sherry Parker>","<Dre Parker,nemeses,Cheng>"],"2":["<Batman,business,Harvey Dent>","<Batman,friends,Rachel Dawes>","<Rachel Dawes,romantic,Harvey Dent>","<Joker,nemeses,Mafia>","<Lucius Fox,business,Bruce Wayne>"],"3":["<Bob Ferguson,family,Willa Ferguson>"],"4":["<Tony Mendez,family,Mendez’s son>","<Tony Mendez,romantic,Mendez’s wife>","<John Chambers,friends,Tony Mendez>"],"5":["<Liu Peiqiang,business,Maxim Makarov>","<Liu Peiqiang,nemeses,MOSS>","<Maxim Makarov,nemeses,MOSS>"],"6":["<Ye Wenjie,business,Mike Evans>","<Ye Wenjie,business,Earth-Trisolaris Organization>","<Mike Evans,business,Earth-Trisolaris Organization>"],"7":["<Bob Ferguson,family,Perfidia Beverly Hills>","<Willa Ferguson,family,Perfidia Beverly Hills>"],"8":["<Amélie Poulain,friends,Raymond Dufayel>","<Amélie Poulain,friends,Dominique Bretodeau>"],"9":["<Wade Wilson,romantic,Vanessa>","<Wade Wilson,friends,Blind Al>"],"10":["<Craig,nemeses,Deebo>","<Craig,friends,Smokey>","<Craig,family,Willie>","<Craig,family,Elroy>","<Craig,family,Day-Day>","<Willie,family,Elroy>","<Day-Day,family,Elroy>","<Deebo,family,Tyrone>"],"11":["<Miranda,friends,Andy>"],"12":["<Marlin,friends,Blue whale>","<Dory,friends,Blue whale>"],"13":["<Jazz club owner,business,Sebastian>"],"14":["<May,family,Olaug>","<Kari,family,Olaug>","<May,family,Jan>","<Olaug,family,Jan>"],"15":["<Kagaya Ubuyashiki,family,Kiriya>","<Kagaya Ubuyashiki,family,Kuina>","<Kagaya Ubuyashiki,family,Kanata>","<Kiriya,family,Kuina>","<Kiriya,family,Kanata>","<Kuina,family,Kanata>","<Demon Slayer Corps,nemeses,Muzan Kibutsuji>","<Tamayo,nemeses,Muzan Kibutsuji>"],"16":["<Blind Man,friends,The Creature>","<Young Hunter,nemeses,The Creature>"],"17":["<Rumi,friends,Zoey>","<Rumi,friends,Mira>"],"18":["<Sarah Marshall,romantic,Aldous Snow>","<Peter Bretter,nemeses,Aldous Snow>"],"19":["<Amélie Poulain,family,Amandine>","<Amélie Poulain,family,Raphaël>","<Amandine,family,Raphaël>"],"20":["<Amélie Poulain,romantic,Nino Quincampoix>"],"21":["<Georgette,romantic,Joseph>","<Georgette,business,Joseph>","<Collignon,business,Lucien>"],"22":["<Luke Skywalker,friends,Princess Leia Organa>","<Luke Skywalker,friends,Han Solo>"],"23":["<Andy,business,Emily>","<Emily,business,Miranda>","<Andy,business,Nigel>","<Miranda,business,Nigel>","<Emily,business,Nigel>","<Andy,friends,Nigel>"],"24":["<Elizabeth Harlander,romantic,Victor Frankenstein>","<Henrich Harlander,family,Elizabeth Harlander>","<Henrich Harlander,friends,Victor Frankenstein>","<Henrich Harlander,friends,William Frankenstein>"],"25":["<Malcolm,nemeses,Jacoby>"],"26":["<Bobby Boucher,nemeses,Meaney>"],"27":["<Marty McFly,family,George>","<Marty McFly,family,Lorraine>","<George,romantic,Lorraine>"],"28":["<Qi,nemeses,MOSS>"],"29":["<Captain Anderson,friends,The Creature>"],"30":["<Rumi,nemeses,Gwi-Ma>","<Jinu,friends,Rumi>"],"31":["<Preeti,family,Kuljeet>","<Preeti,romantic,Raj>"],"32":["<Andy,business,Miranda>"],"33":["<Raju,friends,Rancho>","<Rancho,nemeses,Virus>"],"34":["<Oh Dae-su,nemeses,Lee Woo-jin>","<Oh Dae-su,family,Mi-do>","<Oh Dae-su,family,Oh Dae-su’s daughter (revealed to be Mi-do)>","<Woo-jin’s bodyguard,business,Lee Woo-jin>","<Oh Dae-su,nemeses,Woo-jin’s bodyguard>"],"35":["<Patrick,nemeses,Brad>"],"36":["<Nick Fury,business,Phil Coulson>"],"37":["<Latrell Spencer,romantic,Marcus\/Tiffany>","<Kevin,romantic,Denise porter>"],"38":["<Cameron James,friends,Bianca Stratford>"],"39":["<Hirayama,romantic,Aya>"],"40":["<Bruce Wayne,romantic,Miranda Tate>","<Bruce Wayne,nemeses,Bane>","<Bane,nemeses,Daggett>","<Bruce Wayne,family,Alfred Pennyworth>","<Bruce Wayne,friends,Gordon>","<Bruce Wayne,friends,John Blake>"],"41":["<Bruce Wayne,nemeses,Joker>"],"42":["<Louise Banks,friends,General Shang>"],"43":["<Day-Day,nemeses,D'Wana>","<Day-Day,nemeses,Baby D>","<Craig,friends,Day-Day>","<Day-Day,friends,Roach>","<Craig,friends,Roach>","<Day-Day,business,Roach>","<Day-Day,business,Pinky>","<Roach,business,Pinky>","<D'Wana,family,Baby D>"],"44":["<Rancho,romantic,Pia>"],"45":["<Bennington Austin Cotwell IV,family,Bennington Austin \"Bing\" Cotwell III>"],"46":["<Betty,nemeses,Giselle>","<Spencer,romantic,Betty>","<Betty,nemeses,Spencer>"],"47":["<Betty,nemeses,Connie>","<Charlie,family,Betty>","<Charlie,romantic,Connie>","<Deb,romantic,Charlie>"],"48":["<Betty,friends,Katherine>","<Betty,family,Betty's mother>"],"49":["<Joan,friends,Giselle>"],"50":["<Bobby Boucher,family,Helen>","<Bobby Boucher,business,Coach Klein>"],"51":["<Bobby Boucher,family,Robert Sr.>","<Robert Sr.,romantic,Phyllis>"],"52":["<Joker,nemeses,Batman>","<Batman,business,Jim Gordon>"],"53":["<Wang Miao,business,Shi Qiang>","<Wang Miao,business,International Task Force>"],"54":["<Simran,family,her mother>","<Raj,nemeses,Kuljeet>"],"55":["<Bianca Stratford,family,Walter>","<Bianca Stratford,family,Kat>","<Walter,family,Kat>"],"56":["<Ray,nemeses,priest>","<Ray,business,Ken>","<Ray,business,Harry>","<Ken,business,Harry>"],"57":["<Patrick,family,Sam>","<Charlie,friends,Sam>","<Charlie,friends,Patrick>","<Sam,romantic,Charlie>"],"58":["<Charlie,family,Aunt Helen>","<Charlie,business,Dr.Burton>"],"59":["<Chatur,nemeses,Rancho>","<Farhan,friends,Rancho>"],"60":["<Chris Washington,romantic,Rose Armitage>","<Dean Armitage,family,Rose Armitage>","<Rose Armitage,nemeses,Chris Washington>","<Georgina,business,Armitage Family>"],"61":["<Roman Armitage,family,Rose Armitage>","<Roman Armitage,family,Dean Armitage>","<Roman Armitage,business,Dean Armitage>","<Walter,business,Armitage Family>"],"62":["<Dani,friends,Pelle>","<Christian,nemeses,Josh>","<Christian,nemeses,Pelle>","<Josh,nemeses,Pelle>","<Mark,nemeses,Pelle>"],"63":["<Dom Cobb,romantic,Mal>"],"64":["<Coleman Reese,business,Bruce Wayne>","<Joker,nemeses,Harvey Dent>","<Harvey Dent,nemeses,Jim Gordon>"],"65":["<Wade Wilson,business,Colossus>","<Russell Collins,nemeses,Cable>"],"66":["<Peter Bretter,romantic,Sarah Marshall>"],"67":["<Conquistador Tomás Creo,nemeses,Mayan priest>","<Queen Isabella,romantic,Conquistador Tomás Creo>"],"68":["<Joker,family,Karla>","<Baby Joker,family,Karla>","<Lil' Joker,family,Karla>"],"69":["<Oh Dae-su,romantic,Mi-do>","<Lee Woo-jin,business,Mi-do (as his paid prisoner)>","<Mi-do,romantic,Oh Dae-su>"],"70":["<Oh Dae-su,nemeses,Mr. Park>","<Oh Dae-su,nemeses,Park’s guards>","<Lee Woo-jin,business,Mr. Park>"],"71":["<Oh Dae-su,nemeses,his captor (Evergreen \/ Lee Woo-jin)>","<Lee Woo-jin,family,Lee Soo-ah>","<Lee Woo-jin,romantic,Lee Soo-ah>","<Joo-hwan,nemeses,Lee Woo-jin>","<Mr. Park,business,Lee Woo-jin>"],"72":["<Wade Wilson,nemeses,Juggernaut>","<Wade Wilson,friends,Domino>","<Russell Collins,friends,Juggernaut>"],"73":["<Dom Cobb,business,Arthur>","<Dom Cobb,business,Saito>","<Saito,nemeses,Maurice Fischer>","<Robert Fischer,family,Maurice Fischer>","<Dom Cobb,business,Yusuf>"],"74":["<Dory,nemeses,Jellyfish>"],"75":["<Jim Hudson,business,Chris Washington>"],"76":["<Hiccup,family,Stoick>"],"77":["<Han,friends,Dre Parker>"],"78":["<Tyler Durden,romantic,Marla Singer>","<Narrator,romantic,Marla Singer>"],"79":["<Sebastian,romantic,Mia>"],"80":["<Thevan,nemeses,Kodumon Potti>","<Cook,family,Kodumon Potti>"],"81":["<Tony Stark,friends,James Rhodes>","<Tony Stark,friends,Nick Fury>","<Tony Stark,friends,Natasha Romanoff>","<Tony Stark,friends,Happy Hogan>","<Tony Stark,business,Natasha Romanoff>","<Pepper Potts,business,Natasha Romanoff>","<Tony Stark,business,James Rhodes>","<Nick Fury,business,Natasha Romanoff>","<Howard Stark,business,Anton Vanko>"],"82":["<Louise Banks,friends,Ian Donnelly>"],"83":["<Edmond Dantès,family,father>","<Fernand Mondego,romantic,Mercédès>","<Edmond Dantès,family,Albert>"],"84":["<Evan Treborn,romantic,Kayleigh Miller>"],"85":["<Elvind,romantic,Sunniva>"],"86":["<Baldev,nemeses,Raj>","<Kuljeet,nemeses,Raj>"],"87":["<Morton Schmidt,romantic,Molly>"],"88":["<Mr. Walters,family,ex-wife>"],"89":["<Willa Ferguson,friends,Deandra>","<Willa Ferguson,friends,Sergio>","<Bob Ferguson,friends,Sergio>"],"90":["<Narrator,nemeses,Tyler Durden>","<Narrator,nemeses,Project Mayhem>"],"91":["<Villefort,family,Clarion>","<Edmond Dantès,nemeses,Fernand Mondego>","<Edmond Dantès,nemeses,Villefort>"],"92":["<Kelly Frears,romantic,Jerry Lovett>","<Kelly Frears,family,Jerry Lovett>"],"93":["<Chuck Noland,friends,Wilson>"],"94":["<Gisselle,romantic,Bill Dunbar>"],"95":["<The Police,nemeses,Joker>"],"96":["<Alan Grant,friends,Tim>"],"97":["<Warren Russ,business,Carter>","<Lee,nemeses,Thomas Griffen>","<Carter,nemeses,Thomas Griffen>","<Griffin,nemeses,Lee>"],"98":["<Evan Treborn,friends,Lenny Kagan>","<Evan Treborn,friends,Kayleigh Miller>"],"99":["<Master Li,nemeses,Han>"],"100":["<Dre Parker,romantic,Meiying>"],"101":["<Harry,family,Petunia Dursley>","<Harry,family,Vernon Dursley>","<Harry,family,Dudley Dursley>","<Harry,friends,Ron>","<Harry,friends,Hermione>","<Ron,friends,Hermione>","<Professor Quirrell,business,Voldemort>","<Harry,business,Ron>","<Harry,business,Hermione>","<Ron,business,Hermione>","<Harry,nemeses,Voldemort>","<Harry,nemeses,Professor Quirrell>"],"102":["<Harry Potter,family,Vernon Dursley>","<Harry Potter,family,Petunia Dursley>","<Harry Potter,family,Dudley Dursley>","<Harry Potter,friends,Ron Weasley>","<Harry Potter,friends,Hermione Granger>","<Ron Weasley,friends,Hermione Granger>","<Ron Weasley,business,Hermione Granger>","<Harry Potter,business,Hagrid>"],"103":["<Harry,business,Yuri>"],"104":["<Harry,nemeses,Ray>","<Marie,nemeses,Harry>"],"105":["<Gryffindor,nemeses,Slytherin>","<Draco Malfoy,nemeses,Harry Potter>","<Harry,nemeses,Draco>"],"106":["<Harry Potter,nemeses,Draco Malfoy>","<Harry Potter,nemeses,Snape>","<Snape,business,Quirrell>"],"107":["<Victor Frankenstein,family,The Creature>"],"108":["<Hirayama,friends,Takashi>","<Takashi,romantic,Aya>"],"109":["<Ignacio,romantic,Sister Encarnación>"],"110":["<Edmond Dantès,friends,Fernand Mondego>","<Edmond Dantès,business,captain>","<Fernand Mondego,business,captain>","<guardians,business,Napoleon Bonaparte>","<Edmond Dantès,business,Napoleon Bonaparte>","<physician,business,Napoleon Bonaparte>","<Morrell,business,Edmond Dantès>","<Danglars,business,Edmond Dantès>","<Fernand Mondego,business,Danglars>","<Edmond Dantès,nemeses,Danglars>"],"111":["<Captain Anderson,friends,Victor Frankenstein>"],"112":["<Smoke,family,Stack>","<Smoke,family,Sammie>","<Stack,family,Sammie>"],"113":["<Robert Frobisher,nemeses,Vyvyan Ayrs>","<Robert Frobisher,romantic,Rufus Sixsmith>"],"114":["<Andy Dufresne,friends,Ellis Boyd \"Red\" Redding>","<Andy Dufresne,nemeses,Bogs Diamond>"],"115":["<Andy Dufresne,business,Brooks Hatlen>","<Byron Hadley,business,Samuel Norton>"],"116":["<Andy Dufresne,nemeses,Samuel Norton>","<Andy Dufresne,friends,Tommy Williams>","<Ellis Boyd \"Red\" Redding,friends,Tommy Williams>"],"117":["<Marty McFly,nemeses,Biff Tannen>"],"118":["<Oh Dae-su,friends,Joo-hwan>"],"119":["<Oh Dae-su,friends,Mi-do>","<Mi-do,friends,Oh Dae-su>"],"120":["<Morton Schmidt,friends,Greg Jenko>","<Greg Jenko,friends,Morton Schmidt>","<Morton Schmidt,nemeses,Domingo>","<Greg Jenko,nemeses,Domingo>","<Morton Schmidt,business,Greg Jenko>","<Greg Jenko,business,Morton Schmidt>"],"121":["<Catkin,family,Zachry Bailey's>","<Meronym,business,Zachry Bailey's>","<Meronym,family,Zachry Bailey's>","<Kona chief,nemeses,Zachry Bailey's>"],"122":["<Aron Ralston,friends,Kristi>","<Aron Ralston,friends,Megan>","<Kristi,friends,Megan>"],"123":["<Chuck Noland,romantic,Kelly Frears>"],"124":["<Sonmi,business,Yoona>","<Sonmi,business,Commander Hae-Joo Chang>"],"125":["<Dermot Hoggins,nemeses,Timothy Cavendish>","<Timothy Cavendish,family,Denholme>","<Timothy Cavendish,nemeses,Denholme>"],"126":["<Marcus,family,Kevin>","<Brittany,family,Tiffany>","<Tiffany and Bittany,family,Andrew Wilson>","<Heather,family,Megan>","<Eliott Gordon,business,Marcus and Kevin>","<Vincent and Jake,business,Marcus and Kevin>"],"127":["<Steve Rodgers,friends,James \"Bucky\" Barnes>","<Steve Rodgers,business,Erskine>","<Steve Rodgers,business,Stark>","<Steve Rodgers,business,Colonel Chester Phillips>","<Steve Rodgers,business,Peggy Carter>","<Erskine,business,Schmidt>"],"128":["<Miranda,romantic,Miranda's husband>","<Nigel,business,James Holt>","<Andy,romantic,Christian Thompson>","<Andy,nemeses,Jacqueline Follet>","<Miranda,nemeses,Jacqueline Follet>","<Christian Thompson,business,Jacqueline Follet>","<Miranda,business,Jacqueline Follet>"],"129":["<Ivan Vanko,family,Anton Vanko>"],"130":["<Luisa Rey,business,Rufus Sixsmith>","<Lloyd Hooks,nemeses,Bill Smoke>","<Isaac Sachs,business,Rufus Sixsmith>","<Joe Napier,business,Luisa Rey>","<Joe Napier,nemeses,Bill Smoke>"],"131":["<Lightning McQueen,nemeses,Chick Hicks>"],"132":["<Carter,nemeses,General Kane>","<Brooke Angels,nemeses,Carter>","<Rosie,friends,Mr. Elegante>"],"133":["<Greg Heffley,friends,Rowley Jefferson>","<Rowley Jefferson,friends,Collin Lee>"],"134":["<Laura Burch,nemeses,Clyde Shelton>","<Laura Burch,business,Nick Rice>","<Jonas Cantrell,business,Nick Rice>","<Jonas Cantrell,nemeses,Clyde Shelton>"],"135":["<lamb,business,lamb-shearers>","<lamb,nemeses,lamb-shearers>","<animals,nemeses,lamb>","<lamb,friends,jackalope>"],"136":["<Adam Ewing,friends,Autua>","<Adam Ewing,nemeses,Henry Goose>"],"137":["<Tom,nemeses,Mayan priest>","<Tommy Creo,romantic,Izzi>"],"138":["<Mufasa,family,Sarabi>","<Scar,family,Mufasa>","<Simba,nemeses,Scar>","<Mufasa,nemeses,Scar>"],"139":["<Simba,family,Mufasa>","<Simba,family,Sarabi>","<Mufasa,family,Scar>","<Simba,family,Scar>","<Mufasa,romantic,Sarabi>"],"140":["<Harry Potter,nemeses,Voldemort>","<Harry Potter,nemeses,Quirrell>"],"141":["<Huntr\/x,nemeses,Saja Boys>"],"142":["<Dani,family,Terri-El>","<Dani,romantic,Christian>"],"143":["<Huntr\/x,business,Celine>","<Celine,family,Rumi>"],"144":["<Kelly Van Ryan,nemeses,Sam Lombardo>","<Suzie Toller,nemeses,Sam Lombardo>","<Sam Lombardo,romantic,Sandra Van Ryan>","<Sam Lombardo,friends,Kenneth Bowden>"],"145":["<Liu Peiqiang,family,Qi>","<Liu Peiqiang,family,Han Zi'ang>","<Qi,family,Han Zi'ang>"],"146":["<John Hammond,business,Donald Gennaro>","<Ian Malcolm,business,Alan Grant>","<Ian Malcolm,business,Ellie Sattler>","<Ian Malcolm,business,John Hammond>"],"147":["<Cameron James,romantic,Bianca Stratford>","<Bianca,romantic,Joey>","<Bianca,nemeses,Joey>","<Bianca,friends,Chastity>"],"148":["<Ray Duquette,nemeses,Suzie Toller>","<Suzie Toller,friends,Davey>","<Ray Duquette,nemeses,Davey>"],"149":["<Joan,friends,Katherine>"],"150":["<Patrick,business,Joey>","<Kat,romantic,Patrick>"],"151":["<Carter,friends,Soo Yung>"],"152":["<Jojo Betzler,family,Scarlett Johansson>","<Jojo Betzler,friends,Adolf Hitler>","<Jojo Betzler,nemeses,Adolf Hitler>","<Jojo Betzler,nemeses,Jewish girl>"],"153":["<Craig,nemeses,Joker>","<Roach,nemeses,Joker>","<Joker,family,Baby Joker>","<Joker,family,Lil' Joker>"],"154":["<Lee Jong-su,nemeses,Ben>","<Jong-su,nemeses,Ben>"],"155":["<Julie,family,Julie's mother>","<Julie,family,Julie's half-sister>","<Julie,family,Julie's father>","<Aksel,family,Aksel's brother>"],"156":["<Julie,romantic,Aksel Wilman>","<Julie,romantic,Elvind>"],"157":["<John Hammond,business,Dennis Nedry>","<Dennis Nedry,nemeses,John Hammond>","<John Hammond,nemeses,Lewis Dodgson>"],"158":["<Peter,family,Rob>","<Gus Polinski,business,polka band members>"],"159":["<Katherine,business,Bill Dunbar>","<Katherine,romantic,Bill Dunbar>","<Katherine,romantic,Paul>"],"160":["<Heather and Megan,nemeses,Brittany and Tiffany>"],"161":["<Kevin,nemeses,Harry>","<Kevin,nemeses,Marv>","<Marley,nemeses,Harry>","<Marley,nemeses,Marv>","<Harry,business,Marv>"],"162":["<Bobby Boucher,romantic,Vicki Vallencourt>"],"163":["<Bobby Boucher,business,Red Beaulieu>","<Bobby Boucher,nemeses,Red Beaulieu>","<Coach Klein,nemeses,Red Beaulieu>"],"164":["<Day-Day,nemeses,Joker>"],"165":["<Wade Wilson,business,Negasonic Teenage Warhead>","<Wade Wilson,friends,Dopinder>","<Colossus,business,Negasonic Teenage Warhead>","<Negasonic Teenage Warhead,romantic,Yukio>","<Wade Wilson,friends,Peter>"],"166":["<Lee Jong-su,romantic,Shin Hae-mi>","<Jong-su,romantic,Hae-mi>"],"167":["<Lightning McQueen,friends,Strip Weathers>","<Chick Hicks,nemeses,Strip Weathers>","<Lightning McQueen,business,Mack>","<Lightning McQueen,friends,Mack>","<Lightning McQueen,business,Doc Hudson>"],"168":["<Lightning McQueen,friends,Doc Hudson>","<Lightning McQueen,friends,Mater>","<Lightning McQueen,romantic,Sally>"],"169":["<Louise Banks,family,Hannah>"],"170":["<Avanti,business,Steven Lockjaw>","<Howard Sommerville,nemeses,Avanti>"],"171":["<Gwi-Ma,nemeses,Honmoon>","<Huntr\/x,nemeses,Gwi-Ma>"],"172":["<Malcolm Adekanbi,friends,Jib Caldones>","<Malcolm Adekanbi,friends,Diggy Andrews>","<Adekanbi,friends,Jib>","<Adekanbi,friends,Diggy>","<Malcolm,business,Jacoby>"],"173":["<Malcolm,romantic,Nakia>"],"174":["<Malcolm,romantic,Lily>"],"175":["<Malcolm,business,Jib>","<Malcolm,business,Diggy>","<Malcolm,business,Will Sherwood>","<Jib,business,Will Sherwood>","<Diggy,business,Will Sherwood>","<Malcolm,business,Will>"],"176":["<Marlin,family,Nemo>","<Coral,family,Marlin>","<Coral,family,Nemo>","<Marlin,romantic,Coral>","<Marlin,family,Coral>","<Barracuda,nemeses,Marlin>","<Marlin,family,Nemo>"],"177":["<Marlin,friends,Sea turtles>","<Dory,friends,Sea turtles>","<Marlin,friends,Nigel>","<Dory,friends,Nigel>"],"178":["<Marlin,friends,Bruce>","<Dory,friends,Bruce>"],"179":["<May,family,Trine>","<Kari,family,Trine>"],"180":["<May,family,Kari>","<May,family,Lita>","<Kari,family,Lita>"],"181":["<Nemo,friends,Gill>","<Nemo,nemeses,Darla>","<Nemo,nemeses,Philip Sherman>"],"182":["<Ruffnut,family,Tuffnut>","<Hiccup,friends,Toothless>"],"183":["<Red Death,nemeses,Toothless>"],"184":["<Ken,nemeses,Harry>"],"185":["<Sarah Marshall,nemeses,Aldous Snow>"],"186":["<Tony Mendez,business,Jack O'Donnell>","<Airport authorities,nemeses,Tony Mendez>","<Airport authorities,nemeses,the six escapees>"],"187":["<Alan Grant,friends,Lex>","<Lex,friends,Tim>"],"188":["<Marley,family,Marley’s son>","<Marley,family,Marley’s granddaughter>","<Kevin,friends,Marley>"],"189":["<Ken Taylor,business,the six escapees>","<Iranian Islamists,nemeses,the six escapees>","<Iranian Islamists,nemeses,U.S. Embassy staff>"],"190":["<Peter Bretter,romantic,Rachel>"],"191":["<Hirayama,family,Niko>","<Hirayama,family,Keiko>","<Keiko,family,Niko>"],"192":["<Tony Mendez,business,John Chambers>","<Tony Mendez,business,Lester Siegel>","<Tony Mendez,business,the six escapees>","<Tony Mendez,business,Iranian culture contact>","<John Chambers,business,Lester Siegel>","<Hostile shopkeeper,nemeses,the six escapees>"],"193":["<Lee,nemeses,Jun Tao>","<Lee,business,Solon Han>","<Lee,business,Thomas Griffen>","<Lee,nemeses,Juntao>","<Sang,nemeses,Lee>"],"194":["<Dr. Ryan Stone,friends,Matt Kowalski>","<Dr. Ryan Stone,family,daughter>"],"195":["<Harry Potter,family,Dursley family>","<Harry Potter,nemeses,Lord Voldemort>","<Harry Potter,family,Dursley>","<Harry,nemeses,Voldemort>"],"196":["<Katherine,nemeses,Betty>","<Katherine,friends,Betty>","<Betty,nemeses,Amanda>"],"197":["<Peter Bretter,nemeses,bar owner>"],"198":["<Peter Bretter,friends,Rachel>"],"199":["<Tanjiro Kamado,nemeses,Muzan Kibutsuji>"],"200":["<Suzie Toller,romantic,Kelly Van Ryan>","<Suzie Toller,nemeses,Kelly Van Ryan>"],"201":["<Thevan,friends,Cook>","<Cook,nemeses,Kodumon Potti>"],"202":["<Rosalinda,family,Sofía>","<Rosalinda,nemeses,General Kane>","<Sofía,nemeses,General Kane>","<Joe Mason,nemeses,General Kane>","<Princes Protection Program agents,nemeses,General Kane>"],"203":["<Raj,romantic,Simran>","<Simran,romantic,Raj>"],"204":["<Ray Duquette,nemeses,Kelly Van Ryan>","<Ray Duquette,friends,Gloria Perez>","<Gloria Perez,nemeses,Sam Lombardo>"],"205":["<Victor Frankenstein,nemeses,The Creature>"],"206":["<Scar,business,Hyenas>","<Simba,business,Nala>","<Scar,business,Lionesses>"],"207":["<Nick Fury,business,Steve Rodgers>"],"208":["<Theodore,romantic,Samantha>","<Theodore,friends,Amy>"],"209":["<Steve Rodgers,nemeses,Schmidt>"],"210":["<Mia,romantic,Boyfriend>"],"211":["<Qi,family,Han Duoduo>","<Han Zi'ang,family,Han Duoduo>","<Qi,friends,Tim>","<Tim,friends,Han Duoduo>"],"212":["<Christian,friends,Mark>","<Christian,friends,Josh>","<Christian,friends,Pelle>"],"213":["<Shinobu Kocho,family,Kanae>","<Shinobu Kocho,family,Kanao Tsuyuri>","<Shinobu Kocho,nemeses,Doma>","<Kanao Tsuyuri,nemeses,Doma>"],"214":["<Simba,friends,Pumbaa>","<Timon,friends,Pumbaa>"],"215":["<Simran,family,Baldev>","<Kuljeet,family,Ajit>","<Simran,nemeses,Baldev>","<Ajit,business,Baldev>"],"216":["<Tony Stark,family,Howard Stark>","<Tony Stark,nemeses,Justin Hammer>","<Tony Stark,nemeses,U.S. Government>","<Tony Stark,business,Pepper Potts>","<Tony Stark,business,Happy Hogan>"],"217":["<Edmond Dantès,friends,Abbé Faria>","<Edmond Dantès,business,Armand Dorleac>"],"218":["<Tony Stark,nemeses,Ivan Vanko>","<Ivan Vanko,nemeses,Justin Hammer>","<Justin Hammer,business,Ivan Vanko>"],"219":["<Suzie Toller,friends,Kenneth Bowden>"],"220":["<Tanjiro Kamado,friends,Giyu Tomioka>","<Tanjiro Kamado,friends,Inosuke>","<Tanjiro Kamado,nemeses,Akaza>","<Giyu Tomioka,nemeses,Akaza>"],"221":["<Clarence Darby,nemeses,Clyde Shelton>","<Nick Rice,nemeses,Clyde Shelton>"],"222":["<Marty McFly,friends,Emmett \"Doc\" Brown>"],"223":["<Willa Ferguson,nemeses,Steven Lockjaw>"],"224":["<Sang,business,Jun Tao>","<Carter,business,Lee>","<Carter,romantic,Tania Johnson>","<Carter,business,Tania Johnson>","<Carter,nemeses,Clive Cobb>","<Carter,friends,Lee>","<James Carter,friends,Lee>","<James Carter,business,Lee>","<Tania Johnson,romantic,Carter>"],"225":["<Chuck Noland,business,Albert Miller>"],"226":["<Kate,family,Peter>","<Kate,family,Kevin>","<Peter,family,Kevin>","<Kevin,family,Buzz>","<Kevin,family,Kevin’s siblings>","<Kevin,family,Kevin’s cousins>","<Kevin,nemeses,Buzz>","<Kate,romantic,Peter>"],"227":["<Dr. Ryan Stone,business,Matt Kowalski>","<Matt Kowalski,business,Dr. Ryan Stone>"],"228":["<Tony Mendez,business,U.S. State Department>"],"229":["<Luke Skywalker,family,Beru Lars>","<Luke Skywalker,family,Owen Lars>","<Luke Skywalker,friends,Obi-Wan Kenobi>"],"230":["<Morton Schmidt,business,Captain Dickson>","<Greg Jenko,business,Captain Dickson>"],"231":["<Olaug,business,Maria>"],"232":["<Dani,romantic,Pelle>"],"233":["<Qi,business,Li Yiyi>","<Qi,friends,Wang Lei>","<Qi,friends,Li Yiyi>","<Tim,friends,Li Yiyi>","<Wang Lei,friends,Tim>","<Wang Lei,friends,Han Duoduo>","<Wang Lei,friends,Li Yiyi>"],"234":["<Morton Schmidt,nemeses,Mr. Walters>","<Greg Jenko,nemeses,Mr. Walters>","<Morton Schmidt,nemeses,Eric>","<Greg Jenko,nemeses,Eric>","<Tom Hanson,business,Doug Penhall>","<Morton Schmidt,business,Tom Hanson>","<Morton Schmidt,business,Doug Penhall>","<Greg Jenko,business,Tom Hanson>","<Greg Jenko,business,Doug Penhall>"],"235":["<Narrator,nemeses,Project Mayhem police>"],"236":["<Narrator,friends,Tyler Durden>","<Narrator,friends,Bob>","<Narrator,business,Narrator’s boss>","<Narrator,business,Tyler Durden>"],"237":["<Ignacio,friends,Steven>"],"238":["<Ignacio,nemeses,Ramses>","<Ignacio,nemeses,Silencio>","<Steven,nemeses,Silencio>"],"239":["<Dean Armitage,nemeses,Chris Washington>","<Chris Washington,friends,Rod Williams>","<Chris Washington,nemeses,Dean Armitage>","<Chris Washington,nemeses,Missy Armitage>"],"240":["<Olaug,family,Trine>"],"241":["<Baby Joker,family,Lil' Joker>"],"242":["<Grace,romantic,Bo>","<Stack,romantic,Mary>","<Smoke,romantic,Annie>","<Smoke,business,Delta Slim>","<Stack,business,Delta Slim>","<Grace,family,Bo Chow>","<Smoke,business,Grace>","<Stack,business,Grace>"],"243":["<Hakuji,family,Hakuji's father>","<Hakuji,business,Keizo>","<Hakuji,romantic,Koyuki>","<Keizo,family,Koyuki>","<Akaza,romantic,Koyuki>"],"244":["<Theodore,nemeses,Catherine>"],"245":["<Ray,romantic,Chloë>","<Ray,nemeses,Canadian couple>","<Eirik,nemeses,Ray>","<Ray,friends,Jimmy>","<Ken,friends,Jimmy>"],"246":["<Candidia,romantic,Steven>"],"247":["<Qi,business,Han Duoduo>","<Han Duoduo,business,Li Yiyi>"],"248":["<Aron Ralston,romantic,Rana>"],"249":["<Shi Qiang,business,International Task Force>","<Ye Wenjie,nemeses,Earth governments>","<Earth-Trisolaris Organization,nemeses,Earth governments>","<Shi Qiang,nemeses,Earth-Trisolaris Organization>"],"250":["<John Hammond,family,Lex>","<John Hammond,family,Tim>","<Lex,family,Tim>","<Alan Grant,friends,Ellie Sattler>"],"251":["<Louise Banks,friends,heptapods (Abbott and Costello)>","<Ian Donnelly,friends,heptapods (Abbott and Costello)>","<Costello,friends,Abbott>"],"252":["<Solon Han,family,Soo Yung>","<Soo Yung,nemeses,Sang>","<Han,family,Soo Young>"],"253":["<Tony Mendez,family,Mendez’s wife>","<Ken Taylor,family,Taylor’s wife>","<Ken Taylor,romantic,Taylor’s wife>"],"254":["<John Hammond,business,Ray Arnold>","<John Hammond,business,Robert Muldoon>","<Ray Arnold,business,Dennis Nedry>","<Ray Arnold,business,Robert Muldoon>","<Dennis Nedry,nemeses,Ray Arnold>","<Ellie Sattler,friends,Robert Muldoon>"],"255":["<Victor Frankenstein,family,William Frankenstein>","<Victor Frankenstein,family,Baron Leopold Frankenstein>"],"256":["<Edmond Dantès,friends,Jacopo>","<Edmond Dantès,business,Jacopo>","<Edmond Dantès,friends,Albert>"],"257":["<Wang Miao,nemeses,Earth-Trisolaris Organization>"],"258":["<Betty,friends,Connie>"],"259":["<Marlin,friends,Dory>","<Marlin,friends,Dory>"],"260":["<Harry Potter,nemeses,Quirinus Quirrell>"],"261":["<Andy,romantic,Nate>","<Andy,nemeses,Emily>","<Andy,friends,Emily>"],"262":["<Tony Stark,nemeses,Hammer Drones>","<Tony Stark,nemeses,War Machine>"],"263":["<Harry Potter,friends,Ron Weasley>","<Harry Potter,friends,Hermione Granger>","<Ron Weasley,friends,Hermione Granger>","<Harry,friends,Ron>","<Harry,friends,Hermione>"],"264":["<Wade Wilson,nemeses,Cable>","<Russell Collins,nemeses,headmaster>","<Cable,family,Cable's wife>","<Cable,family,Cable's daughter>","<Cable's wife,family,Cable's daughter>","<Domino,friends,Cable>","<Wade Wilson,friends,Cable>"],"265":["<Joe Mason,family,Carter>","<Chelsea Barnes,nemeses,Rosie>","<Brooke Angels,nemeses,Rosie>","<Chelsea Barnes,nemeses,Carter>","<Rosie,friends,Carter>","<Joe Mason,business,PPP agents>"],"266":["<Elroy,romantic,Suga>"],"267":["<Hiccup,romantic,Astrid>"],"268":["<Aron Ralston,family,Aron's family>","<Aron Ralston,family,Aron's son>","<Aron Ralston,romantic,Aron's wife>","<Aron Ralston,family,Aron's wife>"],"269":["<Dom Cobb,business,Eames>"],"270":["<Zenitsu Agatsuma,business,Kaigaku>","<Zenitsu Agatsuma,business,Jigoro>","<Kaigaku,business,Jigoro>","<Tanjiro Kamado,family,Nezuko Kamado>","<Zenitsu Agatsuma,nemeses,Kaigaku>"]},"url":{"0":"https:\/\/en.wikipedia.org\/wiki\/One_Battle_After_Another","1":"https:\/\/en.wikipedia.org\/wiki\/The_Karate_Kid_(2010_film)","2":"https:\/\/en.wikipedia.org\/wiki\/The_Dark_Knight","3":"https:\/\/en.wikipedia.org\/wiki\/One_Battle_After_Another","4":"https:\/\/en.wikipedia.org\/wiki\/Argo_(2012_film)","5":"https:\/\/en.wikipedia.org\/wiki\/The_Wandering_Earth","6":"https:\/\/en.wikipedia.org\/wiki\/The_Three-Body_Problem_(novel)","7":"https:\/\/en.wikipedia.org\/wiki\/One_Battle_After_Another","8":"https:\/\/en.wikipedia.org\/wiki\/Am%C3%A9lie","9":"https:\/\/en.wikipedia.org\/wiki\/Deadpool_2","10":"https:\/\/en.wikipedia.org\/wiki\/Next_Friday","11":"https:\/\/en.wikipedia.org\/wiki\/The_Devil_Wears_Prada_(film)","12":"https:\/\/en.wikipedia.org\/wiki\/Finding_Nemo","13":"https:\/\/en.wikipedia.org\/wiki\/La_La_Land","14":"https:\/\/en.wikipedia.org\/wiki\/The_Gullsp%C3%A5ng_Miracle","15":"https:\/\/en.wikipedia.org\/wiki\/Demon_Slayer:_Kimetsu_no_Yaiba_%E2%80%93_The_Movie:_Infinity_Castle","16":"https:\/\/en.wikipedia.org\/wiki\/Frankenstein_(2025_film)","17":"https:\/\/en.wikipedia.org\/wiki\/KPop_Demon_Hunters","18":"https:\/\/en.wikipedia.org\/wiki\/Forgetting_Sarah_Marshall","19":"https:\/\/en.wikipedia.org\/wiki\/Am%C3%A9lie","20":"https:\/\/en.wikipedia.org\/wiki\/Am%C3%A9lie","21":"https:\/\/en.wikipedia.org\/wiki\/Am%C3%A9lie","22":"https:\/\/en.wikipedia.org\/wiki\/Star_Wars_(film)","23":"https:\/\/en.wikipedia.org\/wiki\/The_Devil_Wears_Prada_(film)","24":"https:\/\/en.wikipedia.org\/wiki\/Frankenstein_(2025_film)","25":"https:\/\/en.wikipedia.org\/wiki\/Dope_(2015_film)","26":"https:\/\/en.wikipedia.org\/wiki\/The_Waterboy","27":"https:\/\/en.wikipedia.org\/wiki\/Back_to_the_Future","28":"https:\/\/en.wikipedia.org\/wiki\/The_Wandering_Earth","29":"https:\/\/en.wikipedia.org\/wiki\/Frankenstein_(2025_film)","30":"https:\/\/en.wikipedia.org\/wiki\/KPop_Demon_Hunters","31":"https:\/\/en.wikipedia.org\/wiki\/Dilwale_Dulhania_Le_Jayenge","32":"https:\/\/en.wikipedia.org\/wiki\/The_Devil_Wears_Prada_(film)","33":"https:\/\/en.wikipedia.org\/wiki\/3_Idiots#Plot","34":"https:\/\/en.wikipedia.org\/wiki\/Oldboy_(2003_film)","35":"https:\/\/en.wikipedia.org\/wiki\/The_Perks_of_Being_a_Wallflower_(film)","36":"https:\/\/en.wikipedia.org\/wiki\/Iron_Man_2","37":"https:\/\/en.wikipedia.org\/wiki\/White_Chicks","38":"https:\/\/en.wikipedia.org\/wiki\/10_Things_I_Hate_About_You","39":"https:\/\/en.wikipedia.org\/wiki\/Perfect_Days","40":"https:\/\/en.wikipedia.org\/wiki\/The_Dark_Knight_Rises","41":"https:\/\/en.wikipedia.org\/wiki\/The_Dark_Knight_Rises","42":"https:\/\/en.wikipedia.org\/wiki\/Arrival_(film)","43":"https:\/\/en.wikipedia.org\/wiki\/Next_Friday","44":"https:\/\/en.wikipedia.org\/wiki\/3_Idiots#Plot","45":"https:\/\/en.wikipedia.org\/wiki\/Baby%27s_Day_Out","46":"https:\/\/en.wikipedia.org\/wiki\/Mona_Lisa_Smile","47":"https:\/\/en.wikipedia.org\/wiki\/Mona_Lisa_Smile","48":"https:\/\/en.wikipedia.org\/wiki\/Mona_Lisa_Smile","49":"https:\/\/en.wikipedia.org\/wiki\/Mona_Lisa_Smile","50":"https:\/\/en.wikipedia.org\/wiki\/The_Waterboy","51":"https:\/\/en.wikipedia.org\/wiki\/The_Waterboy","52":"https:\/\/en.wikipedia.org\/wiki\/The_Dark_Knight","53":"https:\/\/en.wikipedia.org\/wiki\/The_Three-Body_Problem_(novel)","54":"https:\/\/en.wikipedia.org\/wiki\/Dilwale_Dulhania_Le_Jayenge","55":"https:\/\/en.wikipedia.org\/wiki\/10_Things_I_Hate_About_You","56":"https:\/\/en.wikipedia.org\/wiki\/In_Bruges","57":"https:\/\/en.wikipedia.org\/wiki\/The_Perks_of_Being_a_Wallflower_(film)","58":"https:\/\/en.wikipedia.org\/wiki\/The_Perks_of_Being_a_Wallflower_(film)","59":"https:\/\/en.wikipedia.org\/wiki\/3_Idiots#Plot","60":"https:\/\/en.wikipedia.org\/wiki\/Get_Out","61":"https:\/\/en.wikipedia.org\/wiki\/Get_Out","62":"https:\/\/en.wikipedia.org\/wiki\/Midsommar","63":"https:\/\/en.wikipedia.org\/wiki\/Inception","64":"https:\/\/en.wikipedia.org\/wiki\/The_Dark_Knight","65":"https:\/\/en.wikipedia.org\/wiki\/Deadpool_2","66":"https:\/\/en.wikipedia.org\/wiki\/Forgetting_Sarah_Marshall","67":"https:\/\/en.wikipedia.org\/wiki\/The_Fountain","68":"https:\/\/en.wikipedia.org\/wiki\/Next_Friday","69":"https:\/\/en.wikipedia.org\/wiki\/Oldboy_(2003_film)","70":"https:\/\/en.wikipedia.org\/wiki\/Oldboy_(2003_film)","71":"https:\/\/en.wikipedia.org\/wiki\/Oldboy_(2003_film)","72":"https:\/\/en.wikipedia.org\/wiki\/Deadpool_2","73":"https:\/\/en.wikipedia.org\/wiki\/Inception","74":"https:\/\/en.wikipedia.org\/wiki\/Finding_Nemo","75":"https:\/\/en.wikipedia.org\/wiki\/Get_Out","76":"https:\/\/en.wikipedia.org\/wiki\/How_to_Train_Your_Dragon_(2025_film)","77":"https:\/\/en.wikipedia.org\/wiki\/The_Karate_Kid_(2010_film)","78":"https:\/\/en.wikipedia.org\/wiki\/Fight_Club","79":"https:\/\/en.wikipedia.org\/wiki\/La_La_Land","80":"https:\/\/en.wikipedia.org\/wiki\/Bramayugam","81":"https:\/\/en.wikipedia.org\/wiki\/Iron_Man_2","82":"https:\/\/en.wikipedia.org\/wiki\/Arrival_(film)","83":"https:\/\/en.wikipedia.org\/wiki\/The_Count_of_Monte_Cristo_(2002_film)","84":"https:\/\/en.wikipedia.org\/wiki\/The_Butterfly_Effect","85":"https:\/\/en.wikipedia.org\/wiki\/The_Worst_Person_in_the_World_(film)","86":"https:\/\/en.wikipedia.org\/wiki\/Dilwale_Dulhania_Le_Jayenge","87":"https:\/\/en.wikipedia.org\/wiki\/21_Jump_Street_(film)","88":"https:\/\/en.wikipedia.org\/wiki\/21_Jump_Street_(film)","89":"https:\/\/en.wikipedia.org\/wiki\/One_Battle_After_Another","90":"https:\/\/en.wikipedia.org\/wiki\/Fight_Club","91":"https:\/\/en.wikipedia.org\/wiki\/The_Count_of_Monte_Cristo_(2002_film)","92":"https:\/\/en.wikipedia.org\/wiki\/Cast_Away","93":"https:\/\/en.wikipedia.org\/wiki\/Cast_Away","94":"https:\/\/en.wikipedia.org\/wiki\/Mona_Lisa_Smile","95":"https:\/\/en.wikipedia.org\/wiki\/The_Dark_Knight","96":"https:\/\/en.wikipedia.org\/wiki\/Jurassic_Park","97":"https:\/\/en.wikipedia.org\/wiki\/Rush_Hour_(1998_film)","98":"https:\/\/en.wikipedia.org\/wiki\/The_Butterfly_Effect","99":"https:\/\/en.wikipedia.org\/wiki\/The_Karate_Kid_(2010_film)","100":"https:\/\/en.wikipedia.org\/wiki\/The_Karate_Kid_(2010_film)","101":"https:\/\/en.wikipedia.org\/wiki\/Harry_Potter_and_the_Philosopher%27s_Stone","102":"https:\/\/en.wikipedia.org\/wiki\/Harry_Potter_and_the_Philosopher%27s_Stone_(film","103":"https:\/\/en.wikipedia.org\/wiki\/In_Bruges","104":"https:\/\/en.wikipedia.org\/wiki\/In_Bruges","105":"https:\/\/en.wikipedia.org\/wiki\/Harry_Potter_and_the_Philosopher%27s_Stone_(film)","106":"https:\/\/en.wikipedia.org\/wiki\/Harry_Potter_and_the_Philosopher%27s_Stone_(film","107":"https:\/\/en.wikipedia.org\/wiki\/Frankenstein_(2025_film)","108":"https:\/\/en.wikipedia.org\/wiki\/Perfect_Days","109":"https:\/\/en.wikipedia.org\/wiki\/Nacho_Libre","110":"https:\/\/en.wikipedia.org\/wiki\/The_Count_of_Monte_Cristo_(2002_film)","111":"https:\/\/en.wikipedia.org\/wiki\/Frankenstein_(2025_film)","112":"https:\/\/en.wikipedia.org\/wiki\/Sinners_(2025_film)","113":"https:\/\/en.wikipedia.org\/wiki\/Cloud_Atlas_(film)","114":"https:\/\/en.wikipedia.org\/wiki\/The_Shawshank_Redemption","115":"https:\/\/en.wikipedia.org\/wiki\/The_Shawshank_Redemption","116":"https:\/\/en.wikipedia.org\/wiki\/The_Shawshank_Redemption","117":"https:\/\/en.wikipedia.org\/wiki\/Back_to_the_Future","118":"https:\/\/en.wikipedia.org\/wiki\/Oldboy_(2003_film)","119":"https:\/\/en.wikipedia.org\/wiki\/Oldboy_(2003_film)","120":"https:\/\/en.wikipedia.org\/wiki\/21_Jump_Street_(film)","121":"https:\/\/en.wikipedia.org\/wiki\/Cloud_Atlas_(film)","122":"https:\/\/en.wikipedia.org\/wiki\/127_Hours","123":"https:\/\/en.wikipedia.org\/wiki\/Cast_Away","124":"https:\/\/en.wikipedia.org\/wiki\/Cloud_Atlas_(film)","125":"https:\/\/en.wikipedia.org\/wiki\/Cloud_Atlas_(film)","126":"https:\/\/en.wikipedia.org\/wiki\/White_Chicks","127":"https:\/\/en.wikipedia.org\/wiki\/Captain_America:_The_First_Avenger","128":"https:\/\/en.wikipedia.org\/wiki\/The_Devil_Wears_Prada_(film)","129":"https:\/\/en.wikipedia.org\/wiki\/Iron_Man_2","130":"https:\/\/en.wikipedia.org\/wiki\/Cloud_Atlas_(film)","131":"https:\/\/en.wikipedia.org\/wiki\/Cars_(film)","132":"https:\/\/en.wikipedia.org\/wiki\/Princess_Protection_Program","133":"https:\/\/en.wikipedia.org\/wiki\/Diary_of_a_Wimpy_Kid_(2010_film)","134":"https:\/\/en.wikipedia.org\/wiki\/Law_Abiding_Citizen","135":"https:\/\/en.wikipedia.org\/wiki\/Boundin%27","136":"https:\/\/en.wikipedia.org\/wiki\/Cloud_Atlas_(film)","137":"https:\/\/en.wikipedia.org\/wiki\/The_Fountain","138":"https:\/\/en.wikipedia.org\/wiki\/The_Lion_King","139":"https:\/\/en.wikipedia.org\/wiki\/The_Lion_King","140":"https:\/\/en.wikipedia.org\/wiki\/Harry_Potter_and_the_Philosopher%27s_Stone_(film","141":"https:\/\/en.wikipedia.org\/wiki\/KPop_Demon_Hunters","142":"https:\/\/en.wikipedia.org\/wiki\/Midsommar","143":"https:\/\/en.wikipedia.org\/wiki\/KPop_Demon_Hunters","144":"https:\/\/en.wikipedia.org\/wiki\/Wild_Things_(film)","145":"https:\/\/en.wikipedia.org\/wiki\/The_Wandering_Earth","146":"https:\/\/en.wikipedia.org\/wiki\/Jurassic_Park","147":"https:\/\/en.wikipedia.org\/wiki\/10_Things_I_Hate_About_You","148":"https:\/\/en.wikipedia.org\/wiki\/Wild_Things_(film)","149":"https:\/\/en.wikipedia.org\/wiki\/Mona_Lisa_Smile","150":"https:\/\/en.wikipedia.org\/wiki\/10_Things_I_Hate_About_You","151":"https:\/\/en.wikipedia.org\/wiki\/Rush_Hour_(1998_film)","152":"https:\/\/en.wikipedia.org\/wiki\/Jojo_Rabbit","153":"https:\/\/en.wikipedia.org\/wiki\/Next_Friday","154":"https:\/\/en.wikipedia.org\/wiki\/Burning_(2018_film)","155":"https:\/\/en.wikipedia.org\/wiki\/The_Worst_Person_in_the_World_(film)","156":"https:\/\/en.wikipedia.org\/wiki\/The_Worst_Person_in_the_World_(film)","157":"https:\/\/en.wikipedia.org\/wiki\/Jurassic_Park","158":"https:\/\/en.wikipedia.org\/wiki\/Home_Alone","159":"https:\/\/en.wikipedia.org\/wiki\/Mona_Lisa_Smile","160":"https:\/\/en.wikipedia.org\/wiki\/White_Chicks","161":"https:\/\/en.wikipedia.org\/wiki\/Home_Alone","162":"https:\/\/en.wikipedia.org\/wiki\/The_Waterboy","163":"https:\/\/en.wikipedia.org\/wiki\/The_Waterboy","164":"https:\/\/en.wikipedia.org\/wiki\/Next_Friday","165":"https:\/\/en.wikipedia.org\/wiki\/Deadpool_2","166":"https:\/\/en.wikipedia.org\/wiki\/Burning_(2018_film)","167":"https:\/\/en.wikipedia.org\/wiki\/Cars_(film)","168":"https:\/\/en.wikipedia.org\/wiki\/Cars_(film)","169":"https:\/\/en.wikipedia.org\/wiki\/Arrival_(film)","170":"https:\/\/en.wikipedia.org\/wiki\/One_Battle_After_Another","171":"https:\/\/en.wikipedia.org\/wiki\/KPop_Demon_Hunters","172":"https:\/\/en.wikipedia.org\/wiki\/Dope_(2015_film)","173":"https:\/\/en.wikipedia.org\/wiki\/Dope_(2015_film)","174":"https:\/\/en.wikipedia.org\/wiki\/Dope_(2015_film)","175":"https:\/\/en.wikipedia.org\/wiki\/Dope_(2015_film)","176":"https:\/\/en.wikipedia.org\/wiki\/Finding_Nemo","177":"https:\/\/en.wikipedia.org\/wiki\/Finding_Nemo","178":"https:\/\/en.wikipedia.org\/wiki\/Finding_Nemo","179":"https:\/\/en.wikipedia.org\/wiki\/The_Gullsp%C3%A5ng_Miracle","180":"https:\/\/en.wikipedia.org\/wiki\/The_Gullsp%C3%A5ng_Miracle","181":"https:\/\/en.wikipedia.org\/wiki\/Finding_Nemo","182":"https:\/\/en.wikipedia.org\/wiki\/How_to_Train_Your_Dragon_(2025_film)","183":"https:\/\/en.wikipedia.org\/wiki\/How_to_Train_Your_Dragon_(2025_film)","184":"https:\/\/en.wikipedia.org\/wiki\/In_Bruges","185":"https:\/\/en.wikipedia.org\/wiki\/Forgetting_Sarah_Marshall","186":"https:\/\/en.wikipedia.org\/wiki\/Argo_(2012_film)","187":"https:\/\/en.wikipedia.org\/wiki\/Jurassic_Park","188":"https:\/\/en.wikipedia.org\/wiki\/Home_Alone","189":"https:\/\/en.wikipedia.org\/wiki\/Argo_(2012_film)","190":"https:\/\/en.wikipedia.org\/wiki\/Forgetting_Sarah_Marshall","191":"https:\/\/en.wikipedia.org\/wiki\/Perfect_Days","192":"https:\/\/en.wikipedia.org\/wiki\/Argo_(2012_film)","193":"https:\/\/en.wikipedia.org\/wiki\/Rush_Hour_(1998_film)","194":"https:\/\/en.wikipedia.org\/wiki\/Gravity_(2013_film)","195":"https:\/\/en.wikipedia.org\/wiki\/Harry_Potter_and_the_Philosopher%27s_Stone_(film)","196":"https:\/\/en.wikipedia.org\/wiki\/Mona_Lisa_Smile","197":"https:\/\/en.wikipedia.org\/wiki\/Forgetting_Sarah_Marshall","198":"https:\/\/en.wikipedia.org\/wiki\/Forgetting_Sarah_Marshall","199":"https:\/\/en.wikipedia.org\/wiki\/Demon_Slayer:_Kimetsu_no_Yaiba_%E2%80%93_The_Movie:_Infinity_Castle","200":"https:\/\/en.wikipedia.org\/wiki\/Wild_Things_(film)","201":"https:\/\/en.wikipedia.org\/wiki\/Bramayugam","202":"https:\/\/en.wikipedia.org\/wiki\/Princess_Protection_Program","203":"https:\/\/en.wikipedia.org\/wiki\/Dilwale_Dulhania_Le_Jayenge","204":"https:\/\/en.wikipedia.org\/wiki\/Wild_Things_(film)","205":"https:\/\/en.wikipedia.org\/wiki\/Frankenstein_(2025_film)","206":"https:\/\/en.wikipedia.org\/wiki\/The_Lion_King","207":"https:\/\/en.wikipedia.org\/wiki\/Captain_America:_The_First_Avenger","208":"https:\/\/en.wikipedia.org\/wiki\/Her_(2013_film)","209":"https:\/\/en.wikipedia.org\/wiki\/Captain_America:_The_First_Avenger","210":"https:\/\/en.wikipedia.org\/wiki\/La_La_Land","211":"https:\/\/en.wikipedia.org\/wiki\/The_Wandering_Earth","212":"https:\/\/en.wikipedia.org\/wiki\/Midsommar","213":"https:\/\/en.wikipedia.org\/wiki\/Demon_Slayer:_Kimetsu_no_Yaiba_%E2%80%93_The_Movie:_Infinity_Castle","214":"https:\/\/en.wikipedia.org\/wiki\/The_Lion_King","215":"https:\/\/en.wikipedia.org\/wiki\/Dilwale_Dulhania_Le_Jayenge","216":"https:\/\/en.wikipedia.org\/wiki\/Iron_Man_2","217":"https:\/\/en.wikipedia.org\/wiki\/The_Count_of_Monte_Cristo_(2002_film)","218":"https:\/\/en.wikipedia.org\/wiki\/Iron_Man_2","219":"https:\/\/en.wikipedia.org\/wiki\/Wild_Things_(film)","220":"https:\/\/en.wikipedia.org\/wiki\/Demon_Slayer:_Kimetsu_no_Yaiba_%E2%80%93_The_Movie:_Infinity_Castle","221":"https:\/\/en.wikipedia.org\/wiki\/Law_Abiding_Citizen","222":"https:\/\/en.wikipedia.org\/wiki\/Back_to_the_Future","223":"https:\/\/en.wikipedia.org\/wiki\/One_Battle_After_Another","224":"https:\/\/en.wikipedia.org\/wiki\/Rush_Hour_(1998_film)","225":"https:\/\/en.wikipedia.org\/wiki\/Cast_Away","226":"https:\/\/en.wikipedia.org\/wiki\/Home_Alone","227":"https:\/\/en.wikipedia.org\/wiki\/Gravity_(2013_film)","228":"https:\/\/en.wikipedia.org\/wiki\/Argo_(2012_film)","229":"https:\/\/en.wikipedia.org\/wiki\/Star_Wars_(film)","230":"https:\/\/en.wikipedia.org\/wiki\/21_Jump_Street_(film)","231":"https:\/\/en.wikipedia.org\/wiki\/The_Gullsp%C3%A5ng_Miracle","232":"https:\/\/en.wikipedia.org\/wiki\/Midsommar","233":"https:\/\/en.wikipedia.org\/wiki\/The_Wandering_Earth","234":"https:\/\/en.wikipedia.org\/wiki\/21_Jump_Street_(film)","235":"https:\/\/en.wikipedia.org\/wiki\/Fight_Club","236":"https:\/\/en.wikipedia.org\/wiki\/Fight_Club","237":"https:\/\/en.wikipedia.org\/wiki\/Nacho_Libre","238":"https:\/\/en.wikipedia.org\/wiki\/Nacho_Libre","239":"https:\/\/en.wikipedia.org\/wiki\/Get_Out","240":"https:\/\/en.wikipedia.org\/wiki\/The_Gullsp%C3%A5ng_Miracle","241":"https:\/\/en.wikipedia.org\/wiki\/Next_Friday","242":"https:\/\/en.wikipedia.org\/wiki\/Sinners_(2025_film)","243":"https:\/\/en.wikipedia.org\/wiki\/Demon_Slayer:_Kimetsu_no_Yaiba_%E2%80%93_The_Movie:_Infinity_Castle","244":"https:\/\/en.wikipedia.org\/wiki\/Her_(2013_film)","245":"https:\/\/en.wikipedia.org\/wiki\/In_Bruges","246":"https:\/\/en.wikipedia.org\/wiki\/Nacho_Libre","247":"https:\/\/en.wikipedia.org\/wiki\/The_Wandering_Earth","248":"https:\/\/en.wikipedia.org\/wiki\/127_Hours","249":"https:\/\/en.wikipedia.org\/wiki\/The_Three-Body_Problem_(novel)","250":"https:\/\/en.wikipedia.org\/wiki\/Jurassic_Park","251":"https:\/\/en.wikipedia.org\/wiki\/Arrival_(film)","252":"https:\/\/en.wikipedia.org\/wiki\/Rush_Hour_(1998_film)","253":"https:\/\/en.wikipedia.org\/wiki\/Argo_(2012_film)","254":"https:\/\/en.wikipedia.org\/wiki\/Jurassic_Park","255":"https:\/\/en.wikipedia.org\/wiki\/Frankenstein_(2025_film)","256":"https:\/\/en.wikipedia.org\/wiki\/The_Count_of_Monte_Cristo_(2002_film)","257":"https:\/\/en.wikipedia.org\/wiki\/The_Three-Body_Problem_(novel)","258":"https:\/\/en.wikipedia.org\/wiki\/Mona_Lisa_Smile","259":"https:\/\/en.wikipedia.org\/wiki\/Finding_Nemo","260":"https:\/\/en.wikipedia.org\/wiki\/Harry_Potter_and_the_Philosopher%27s_Stone_(film)","261":"https:\/\/en.wikipedia.org\/wiki\/The_Devil_Wears_Prada_(film)","262":"https:\/\/en.wikipedia.org\/wiki\/Iron_Man_2","263":"https:\/\/en.wikipedia.org\/wiki\/Harry_Potter_and_the_Philosopher%27s_Stone_(film)","264":"https:\/\/en.wikipedia.org\/wiki\/Deadpool_2","265":"https:\/\/en.wikipedia.org\/wiki\/Princess_Protection_Program","266":"https:\/\/en.wikipedia.org\/wiki\/Next_Friday","267":"https:\/\/en.wikipedia.org\/wiki\/How_to_Train_Your_Dragon_(2025_film)","268":"https:\/\/en.wikipedia.org\/wiki\/127_Hours","269":"https:\/\/en.wikipedia.org\/wiki\/Inception","270":"https:\/\/en.wikipedia.org\/wiki\/Demon_Slayer:_Kimetsu_no_Yaiba_%E2%80%93_The_Movie:_Infinity_Castle"}}